<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>当Web设计师遭遇HTML5</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#00796b">
  <meta name="msapplication-TileColor" content="#4E8071"/>
  
  
  
  
  <link rel="stylesheet" href="/css/style.css" type="text/css"> 
</head>


<body>

  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
  <header id="header" class="inner">
    <a href="/" class="profilepic">
      <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	</a>
	<p class="header-subtitle">分享有助于提升</p>
    <nav class="header-menu">
      <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li>
      </ul>
    </nav>
  </header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  <div class="intrude-less">
    <header id="header" class="inner">
      <a href="/" class="profilepic">
        <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	  </a>
	  <p class="header-subtitle">分享有助于提升</p>
	  <nav class="header-menu">
	    <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li><div class="clearfix"></div>
		</ul>
	  </nav>
	</header>				
  </div>
</nav>

      <div class="body-wrap">
<article id="post-当Web设计师遭遇HTML5" class="article article-type-post" itemscope itemprop="blogPost">

   
    
    <div class="article-meta">
      
<div class="article-date">
<span class="datetime-published-tag"> 2013-03-20 </span>
</div>


    </div>
    
    
  
  <div class="article-inner block-select">
  
    
    
      <header class="article-header">
        
           
  
    <h1 class="article-title" itemprop="name">
      当Web设计师遭遇HTML5
    </h1>
  

        
      </header>
      
      <div class="article-info article-info-post">
        

        
             <div class="clearfix"></div>
        
      </div>
      
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>HTML 5&#xFF0C;<a href="http://developer.51cto.com/art/201106/269603.htm" target="_blank" rel="external">&#x88AB;&#x4F20;&#x4E3A;Fla<strong>s</strong>h &#x7684;&#x6740;&#x624B;</a>&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x7528;&#x4E8E;web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x3001;&#x5177;&#x6709;&#x53D8;&#x9769;&#x610F;&#x4E49;&#x7684;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#x3002;HTML 5&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x5143;&#x7D20;&#x548C;&#x5C5E;&#x6027;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E9B;&#x662F;&#x6280;&#x672F;&#x4E0A;&#x7C7B;&#x4F3C;&lt;div&gt;&#x548C;&lt;<strong>s</strong>pan&gt;&#x6807;&#x7B7E;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x5B9A;&#x542B;&#x4E49;&#xFF0C;<a href="http://developer.51cto.com/art/200907/133407.htm" target="_blank" rel="external">&#x4F8B;&#x5982;&lt;nav&gt;&#x548C;&lt;footer&gt;</a> &#x3002;&#x8FD9;&#x79CD;&#x6807;&#x7B7E;&#x5C06;&#x6709;&#x5229;&#x4E8E;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x7D22;&#x5F15;&#x6574;&#x7406;&#x3001;&#x5C0F;&#x5C4F;&#x5E55;&#x8BBE;&#x5907;&#x548C;&#x89C6;&#x969C;&#x4EBA;&#x58EB;&#x4F7F;&#x7528;&#x3002;&#x540C;&#x65F6;&#x4E3A;&#x5176;&#x4ED6;&#x6D4F;&#x89C8;&#x8981;&#x7D20;&#x63D0;&#x4F9B;&#x4E86;&#x65B0;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x63A5;&#x53E3;&#xFF0C;&#x5982;&lt;audio&gt;&#x548C;&lt;video&gt;&#x6807;&#x8BB0;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x539F;&#x5148;&#x7684;DOM&#x63A5;&#x53E3;&#xFF0C;HTML5&#x589E;&#x52A0;&#x4E86;&#x66F4;&#x591A;&#x6837;&#x5316;&#x7684;API:</p>
<p>&#x25C6; &#x5B9E;&#x65F6;&#x4E8C;&#x7EF4;&#x7ED8;&#x56FE;</p>
<p>Canva<strong>s</strong> API:&#x6709;&#x5173;&#x52A8;&#x6001;&#x4EA7;&#x51FA;&#x4E0E;&#x6E32;&#x67D3;&#x56FE;&#x5F62;&#x3001;&#x56FE;&#x8868;&#x3001;&#x56FE;&#x50CF;&#x548C;&#x52A8;&#x753B;&#x7684;API&#x3002;</p>
<p>&#x25C6; &#x5B9A;&#x65F6;&#x5A92;&#x4F53;&#x64AD;&#x653E;</p>
<p>HTML5 &#x97F3;&#x9891;&#x4E0E;&#x89C6;&#x9891;:HTML5&#x91CC;&#x65B0;&#x589E;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5B83;&#x4EEC;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x5957;&#x901A;&#x7528;&#x7684;&#x3001;&#x96C6;&#x6210;&#x7684;&#x3001;&#x811A;&#x672C;&#x5F0F;&#x7684;&#x5904;&#x7406;&#x97F3;&#x9891;&#x4E0E;&#x89C6;&#x9891;&#x7684;API&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x5B89;&#x88C5;&#x4EFB;&#x4F55;&#x63D2;&#x4EF6;&#x3002;</p>
<p>&#x25C6; &#x79BB;&#x7EBF;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x5E93;(&#x79BB;&#x7EBF;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;)</p>
<p>&#x25C6; &#x7F16;&#x8F91;</p>
<p>&#x25C6; &#x62D6;&#x653E;</p>
<p>&#x25C6; &#x8DE8;&#x6587;&#x6863;&#x901A;&#x4FE1;</p>
<p>&#x25C6; &#x901A;&#x4FE1;/&#x7F51;&#x7EDC;</p>
<p><a name="qihoosnap3"></a><strong>Com</strong>munication API<strong>s</strong>:&#x6784;&#x5EFA;&#x5B9E;&#x65F6;&#x548C;&#x8DE8;&#x6E90;(cro<strong>s**</strong>s<strong>-origin)&#x901A;&#x4FE1;&#x7684;&#x4E24;&#x5927;&#x57FA;&#x7840;: &#x8DE8;&#x6587;&#x6863;&#x901A;&#x4FE1;(Cro</strong>s<strong>**s</strong> Document Me<strong>s**</strong>s<strong>aging)&#x4E0E; XMLHttpReque</strong>s**t Level 2&#x3002;</p>
<p>&#x25C6; &#x6D4F;&#x89C8;&#x5386;&#x53F2;&#x7BA1;&#x7406;</p>
<p>&#x25C6; MIME&#x548C;&#x534F;&#x8BAE;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x65F6;&#x8868;&#x5934;&#x767B;&#x8BB0;</p>
<p>&#x25C6; &#x5FAE;&#x6570;&#x636E;</p>
<p>&#x4EE5;&#x4E0A;&#x6280;&#x672F;&#x8BF4;&#x660E;&#x5B58;&#x5728;&#x4E8E;WHATWG HTML&#x8BF4;&#x660E;&#x6587;&#x6863;&#x4E2D;&#xFF0C;&#x4F46;&#x5E76;&#x6CA1;&#x6709;&#x5168;&#x90E8;&#x5305;&#x542B;&#x5728;W3C HTML5&#x7684;&#x8BF4;&#x660E;&#x6587;&#x6863;&#x91CC;;W3C&#x53E6;&#x5BF9;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x505A;&#x4E86;&#x5355;&#x72EC;&#x8BF4;&#x660E;&#xFF0C;&#x6B64;&#x6587;&#x4E0D;&#x518D;&#x4E00;&#x4E00;&#x8D58;&#x8FF0;&#x3002;</p>
<p>&#x542C;&#x8D77;&#x6765;&#x7565;&#x6709;&#x4E9B;&#x592A;&#x8FC7;&#x6280;&#x672F;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;HTML5&#x5BF9;&#x8BBE;&#x8BA1;&#x5C06;&#x4F1A;&#x6709;&#x54EA;&#x4E9B;&#x5F71;&#x54CD;&#x5462;?&#x8FD9;&#x662F;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x5E08;&#x548C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x538C;&#x5176;&#x70E6;&#x8BA8;&#x8BBA;&#x4E86;&#x7F16;&#x7A0B;&#x4EE3;&#x7801;&#x540E;&#x4E0D;&#x5F97;&#x4E0D;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>HTML5&#x53CA;web app &#x7684;&#x4F18;&#x52BF;</strong></p>
<p>&#x4EE5;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x9886;&#x57DF;&#x4E3A;&#x4F8B;&#xFF0C;&#x9762;&#x5BF9;&#x4F17;&#x591A;&#x7684;&#x7EC8;&#x7AEF;&#x8BBE;&#x5907;&#x548C;&#x5E73;&#x53F0;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x548C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x5F97;&#x4E0D;&#x5728;&#x4EA7;&#x54C1;&#x7684;&#x5C55;&#x73B0;&#x548C;&#x4F53;&#x9A8C;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x65B9;&#x9762;&#x505A;&#x51FA;&#x59A5;&#x534F;&#x4E3E;&#x63AA;&#xFF0C;&#x5E76;&#x5728;&#x75B2;&#x4E8E;&#x586B;&#x94FA;&#x5E73;&#x53F0;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6D6A;&#x8D39;&#x4E86;&#x6211;&#x4EEC;&#x5982;&#x6B64;&#x591A;&#x7684;&#x7CBE;&#x529B;&#x3002;&#x4EA7;&#x54C1;&#x672C;&#x6765;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x66F4;&#x9AD8;&#x7684;&#x6C34;&#x51C6;&#xFF0C;&#x4F46;&#x79FB;&#x52A8;&#x7EC8;&#x7AEF;&#x788E;&#x7247;&#x5316;(&#x5305;&#x62EC;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;)&#x7684;&#x73B0;&#x5B9E;&#x5C06;&#x7F8E;&#x597D;&#x7684;&#x613F;&#x671B;&#x963B;&#x62E6;&#x5728;&#x5916;&#x3002;</p>
<p>&#x5F53;&#x524D;&#x4E3B;&#x6D41;&#x7684;&#x624B;&#x673A;&#x5F00;&#x53D1;&#x5E73;&#x53F0;&#x6709;:iO<strong>S</strong>&#x3001;<strong>S</strong>ymbian&#x3001;Linux&#x3001;Palm&#x3001;BlackBerry&#x3001;Window<strong>s</strong> Mobile&#x3001;Android&#x7B49;&#x3002;&#x5176;&#x4E2D;&#xFF0C;iO<strong>S</strong>&#x5E73;&#x53F0;&#x9700;&#x8981;&#x9488;&#x5BF9;480<em>320&#x3001;960</em>640&#x53CA;1024<em>768&#x7684;&#x5206;&#x8FA8;&#x7387;&#x5206;&#x522B;&#x8BBE;&#x8BA1;;Android&#x5E73;&#x53F0;&#x4E2D;QVGA&#x5206;&#x8FA8;&#x7387;&#x4E3A;240</em>320&#xFF0C;WQVGA&#x5206;&#x8FA8;&#x7387;&#x4E3A;240<em>400&#xFF0C;HVGA&#x5206;&#x8FA8;&#x7387;&#x4E3A;320</em>480&#xFF0C;WVGA&#x5206;&#x8FA8;&#x7387;&#x4E3A;480<em>800&#xFF0C;FWVGA&#x5206;&#x8FA8;&#x7387;&#x4E3A;480</em>854&#x7B49;&#x7B49;;<strong>S</strong>ymbian&#x7CFB;&#x7EDF;&#x53EF;&#x8C13;&#x5386;&#x53F2;&#x60A0;&#x4E45;&#xFF0C;&#x73B0;&#x5728;&#x5F00;&#x53D1;&#x4E3B;&#x8981;&#x9488;&#x5BF9;<strong>S</strong>60 V3&#x548C;V5&#x4E24;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x5206;&#x8FA8;&#x7387;&#x4ECD;&#x6709;176<em>208&#x3001;208</em>208&#x3001;240<em>320/320</em>240&#x3001;352<em>416/416</em>352&#x53CA;800*352&#x7B49;&#x4F17;&#x591A;&#x79CD;&#x7C7B;&#x3002;&#x5373;&#x4F7F;&#x540C;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#xFF0C;&#x5206;&#x8FA8;&#x7387;&#x4E0D;&#x540C;&#x8BBE;&#x8BA1;&#x4E5F;&#x5C31;&#x4F1A;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x52A0;&#x4E4B;&#x5BA2;&#x6237;&#x7AEF;&#x4EA7;&#x54C1;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x7684;&#x66F4;&#x65B0;&#x8FED;&#x4EE3;&#xFF0C;&#x4ECE;1.0&#x7248;&#x672C;&#x3001;2.0&#x7248;&#x672C;&#x4E00;&#x76F4;&#x5230;N.0&#x7248;&#x672C;;&#x6BCF;&#x5F00;&#x53D1;&#x4E00;&#x6B21;native app &#x5C31;&#x9700;&#x8981;&#x94FA;&#x4E00;&#x6B21;&#x5E73;&#x53F0;&#x3002;&#x5E76;&#x4E14;&#x73B0;&#x5B9E;&#x72B6;&#x51B5;&#x662F;&#x5E76;&#x975E;&#x6240;&#x6709;&#x7528;&#x6237;&#x90FD;&#x4F1A;&#x79EF;&#x6781;&#x66F4;&#x65B0;&#x65B0;&#x7248;&#x672C;&#xFF0C;&#x6240;&#x4EE5;&#x8BBE;&#x8BA1;&#x5E08;&#x548C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x7814;&#x53D1;&#x65B0;&#x529F;&#x80FD;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x8981;&#x987E;&#x5FCC;&#x4E4B;&#x524D;&#x7684;&#x65E7;&#x7248;&#x672C;&#x4F1A;&#x4E0D;&#x4F1A;&#x652F;&#x6301;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x4E58;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x4EBA;&#x529B;&#x7269;&#x529B;&#x88AB;&#x6295;&#x5165;&#x5230;&#x4E86;&#x94FA;&#x8BBE;&#x5E73;&#x53F0;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x63D0;&#x9AD8;&#x4EA7;&#x54C1;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x7CBE;&#x529B;&#x6BD4;&#x8F83;&#x6709;&#x9650;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#x4EBA;&#x4EEC;&#x53D7;&#x591F;&#x4E86;&#x7EC8;&#x7AEF;&#x8BBE;&#x5907;&#x788E;&#x7247;&#x5316;&#x7684;&#x6298;&#x78E8;&#xFF0C;&#x5F00;&#x59CB;&#x671F;&#x76FC;&#x7740;&#x4E00;&#x79CD;&#x6709;&#x522B;&#x4E8E;native app&#x7684;&#x4E8B;&#x7269;&#x51FA;&#x73B0;&#x3002;&#x7531;HTML5&#x6280;&#x672F;&#x5F00;&#x53D1;&#x7684;web app&#x7684;&#x51FA;&#x73B0;&#x7ED9;&#x4E88;&#x4E86;&#x8BBE;&#x8BA1;&#x5E08;&#x548C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7F8E;&#x597D;&#x613F;&#x666F;&#x3002;HTML5&#x6280;&#x672F;&#x7684;&#x6E32;&#x67D3;&#x8FC7;&#x7A0B;&#x4E3B;&#x8981;&#x662F;&#x7531;&#x6D4F;&#x89C8;&#x5668;&#x3001;&#x5185;&#x5D4C;HTML5&#x89E3;&#x6790;&#x5668;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3001;&#x652F;&#x6301;&#x4E66;&#x7B7E;&#x6253;&#x5F00;&#x65B9;&#x5F0F;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6291;&#x6216;&#x662F;&#x79FB;&#x52A8;&#x624B;&#x673A;&#x4EA7;&#x54C1;&#x8FDB;&#x884C;&#x7684;&#x3002;&#x5982;&#x6B64;&#xFF0C;&#x4EA7;&#x54C1;&#x7684;&#x4E0A;&#x7EBF;&#x548C;&#x7248;&#x672C;&#x66F4;&#x65B0;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x90A3;&#x4E48;&#x957F;&#x65F6;&#x95F4;&#x6765;&#x94FA;&#x5E73;&#x53F0;&#xFF0C; Appcelerator&#x7684;&#x5185;&#x90E8;&#x903B;&#x8F91;&#x4F1A;&#x5C06;&#x4EA7;&#x54C1;&#x7684;UI&#x8F6C;&#x6362;&#x4E3A;iO<strong>S</strong>&#x6216;Android&#x7B49;&#x5E73;&#x53F0;&#x7684;&#x539F;&#x751F;&#x754C;&#x9762;&#x3002;&#x540C;&#x65F6;&#xFF0C;web app&#x5F62;&#x5F0F;&#x7684;&#x4EA7;&#x54C1;&#x4E0D;&#x9700;&#x8981;&#x7528;&#x6237;&#x4E0B;&#x8F7D;&#x66F4;&#x65B0;&#xFF0C;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5373;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6700;&#x65B0;&#x7248;&#x672C;;&#x4E5F;&#x4FBF;&#x4E8E;&#x8BBE;&#x8BA1;&#x5E08;&#x548C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8C03;&#x8BD5;&#x548C;&#x4FEE;&#x6B63;&#x9519;&#x8BEF;&#xFF0C;&#x4E0D;&#x518D;&#x5B58;&#x5728;&#x540C;&#x65F6;&#x517C;&#x987E;&#x65B0;&#x65E7;&#x7248;&#x672C;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>HTML5&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7684;&#x6548;&#x679C;</strong></p>
<p>HTML5&#x5A01;&#x529B;&#x5982;&#x6B64;&#x5F3A;&#x5927;&#xFF0C;&#x786E;&#x5B9E;&#x62E5;&#x6709;&#x63D0;&#x9AD8;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#x8D28;&#x91CF;&#x3001;&#x6539;&#x5584;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x73B0;&#x5B9E;&#x73AF;&#x5883;&#x7684;&#x6F5C;&#x529B;&#x3002;&#x56E0;&#x6B64;&#x8BBE;&#x8BA1;&#x5E08;&#x548C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9700;&#x8981;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x5FC5;&#x8981;&#x7684;&#x4E86;&#x89E3;&#x3002;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x8BBE;&#x8BA1;&#x5E08;&#x5C31;&#x8981;&#x653E;&#x4E0B;&#x81EA;&#x5DF1;&#x624B;&#x4E2D;&#x7684;&#x5DE5;&#x4F5C;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x5E94;&#x5F53;&#x8003;&#x8651;HTML5&#x5BF9;&#x5177;&#x4F53;&#x7684;&#x8BBE;&#x8BA1;&#x5C06;&#x4F1A;&#x6709;&#x54EA;&#x4E9B;&#x660E;&#x663E;&#x7684;&#x6539;&#x53D8;&#xFF0C;HTML5&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8BBE;&#x8BA1;&#x6548;&#x679C;?</p>
<p>&#x63A8;&#x8350;:<a href="http://developer.51cto.com/art/201105/263206.htm" target="_blank" rel="external">HTML 5&#x53EF;&#x4EE5;&#x505A;&#x4E94;&#x4EF6;&#x4E8B;&#x60C5; &#x8D85;&#x51FA;&#x4F60;&#x7684;&#x60F3;&#x8C61;</a></p>
<p>&#x5728;&#x82F9;&#x679C;&#x3001;&#x8C37;&#x6B4C;&#x53CA;&#x5FAE;&#x8F6F;&#x7B49;&#x5DE8;&#x5934;&#x516C;&#x53F8;&#x7684;&#x79EF;&#x6781;&#x5021;&#x5BFC;&#x4E0B;&#xFF0C;HTML5&#x6280;&#x672F;&#x8FDB;&#x6B65;&#x795E;&#x901F;&#xFF0C;web app&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7684;&#x6548;&#x679C;&#x6108;&#x6765;&#x6108;&#x4E30;&#x5BCC;&#x3002;&#x5F88;&#x591A;web app&#x786E;&#x5B9E;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x548C;native app&#x76F8;&#x5AB2;&#x7F8E;&#x4E86;&#x3002;&#x5BF9;HTML5&#x652F;&#x6301;&#x6700;&#x597D;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x662F;<strong>S</strong>afari&#x548C;Chrome&#xFF0C;Firefox&#x548C; Opera&#x5DEE;&#x5F3A;&#x4EBA;&#x610F;&#xFF0C;IE&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#x5EA6;&#x6700;&#x4F4E;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;:</p>
<p><img src="http://images.51cto.com/files/uploadimg/20110803/1124221.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x5E38;&#x5E38;&#x4F1A;&#x89C1;&#x5230;&#x7C7B;&#x4F3C;&#x300A;<a href="http://developer.51cto.com/art/201104/253976.htm" target="_blank" rel="external">&#x4E5D;&#x4E2A;&#x4EE4;&#x4EBA;&#x60CA;&#x53F9;&#x7684;HTML 5&#x548C;Java<strong>S</strong>cript&#x5B9E;&#x9A8C;</a>&#x300B;&#x3001;&#x300A;<a href="http://developer.51cto.com/art/201108/280436.htm" target="_blank" rel="external">49&#x4E2A;&#x8D85;&#x70AB;&#x7684;HTML 5&#x793A;&#x4F8B;</a>&#x300B;&#x7B49;&#x76F8;&#x5173;&#x4ECB;&#x7ECD;&#x6587;&#x7AE0;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x53EF;&#x4EE5;&#x65F6;&#x5E38;&#x62FF;&#x6765;&#x628A;&#x73A9;&#x4F53;&#x9A8C;&#x4E00;&#x756A;&#x3002;&#x672C;&#x6587;&#x56FF;&#x4E8E;&#x7BC7;&#x5E45;&#x9650;&#x5236;&#xFF0C;&#x5728;&#x6B64;&#x53EA;&#x4E3E;&#x51E0;&#x4E2A;&#x5E94;&#x7528;HTML5&#x6280;&#x672F;&#x6BD4;&#x8F83;&#x5178;&#x578B;&#x7684;&#x7F51;&#x7AD9;&#x4EA7;&#x54C1;&#x8FDB;&#x884C;&#x793A;&#x4F8B;&#x8BF4;&#x660E;&#x3002;</p>
<p>&#x79FB;&#x52A8;&#x7EC8;&#x7AEF;</p>
<p>1.Gmail</p>
<p><img src="http://images.51cto.com/files/uploadimg/20110803/1124222.png" alt=""></p>
<p>2.Youtube</p>
<p><img src="http://images.51cto.com/files/uploadimg/20110803/1124223.png" alt=""></p>
<p>3.Ve<strong>s**</strong>s**eltracker</p>
<p><img src="http://images.51cto.com/files/uploadimg/20110803/1124224.png" alt=""></p>
<p><strong>PC&#x7AEF;</strong></p>
<p>&#xA0;</p>
<p>1. Flickr Brow<strong>s</strong>er</p>
<p><img src="http://images.51cto.com/files/uploadimg/20110803/1124225.jpg" alt=""></p>
<p>2. X-World<strong>s</strong></p>
<p><img src="http://images.51cto.com/files/uploadimg/20110803/1124226.jpg" alt=""></p>
<p>3. C<strong>S**</strong>S**Warp</p>
<p><img src="http://images.51cto.com/files/uploadimg/20110803/1124227.jpg" alt=""></p>
<p>&#x8BBE;&#x8BA1;&#x5E08;&#x901A;&#x8FC7;&#x4EB2;&#x81EA;&#x4F53;&#x9A8C;&#x8FD9;&#x4E9B;HTML5&#x624B;&#x673A;&#x5E94;&#x7528;&#x6216;&#x7F51;&#x7AD9;&#xFF0C;&#x5BF9;HTML5&#x6240;&#x80FD;&#x652F;&#x6301;&#x7684;&#x6548;&#x679C;&#x7EC6;&#x8282;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x6982;&#x7684;&#x3001;&#x611F;&#x6027;&#x7684;&#x8BA4;&#x77E5;&#x3002;&#x7C4D;&#x6B64;&#x83B7;&#x5F97;&#x7684;&#x8BBE;&#x8BA1;&#x611F;&#x77E5;&#x80FD;&#x529B;&#x8FDC;&#x6BD4;&#x770B;&#x51E0;&#x884C;&#x8BA9;&#x4EBA;&#x5934;&#x6655;&#x7684;&#x4EE3;&#x7801;&#x8981;&#x6DF1;&#x523B;&#x3001;&#x6613;&#x4E8E;&#x8FD0;&#x7528;&#x3002;</p>
<p><strong>HTML5&#x8FD1;&#x671F;&#x4E3A;&#x4EC0;&#x4E48;&#x65E0;&#x6CD5;&#x6210;&#x4E3A;&#x4E3B;&#x6D41;</strong></p>
<p>&#x770B;&#x4E86;&#x4EE5;&#x4E0A;&#x7F51;&#x7AD9;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x611F;&#x89C9;HTML5&#x5F88;&#x9177;?&#x65E2;&#x7136;&#x5B83;&#x8FD9;&#x4E48;&#x4F18;&#x79C0;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x5C31;&#x89E3;&#x51B3;&#x7EC8;&#x7AEF;&#x788E;&#x7247;&#x5316;&#x7684;&#x56F0;&#x6270;&#xFF0C;&#x53C8;&#x4FBF;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5B9E;&#x73B0;&#xFF0C;&#x90A3;&#x4E48;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E0D;&#x8D76;&#x7D27;&#x5C06;HTML5&#x63A8;&#x5E7F;&#x5F00;&#x6765;?&#x6211;&#x4EEC;&#x5230;&#x5E95;&#x5728;&#x7B49;&#x5F85;&#x4EC0;&#x4E48;?&#x7136;&#x800C;&#x6B8B;&#x9177;&#x7684;&#x73B0;&#x5B9E;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;HTML5&#x7684;&#x65F6;&#x4EE3;&#x8FD8;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x5230;&#x6765;&#xFF0C;&#x5728;&#x8FD1;&#x671F;&#x5185;&#x4ECD;&#x65E0;&#x6CD5;&#x53D6;&#x4EE3;native app&#x6210;&#x4E3A;&#x4E3B;&#x6D41;&#x3002;&#x7B14;&#x8005;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5C06;&#x539F;&#x56E0;&#x5F52;&#x7ED3;&#x4E3A;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;:</p>
<p><strong>HTML5&#x672C;&#x8EAB;</strong></p>
<p>W3C&#x8868;&#x793A;&#x5728;2014&#x5E74;&#x4E4B;&#x524D;&#x4E0D;&#x4F1A;&#x516C;&#x5E03;&#x6709;&#x5173;HTML5&#x7684;&#x6807;&#x51C6;&#x3002;&#x73B0;&#x5728;&#x5404;&#x5927;&#x516C;&#x53F8;&#x79EF;&#x6781;&#x5F00;&#x53D1;&#x610F;&#x56FE;&#x8D70;&#x5728;web app &#x4EA7;&#x54C1;&#x7814;&#x53D1;&#x4E2D;&#x7684;&#x524D;&#x5217;&#xFF0C;&#x4F46;&#x4ECD;&#x5904;&#x4E8E;&#x63A2;&#x7D22;&#x9636;&#x6BB5;&#x3002;HTML5&#x8FD8;&#x6CA1;&#x6709;&#x6E05;&#x6670;&#x660E;&#x786E;&#x7684;&#x7EDF;&#x4E00;&#x6807;&#x51C6;&#xFF0C;&#x4E5F;&#x5C31;&#x96BE;&#x4EE5;&#x5927;&#x8303;&#x56F4;&#x7684;&#x63A8;&#x5E7F;&#x3002;&#x7B49;&#x5F85;&#x8BE5;&#x6280;&#x672F;&#x6210;&#x4E3A;&#x4E3B;&#x6D41;&#xFF0C;&#x4ECD;&#x9700;&#x5C1A;&#x5F85;&#x65F6;&#x65E5;&#x3002;(<a href="http://developer.51cto.com/art/201107/277503.htm" target="_blank" rel="external">&#x6211;&#x4EEC;&#x79BB;HTML 5&#x8FD8;&#x6709;&#x591A;&#x8FDC;?</a>)</p>
<p><strong>&#x6D4F;&#x89C8;&#x5668;</strong></p>
<p>&#x6CA1;&#x9519;&#xFF0C;web app&#x786E;&#x5B9E;&#x53EA;&#x9700;&#x8981;&#x7F51;&#x7EDC;&#x8BBF;&#x95EE;&#x5C31;&#x53EF;&#x4EE5;&#x3002;&#x4F46;&#x662F;&#x4EA7;&#x54C1;&#x7684;&#x6548;&#x679C;&#x9700;&#x8981;&#x652F;&#x6301;HTML5&#x6280;&#x672F;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x8FDB;&#x884C;&#x6E32;&#x67D3;&#xFF0C;&#x4EA7;&#x54C1;&#x7684;&#x7EC4;&#x4EF6;&#x9700;&#x8981;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x63A7;&#x4EF6;&#x5E93;&#x6765;&#x642D;&#x5EFA;&#x5B8C;&#x6210;&#x3002;&#x73B0;&#x6709;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x5728;&#x63A7;&#x4EF6;&#x5E93;&#x65B9;&#x9762;&#x90FD;&#x5B58;&#x5728;&#x6F0F;&#x6D1E;&#xFF0C;&#x81F4;&#x4F7F;web app&#x7684;&#x6548;&#x679C;&#x65E0;&#x6CD5;&#x5168;&#x90E8;&#x65BD;&#x5C55;&#xFF0C;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x8F83;&#x6162;&#x3002;HTML5&#x5927;&#x884C;&#x5176;&#x9053;&#xFF0C;&#x4E00;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4F5C;&#x7528;&#x975E;&#x6BD4;&#x5BFB;&#x5E38;&#x3002;&#x800C;&#x8FD9;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x624D;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#xFF0C;&#x8FD8;&#x6CA1;&#x4EBA;&#x77E5;&#x9053;&#x3002;</p>
<p><strong>&#x7F51;&#x7EDC;&#x4FE1;&#x53F7;</strong></p>
<p>Native app &#x5728;&#x79BB;&#x7EBF;&#x72B6;&#x6001;&#x4E0B;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x7A33;&#x5B9A;&#x6027;&#x6BD4;&#x8F83;&#x597D;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;Web app&#x5BF9;&#x7F51;&#x7EDC;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x66F4;&#x5927;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x548C;&#x201C;&#x4E91;&#x201D;&#x6709;&#x4E9B;&#x76F8;&#x4F3C;&#xFF0C;&#x6CA1;&#x6709;&#x63A5;&#x901A;&#x7F51;&#x7EDC;&#x5C31;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x5176;&#x670D;&#x52A1;(&#x867D;&#x7136;HTML5&#x652F;&#x6301;&#x79BB;&#x7EBF;&#x5B58;&#x50A8;)&#x3002;&#x73B0;&#x4ECA;&#x56FD;&#x5185;&#x7684;wifi&#x666E;&#x53CA;&#x7387;&#x8FD8;&#x975E;&#x5E38;&#x4F4E;&#xFF0C;3G&#x7F51;&#x7EDC;&#x8986;&#x76D6;&#x7387;&#x4E5F;&#x6709;&#x5F85;&#x5B8C;&#x5584;&#x800C;&#x4E14;&#x8D39;&#x7528;&#x504F;&#x9AD8;&#x3001;&#x7A33;&#x5B9A;&#x6027;&#x4E0D;&#x5F3A;&#x3002;&#x65E0;&#x8BBA;&#x4ECE;&#x7A33;&#x5B9A;&#x6027;&#x8FD8;&#x662F;&#x6D41;&#x91CF;&#x8D44;&#x8D39;&#x89D2;&#x5EA6;&#x8003;&#x8651;&#xFF0C;&#x7528;&#x6237;&#x90FD;&#x6CA1;&#x6709;&#x80FD;&#x529B;&#x820D;&#x5F03;native app.</p>
<p><strong>&#x79FB;&#x52A8;&#x7EC8;&#x7AEF;</strong></p>
<p>&#x79FB;&#x52A8;&#x7EC8;&#x7AEF;(&#x4E3B;&#x8981;&#x662F;&#x624B;&#x673A;)&#x7684;&#x5E02;&#x573A;&#x5206;&#x5E03;&#x60C5;&#x51B5;&#x4E5F;&#x662F;HTML5&#x7684;&#x5F71;&#x54CD;&#x56E0;&#x7D20;&#x4E4B;&#x4E00;&#x3002;&#x667A;&#x80FD;&#x624B;&#x673A;&#x7684;&#x5E02;&#x573A;&#x4EFD;&#x989D;&#x8FD8;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x529F;&#x80FD;&#x624B;&#x673A;&#x4ECD;&#x5360;&#x6709;&#x7EDD;&#x5BF9;&#x7684;&#x4F18;&#x52BF;&#x5730;&#x4F4D;&#x3002;&#x800C;&#x5728;web app&#x7684;&#x652F;&#x6301;&#x6027;&#x65B9;&#x9762;&#x667A;&#x80FD;&#x624B;&#x673A;&#x65E0;&#x7591;&#x662F;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x5176;&#x6B21;&#x662F;&#x793E;&#x4EA4;&#x624B;&#x673A;&#xFF0C;&#x529F;&#x80FD;&#x624B;&#x673A;&#x652F;&#x6301;&#x6027;&#x6700;&#x5DEE;&#x3002;&#x79FB;&#x52A8;&#x7EC8;&#x7AEF;&#x7684;&#x5E02;&#x573A;&#x4EFD;&#x989D;&#x5206;&#x5E03;&#x60C5;&#x51B5;&#x6210;&#x4E3A;HTML5&#x8FD1;&#x671F;&#x63A8;&#x5E7F;&#x7684;&#x74F6;&#x9888;&#x3002;&#x5982;&#x56FE;&#x6240;&#x793A;:</p>
<p><img src="http://images.51cto.com/files/uploadimg/20110803/1124228.png" alt=""></p>
<p><strong>&#x8BBE;&#x8BA1;&#x5E08;&#x5E94;&#x5982;&#x4F55;&#x5E94;&#x5BF9;HTML5?</strong></p>
<p>51CTO&#x63A8;&#x8350;&#x4E13;&#x9898;: <a href="http://developer.51cto.com/art/201106/269101.htm" target="_blank" rel="external">HTML 5&#x6765;&#x88AD;:WEB&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x9762;&#x4E34;&#x5341;&#x5B57;&#x8DEF;&#x53E3;</a></p>
<p>&#x5728;&#x4E86;&#x89E3;&#x4E86;HTML5&#x6280;&#x672F;&#x7684;&#x4F18;&#x52BF;&#x3001;&#x6548;&#x679C;&#x4EE5;&#x53CA;&#x5B9E;&#x73B0;&#x8FDB;&#x5EA6;&#x4E4B;&#x540E;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x81EA;&#x5DF1;&#x63A5;&#x4E0B;&#x6765;&#x9700;&#x8981;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x4E86;&#x3002;HTML5&#x662F;&#x4E92;&#x8054;&#x7F51;&#x7814;&#x53D1;&#x7684;&#x5FC5;&#x7136;&#x8D8B;&#x52BF;&#x4E4B;&#x4E00;&#xFF0C; &#x5177;&#x6709;&#x63D0;&#x9AD8;&#x4EA7;&#x54C1;&#x54C1;&#x8D28;&#x7684;&#x5DE8;&#x5927;&#x6F5C;&#x529B;&#x3002;&#x8BBE;&#x8BA1;&#x5E08;&#x552F;&#x6709;&#x987A;&#x5E94;&#x8FD9;&#x4E00;&#x6F6E;&#x6D41;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x79EF;&#x6781;&#x6295;&#x8EAB;&#x5230;HTML5&#x7684;&#x8BD5;&#x9A8C;&#x7814;&#x53D1;&#x4E2D;&#xFF0C;&#x624D;&#x80FD;&#x5728;&#x65F6;&#x4EE3;&#x7684;&#x5927;&#x6F6E;&#x4E2D;&#x63E1;&#x6709;&#x5148;&#x673A;&#x3002;&#x90A3;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x5F53;&#x600E;&#x4E48;&#x505A;&#x6291;&#x6216;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x5462;?&#x7B14;&#x8005;&#x6709;&#x51E0;&#x4E2A;&#x6D45;&#x8584;&#x7684;&#x5EFA;&#x8BAE;&#x5206;&#x4EAB;&#x7ED9;&#x5927;&#x5BB6;:</p>
<p><strong>&#x5F62;&#x6210;&#x4F01;&#x4E1A;&#x7684;&#x4E00;&#x81F4;&#x98CE;&#x683C;&#xFF0C;&#x589E;&#x5F3A;&#x8BC6;&#x522B;&#x6027;</strong></p>
<p>&#x73B0;&#x5728;&#x7684;native app &#x90FD;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x4E25;&#x5389;&#x7684;&#x5BA1;&#x6838;&#x624D;&#x80FD;&#x4E0A;&#x67B6;&#x201C;&#x5E94;&#x7528;&#x5546;&#x5E97;&#x201D;&#xFF0C;&#x5373;&#x4F7F;&#x5982;&#x6B64;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x6570;&#x91CF;&#x6FC0;&#x589E;&#xFF0C;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x6EE1;&#x610F;&#x7684;&#x5E94;&#x7528;&#x8C08;&#x4F55;&#x5BB9;&#x6613;&#x3002;&#x5982;&#x679C;web app&#x7684;&#x65F6;&#x4EE3;&#x5230;&#x6765;&#xFF0C;&#x7528;&#x6237;&#x53EA;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x6D4F;&#x89C8;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x4F7F;&#x7528;&#x67D0;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x6CA1;&#x6709;&#x4E86;&#x201C;&#x5E94;&#x7528;&#x5546;&#x5E97;&#x201D;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EA7;&#x54C1;&#x7684;&#x6570;&#x91CF;&#x5C06;&#x96BE;&#x4EE5;&#x4F30;&#x8BA1;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#x6211;&#x4EEC;&#x7684;&#x4EA7;&#x54C1;&#x4F1A;&#x4E0D;&#x4F1A;&#x88AB;&#x6DF9;&#x6CA1;&#x5728;&#x5176;&#x4E2D;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x6837;&#x7684;&#x60B2;&#x5267;&#xFF0C;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x529E;&#x6CD5;&#x662F;&#x4F7F;&#x540C;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x7684;&#x4EA7;&#x54C1;&#x5177;&#x6709;&#x4E00;&#x81F4;&#x98CE;&#x683C;&#xFF0C;&#x5E76;&#x4E14;&#x9C9C;&#x660E;&#x6709;&#x7279;&#x70B9;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x66F4;&#x6709;&#x6548;&#x7684;&#x6293;&#x53BB;&#x7528;&#x6237;&#x7684;&#x6CE8;&#x610F;&#x529B;&#xFF0C;&#x589E;&#x5F3A;&#x4EA7;&#x54C1;&#x7684;&#x8BC6;&#x522B;&#x6027;&#x3002;</p>
<p><strong>&#x5F00;&#x59CB;&#x6CE8;&#x91CD;&#x7279;&#x5B9A;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x9002;&#x914D;</strong></p>
<p>&#x4E3A;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x800C;&#x8BBE;&#x8BA1;&#xFF0C;&#x4E5F;&#x5C31;&#x9700;&#x8981;&#x4E3A;&#x7528;&#x6237;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x7279;&#x5B9A;&#x6D4F;&#x89C8;&#x5668;&#x800C;&#x8BBE;&#x8BA1;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x6211;&#x4EEC;&#x63A7;&#x5236;&#x4E86;&#x4F7F;&#x7528;&#x73AF;&#x5883;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x63A7;&#x5236;&#x786E;&#x4FDD;&#x7528;&#x6237;&#x89D2;&#x5EA6;&#x7684;&#x4EA7;&#x54C1;&#x6548;&#x679C;&#x66F4;&#x597D;&#x3002;&#x4E5F;&#x8BB8;HTML5&#x7684;&#x65F6;&#x4EE3;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x9891;&#x7E41;&#x7684;&#x94FA;&#x5E73;&#x53F0;&#xFF0C;&#x4F46;&#x4E3A;&#x7279;&#x5B9A;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x8BBE;&#x8BA1;&#x7279;&#x5B9A;&#x7684;&#x6548;&#x679C;&#x662F;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x91CD;&#x8981;&#x4E3E;&#x63AA;&#x3002;</p>
<p>Google Wave&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x4F8B;&#x5B50;&#x3002;Google Wave&#x8BD5;&#x56FE;&#x628A;&#x535A;&#x5BA2;&#x3001;&#x90AE;&#x7BB1;&#x3001;&#x5373;&#x65F6;&#x901A;&#x8BAF;&#x4EE5;&#x53CA;wiki<strong>s</strong>&#x7ED3;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x6210;&#x4E3A;&#x4E00;&#x6B3E;&#x5F3A;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x4EA4;&#x6D41;&#x670D;&#x52A1;&#x3002;&#x5B83;&#x662F;&#x7531;HTML5&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x5E76;&#x4E0D;&#x652F;&#x6301;&#x5728;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#x4F7F;&#x7528;&#x3002;&#x867D;&#x7136;&#x56E0;&#x4E3A;&#x5173;&#x6CE8;&#x5EA6;&#x4E0D;&#x9AD8;&#x88AB;Google&#x505C;&#x6B62;&#x670D;&#x52A1;&#xFF0C;&#x4F46;Google Wave&#x4F5C;&#x4E3A;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;&#xFF0C;&#x5DF2;&#x7ECF;&#x5728;HTML5&#x7684;&#x53D1;&#x5C55;&#x9053;&#x8DEF;&#x4E0A;&#x8D70;&#x4E86;&#x5F88;&#x8FDC;&#x5F88;&#x8FDC;&#x3002;</p>
<p><img src="http://images.51cto.com/files/uploadimg/20110803/1124229.png" alt=""></p>
<p><strong>&#x6253;&#x7834;&#x601D;&#x7EF4;&#x5B9A;&#x52BF;&#xFF0C;&#x6CE8;&#x91CD;&#x8FD0;&#x7528;&#x6280;&#x5DE7;</strong></p>
<p>&#x8FD9;&#x4E00;&#x5EFA;&#x8BAE;&#x6765;&#x6E90;&#x4E8E;&#x5B9E;&#x9645;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x9488;&#x5BF9;&#x7684;&#x4E5F;&#x662F;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x4E2D;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x60C5;&#x51B5;&#x3002;Web app &#x7684;&#x8BBE;&#x8BA1;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x6240;&#x9700;&#x8981;&#x5E94;&#x7528;&#x7684;HTML5&#x6280;&#x672F;&#x6548;&#x679C;&#x5F80;&#x5F80;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;;&#x5373;&#x4F7F;&#x6709;&#xFF0C;&#x56E2;&#x961F;&#x4E2D;&#x7684;RD&#x4E5F;&#x672A;&#x5FC5;&#x5168;&#x90FD;&#x505A;&#x5F97;&#x51FA;&#x6765;&#x3002;&#x5176;&#x5B9E;&#x7528;&#x6237;&#x4E0D;&#x5173;&#x5FC3;&#x8FD9;&#x4E2A;&#x6548;&#x679C;&#x662F;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x7528;&#x6237;&#x5173;&#x5FC3;&#x7684;&#x662F;&#x4EA4;&#x4E92;&#x662F;&#x5426;&#x987A;&#x7545;&#x3001;&#x89C6;&#x89C9;&#x611F;&#x5B98;&#x4E0A;&#x662F;&#x5426;&#x6709;&#x54C1;&#x5473;&#x3002;&#x56E0;&#x6B64;&#x8BBE;&#x8BA1;&#x5E08;&#x9700;&#x8981;&#x5728;&#x7EC6;&#x8282;&#x4E0A;&#x6CE8;&#x91CD;&#x63D0;&#x5347;web app&#x7684;&#x54C1;&#x8D28;&#x611F;&#xFF0C;&#x6BD4;&#x5982;&#x8FB9;&#x6846;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x6BD4;&#x5982;&#x7FFB;&#x9875;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x6BD4;&#x5982;&#x5B50;&#x4EA7;&#x54C1;&#x5217;&#x8868;&#x7684;&#x8BBE;&#x8BA1;&#x7B49;&#x7B49;&#x3002;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x505A;&#x4E00;&#x4E9B;&#x201C;&#x4F2A;app&#x6548;&#x679C;&#x201D;&#x3002;&#x8FD9;&#x65B9;&#x9762;m.naver.<strong>com</strong>&#x505A;&#x5F97;&#x975E;&#x5E38;&#x68D2;&#xFF0C;&#x5E03;&#x5C40;&#x8BBE;&#x8BA1;&#x3001;&#x529F;&#x80FD;&#x6309;&#x94AE;&#x7684;&#x8BBE;&#x8BA1;&#x90FD;&#x9177;&#x4F3C;native app, &#x5B50;&#x4EA7;&#x54C1;&#x7684;&#x5217;&#x8868;&#x5168;&#x90E8;&#x505A;&#x6210;&#x9AD8;&#x54C1;&#x8D28;&#x7684;icon&#x6837;&#x5F0F;;&#x5176;&#x5B9E; &#x4E0D;&#x8FC7;&#x662F;&#x4E00;&#x4E2A;&#x56FE;&#x6807;&#x52A0;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x3002;</p>
<p><img src="http://images.51cto.com/files/uploadimg/20110803/11242210.png" alt=""></p>
<p><strong>&#x91CD;&#x89C6;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;</strong></p>
<p>HTML5&#x5728;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x4E2D;&#x7684;&#x9700;&#x6C42;&#x6700;&#x65FA;&#x76DB;&#xFF0C;&#x6F5C;&#x529B;&#x4E5F;&#x6700;&#x5927;&#x3002;&#x9002;&#x914D;&#x788E;&#x7247;&#x5316;&#x4E25;&#x91CD;&#x7684;&#x79FB;&#x52A8;&#x7EC8;&#x7AEF;&#x4ECE;&#x957F;&#x8FDC;&#x770B;&#x4E0D;&#x662F;&#x7406;&#x60F3;&#x7684;&#x529E;&#x6CD5;&#xFF0C;&#x4F46;&#x73B0;&#x9636;&#x6BB5;&#x8FD8;&#x6446;&#x8131;&#x4E0D;&#x4E86;&#x8FD9;&#x4E00;&#x73B0;&#x5B9E;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6240;&#x62E5;&#x6709;&#x7684;&#x6700;&#x597D;&#x7684;&#x79FB;&#x52A8;&#x5B9E;&#x9A8C;&#x5E73;&#x53F0;&#x662F;iphone&#xFF0C;&#x5B83;&#x7684;&#x9002;&#x914D;&#x6BD4;&#x4F8B;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x9AD8;&#x4E86;&#x3002;&#x5982;&#x679C;&#x505A;Html5&#x65B0;&#x4EA7;&#x54C1;&#x7684;API&#x652F;&#x6301;&#x6D4B;&#x8BD5;&#xFF0C;&#x5EFA;&#x8BAE;&#x8FD8;&#x662F;&#x4F7F;&#x7528;iPhone.</p>
<p>&#x603B;&#x7ED3;</p>
<p>HTML5&#x6280;&#x672F;&#x6B63;&#x5F15;&#x9886;&#x4E92;&#x8054;&#x7F51;&#x671D;web app&#x65B9;&#x5411;&#x53D1;&#x5C55;&#xFF0C;&#x8FD9;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x53D1;&#x5C55;&#x7684;&#x5FC5;&#x7136;&#x8D8B;&#x52BF;&#x4E4B;&#x4E00;&#x3002;Web app&#x5C06;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x8D70;&#x5230;&#x7528;&#x6237;&#x9762;&#x524D;&#x3002;&#x8BBE;&#x8BA1;&#x5E08;&#x5728;&#x9762;&#x5BF9;HTML5&#x6280;&#x672F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x65E2;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x5F53;&#x524D;&#x8BE5;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x53C8;&#x9700;&#x8981;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x4E0D;&#x65AD;&#x6478;&#x7D22;&#x548C;&#x603B;&#x7ED3;&#x8BBE;&#x8BA1;&#x6280;&#x5DE7;&#x548C;&#x7B56;&#x7565;&#x3002;&#x7D27;&#x8DDF;web app&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4E0D;&#x65AD;&#x5C1D;&#x8BD5;&#xFF0C;&#x5BF9;&#x8BBE;&#x8BA1;&#x5E08;&#x6765;&#x8BF4;&#x65E2;&#x662F;&#x4E00;&#x6B21;&#x5192;&#x9669;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x6B21;&#x96BE;&#x5F97;&#x7684;&#x673A;&#x9047;!</p>
<p>&#x539F;&#x6587;: <a href="http://blog.sina.com.cn/s/blog_462e5c4f0102dtjf.html" target="_blank" rel="external">http://blog.sina.<strong>com</strong>.cn/<strong>s</strong>/blog_462e5c4f0102dtjf.html</a></p>

      
      
      
        <div class="post-copyright">
<p><a href="http://www.ithome.me/archives/当Web设计师遭遇HTML5/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年7月31日 11:07</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav" class="block-select">
  
    <a href="/archives/远程控制软件TeamViewer/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          远程控制软件TeamViewer
        
      </div>
    </a>
  
  
    <a href="/archives/新顶级域名将放开-COM或不敌-GAY/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">新顶级域名将放开 .COM或不敌.GAY</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer" class="block-select">
  <div class="outer">
    <div id="footer-info">
      <div class="footer-left">&copy; 2015-2018
        Simon.Chen
      </div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {fancybox: false,mathjax: false,animate: false,isHome: false,isPost: true,isArchive: false,isTag: false,isCategory: false,open_in_new: true, CDN_PATH: '' }
</script>


    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/base.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>





  </div>
</body>
</html>
