<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>Android GC 那点事</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#00796b">
  <meta name="msapplication-TileColor" content="#4E8071"/>
  
  
  
  
  <link rel="stylesheet" href="/css/style.css" type="text/css"> 
</head>


<body>

  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
  <header id="header" class="inner">
    <a href="/" class="profilepic">
      <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	</a>
	<p class="header-subtitle">分享有助于提升</p>
    <nav class="header-menu">
      <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li>
      </ul>
    </nav>
  </header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  <div class="intrude-less">
    <header id="header" class="inner">
      <a href="/" class="profilepic">
        <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	  </a>
	  <p class="header-subtitle">分享有助于提升</p>
	  <nav class="header-menu">
	    <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li><div class="clearfix"></div>
		</ul>
	  </nav>
	</header>				
  </div>
</nav>

      <div class="body-wrap">
<article id="post-Android-GC-那点事" class="article article-type-post" itemscope itemprop="blogPost">

   
    
    <div class="article-meta">
      
<div class="article-date">
<span class="datetime-published-tag"> 2016-01-19 </span>
</div>


    </div>
    
    
  
  <div class="article-inner block-select">
  
    
    
      <header class="article-header">
        
           
  
    <h1 class="article-title" itemprop="name">
      Android GC 那点事
    </h1>
  

        
      </header>
      
      <div class="article-info article-info-post">
        
	<div class="article-tag tagcloud block-select">
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/GC/">GC</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/android/">android</a></li></ul>
	</div>


        
             <div class="clearfix"></div>
        
      </div>
      
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x60F3;&#x5199;&#x4E00;&#x7BC7;&#x5173;&#x4E8E;Android GC&#x7684;&#x60F3;&#x6CD5;&#x6765;&#x6E90;&#x4E8E;&#x8FFD;&#x67E5;&#x4E00;&#x4E2A;&#x9B45;&#x65CF;&#x624B;&#x673A;&#x56FE;&#x7247;&#x6ED1;&#x52A8;&#x5361;&#x987F;&#x95EE;&#x9898;&#xFF0C;&#x7531;&#x4E8E;&#x4E0D;&#x65AD;&#x7684;GC&#x5BFC;&#x81F4;&#x7684;&#x4E22;&#x5E27;&#x5361;&#x987F;&#x7684;&#x95EE;&#x9898;&#x8BA9;&#x6211;&#x4EEC;&#x60F3;&#x4E86;&#x5F88;&#x591A;&#x65B9;&#x6848;&#x53BB;&#x89E3;&#x51B3;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x6253;&#x7B97;&#x8BE6;&#x7EC6;&#x7684;&#x770B;&#x770B;&#x5185;&#x5B58;&#x5206;&#x914D;&#x548C;GC&#x7684;&#x539F;&#x7406;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x4E0D;&#x65AD;&#x7684;GC, GC ALLOC&#x548C;GC COCURRENT&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x60F3;&#x529E;&#x6CD5;&#x6269;&#x5927;&#x5806;&#x5185;&#x5B58;&#x51CF;&#x5C11;GC&#x7684;&#x9891;&#x6B21;&#x7B49;&#x7B49;&#x3002;</p>
<h3 id="1. JVM&#x5185;&#x5B58;&#x56DE;&#x6536;&#x673A;&#x5236;"><a href="#1-JVM&#x5185;&#x5B58;&#x56DE;&#x6536;&#x673A;&#x5236;" class="headerlink" title="1. JVM&#x5185;&#x5B58;&#x56DE;&#x6536;&#x673A;&#x5236;"></a>1. JVM&#x5185;&#x5B58;&#x56DE;&#x6536;&#x673A;&#x5236;</h3><h4 id="1.1. &#x56DE;&#x6536;&#x7B97;&#x6CD5;"><a href="#1-1-&#x56DE;&#x6536;&#x7B97;&#x6CD5;" class="headerlink" title="1.1. &#x56DE;&#x6536;&#x7B97;&#x6CD5;"></a>1.1. &#x56DE;&#x6536;&#x7B97;&#x6CD5;</h4><h5 id="&#x6807;&#x8BB0;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF08;Mark and Sweep GC&#xFF09;"><a href="#&#x6807;&#x8BB0;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF08;Mark-and-Sweep-GC&#xFF09;" class="headerlink" title="&#x6807;&#x8BB0;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF08;Mark and Sweep GC&#xFF09;"></a>&#x6807;&#x8BB0;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF08;Mark and Sweep GC&#xFF09;</h5><p>&#x4ECE;&#x201D;GC Roots&#x201D;&#x96C6;&#x5408;&#x5F00;&#x59CB;&#xFF0C;&#x5C06;&#x5185;&#x5B58;&#x6574;&#x4E2A;&#x904D;&#x5386;&#x4E00;&#x6B21;&#xFF0C;&#x4FDD;&#x7559;&#x6240;&#x6709;&#x53EF;&#x4EE5;&#x88AB;GC Roots&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x5F15;&#x7528;&#x5230;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x5269;&#x4E0B;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x5F53;&#x4F5C;&#x5783;&#x573E;&#x5BF9;&#x5F85;&#x5E76;&#x56DE;&#x6536;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x9700;&#x8981;&#x4E2D;&#x65AD;&#x8FDB;&#x7A0B;&#x5185;&#x5176;&#x5B83;&#x7EC4;&#x4EF6;&#x7684;&#x6267;&#x884C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x5185;&#x5B58;&#x788E;&#x7247;&#x3002;</p>
<h5 id="&#x590D;&#x5236;&#x7B97;&#x6CD5; (Copying&#xFF09;"><a href="#&#x590D;&#x5236;&#x7B97;&#x6CD5;-Copying&#xFF09;" class="headerlink" title="&#x590D;&#x5236;&#x7B97;&#x6CD5; (Copying&#xFF09;"></a>&#x590D;&#x5236;&#x7B97;&#x6CD5; (Copying&#xFF09;</h5><p>&#x5C06;&#x73B0;&#x6709;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x5206;&#x4E3A;&#x4E24;&#x5FEB;&#xFF0C;&#x6BCF;&#x6B21;&#x53EA;&#x4F7F;&#x7528;&#x5176;&#x4E2D;&#x4E00;&#x5757;&#xFF0C;&#x5728;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65F6;&#x5C06;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x590D;&#x5236;&#x5230;&#x672A;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x5757;&#x4E2D;&#xFF0C;&#x4E4B;&#x540E;&#xFF0C;&#x6E05;&#x9664;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x5757;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#xFF0C;&#x4EA4;&#x6362;&#x4E24;&#x4E2A;&#x5185;&#x5B58;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x5B8C;&#x6210;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;</p>
<h5 id="&#x6807;&#x8BB0;-&#x538B;&#x7F29;&#x7B97;&#x6CD5; (Mark-Compact)"><a href="#&#x6807;&#x8BB0;-&#x538B;&#x7F29;&#x7B97;&#x6CD5;-Mark-Compact" class="headerlink" title="&#x6807;&#x8BB0;-&#x538B;&#x7F29;&#x7B97;&#x6CD5; (Mark-Compact)"></a>&#x6807;&#x8BB0;-&#x538B;&#x7F29;&#x7B97;&#x6CD5; (Mark-Compact)</h5><p>&#x5148;&#x9700;&#x8981;&#x4ECE;&#x6839;&#x8282;&#x70B9;&#x5F00;&#x59CB;&#x5BF9;&#x6240;&#x6709;&#x53EF;&#x8FBE;&#x5BF9;&#x8C61;&#x505A;&#x4E00;&#x6B21;&#x6807;&#x8BB0;&#xFF0C;&#x4F46;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x7B80;&#x5355;&#x5730;&#x6E05;&#x7406;&#x672A;&#x6807;&#x8BB0;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x6240;&#x6709;&#x7684;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x538B;&#x7F29;&#x5230;&#x5185;&#x5B58;&#x7684;&#x4E00;&#x7AEF;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x6E05;&#x7406;&#x8FB9;&#x754C;&#x5916;&#x6240;&#x6709;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x65E2;&#x907F;&#x514D;&#x4E86;&#x788E;&#x7247;&#x7684;&#x4EA7;&#x751F;&#xFF0C;&#x53C8;&#x4E0D;&#x9700;&#x8981;&#x4E24;&#x5757;&#x76F8;&#x540C;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5176;&#x6027;&#x4EF7;&#x6BD4;&#x6BD4;&#x8F83;&#x9AD8;&#x3002;</p>
<h5 id="&#x5206;&#x4EE3;"><a href="#&#x5206;&#x4EE3;" class="headerlink" title="&#x5206;&#x4EE3;"></a>&#x5206;&#x4EE3;</h5><p>&#x5C06;&#x6240;&#x6709;&#x7684;&#x65B0;&#x5EFA;&#x5BF9;&#x8C61;&#x90FD;&#x653E;&#x5165;&#x79F0;&#x4E3A;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x7279;&#x70B9;&#x662F;&#x5BF9;&#x8C61;&#x4F1A;&#x5F88;&#x5FEB;&#x56DE;&#x6536;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5E74;&#x8F7B;&#x4EE3;&#x5C31;&#x9009;&#x62E9;&#x6548;&#x7387;&#x8F83;&#x9AD8;&#x7684;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7ECF;&#x8FC7;&#x51E0;&#x6B21;&#x56DE;&#x6536;&#x540E;&#x4F9D;&#x7136;&#x5B58;&#x6D3B;&#xFF0C;&#x5BF9;&#x8C61;&#x5C31;&#x4F1A;&#x88AB;&#x653E;&#x5165;&#x79F0;&#x4E3A;&#x8001;&#x751F;&#x4EE3;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3002;&#x5BF9;&#x4E8E;&#x65B0;&#x751F;&#x4EE3;&#x9002;&#x7528;&#x4E8E;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x8001;&#x5E74;&#x4EE3;&#x5219;&#x91C7;&#x53D6;&#x6807;&#x8BB0;-&#x538B;&#x7F29;&#x7B97;&#x6CD5;&#x3002;</p>
<h4 id="1.2. &#x590D;&#x5236;&#x548C;&#x6807;&#x8BB0;-&#x538B;&#x7F29;&#x7B97;&#x6CD5;&#x7684;&#x533A;&#x522B;"><a href="#1-2-&#x590D;&#x5236;&#x548C;&#x6807;&#x8BB0;-&#x538B;&#x7F29;&#x7B97;&#x6CD5;&#x7684;&#x533A;&#x522B;" class="headerlink" title="1.2. &#x590D;&#x5236;&#x548C;&#x6807;&#x8BB0;-&#x538B;&#x7F29;&#x7B97;&#x6CD5;&#x7684;&#x533A;&#x522B;"></a>1.2. &#x590D;&#x5236;&#x548C;&#x6807;&#x8BB0;-&#x538B;&#x7F29;&#x7B97;&#x6CD5;&#x7684;&#x533A;&#x522B;</h4><p>&#x4E4D;&#x4E00;&#x770B;&#x8FD9;&#x4E24;&#x4E2A;&#x7B97;&#x6CD5;&#x4F3C;&#x4E4E;&#x5E76;&#x6CA1;&#x6709;&#x591A;&#x5927;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x90FD;&#x662F;&#x6807;&#x8BB0;&#x4E86;&#x7136;&#x540E;&#x632A;&#x5230;&#x53E6;&#x5916;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#xFF0C;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x4EE3;&#x8981;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x5462;&#xFF1F;<br>        &#x5176;&#x5B9E;2&#x8005;&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x524D;&#x8005;&#x662F;&#x7528;&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;&#x540E;&#x8005;&#x5219;&#x662F;&#x7528;&#x65F6;&#x95F4;&#x6362;&#x7A7A;&#x95F4;&#x3002;<br>        &#x524D;&#x8005;&#x7684;&#x5728;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x662F;&#x4E0D;&#x6CA1;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x201C;Mark&#x201D;&#x4E0E;&#x201C;Copy&#x201D;&#x9636;&#x6BB5;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x505A;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;&#xFF0C;&#x5C31;&#x53EB;Scavenge&#xFF08;&#x6216;Evacuate&#xFF0C;&#x6216;&#x8005;&#x5C31;&#x53EB;Copy&#xFF09;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6BCF;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x8FD9;&#x6B21;&#x6536;&#x96C6;&#x4E2D;&#x5C1A;&#x672A;&#x8BBF;&#x95EE;&#x8FC7;&#x7684;&#x6D3B;&#x5BF9;&#x8C61;&#x5C31;&#x76F4;&#x63A5;Copy&#x5230;&#x65B0;&#x5730;&#x65B9;&#xFF0C;&#x540C;&#x65F6;&#x8BBE;&#x7F6E;Forwarding Pointer&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x5C31;&#x9700;&#x8981;&#x591A;&#x4E00;&#x4EFD;&#x7A7A;&#x95F4;&#x3002;<br>        &#x540E;&#x8005;&#x5728;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x5219;&#x9700;&#x8981;&#x5206;&#x522B;&#x7684;Mark&#x4E0E;Compact&#x9636;&#x6BB5;&#xFF0C;Mark&#x9636;&#x6BB5;&#x7528;&#x6765;&#x53D1;&#x73B0;&#x5E76;&#x6807;&#x8BB0;&#x6240;&#x6709;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;compact&#x9636;&#x6BB5;&#x624D;&#x79FB;&#x52A8;&#x5BF9;&#x8C61;&#x6765;&#x8FBE;&#x5230;Compact&#x7684;&#x76EE;&#x7684;&#x3002;&#x5982;&#x679C;Compact&#x65B9;&#x5F0F;&#x662F;Sliding Compaction&#xFF0C;&#x5219;&#x5728;Mark&#x4E4B;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x6309;&#x987A;&#x5E8F;&#x4E00;&#x4E2A;&#x4E2A;&#x5BF9;&#x8C61;&#x201C;&#x6ED1;&#x52A8;&#x201D;&#x5230;&#x7A7A;&#x95F4;&#x7684;&#x67D0;&#x4E00;&#x4FA7;&#x3002;&#x56E0;&#x4E3A;&#x5DF2;&#x7ECF;&#x5148;&#x904D;&#x5386;&#x4E86;&#x6574;&#x4E2A;&#x7A7A;&#x95F4;&#x91CC;&#x7684;&#x5BF9;&#x8C61;&#x56FE;&#xFF0C;&#x77E5;&#x9053;&#x6240;&#x6709;&#x7684;&#x6D3B;&#x5BF9;&#x8C61;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x79FB;&#x52A8;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x7A7A;&#x95F4;&#x5185;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x591A;&#x4E00;&#x4EFD;&#x7A7A;&#x95F4;&#x3002;<br>        &#x6240;&#x4EE5;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x56DE;&#x6536;&#x4F1A;&#x66F4;&#x5FEB;&#x4E00;&#x70B9;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x56DE;&#x6536;&#x5219;&#x4F1A;&#x9700;&#x8981;&#x66F4;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x540C;&#x65F6;&#x538B;&#x7F29;&#x9636;&#x6BB5;&#x662F;&#x4F1A;&#x6682;&#x505C;&#x5E94;&#x7528;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x7ED9;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5BF9;&#x8C61;&#x51FA;&#x73B0;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x3002;</p>
<a id="more"></a>
<h3 id="2. Dalvik&#x865A;&#x62DF;&#x673A;"><a href="#2-Dalvik&#x865A;&#x62DF;&#x673A;" class="headerlink" title="2. Dalvik&#x865A;&#x62DF;&#x673A;"></a>2. Dalvik&#x865A;&#x62DF;&#x673A;</h3><h4 id="2.1. Java&#x5806;"><a href="#2-1-Java&#x5806;" class="headerlink" title="2.1. Java&#x5806;"></a>2.1. Java&#x5806;</h4><p>Java&#x5806;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x7531;&#x4E00;&#x4E2A;Active&#x5806;&#x548C;&#x4E00;&#x4E2A;Zygote&#x5806;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;Zygote&#x5806;&#x7528;&#x6765;&#x7BA1;&#x7406;Zygote&#x8FDB;&#x7A0B;&#x5728;&#x542F;&#x52A8;&#x8FC7;&#x7A0B;&#x4E2D;&#x9884;&#x52A0;&#x8F7D;&#x548C;&#x521B;&#x5EFA;&#x7684;&#x5404;&#x79CD;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;Active&#x5806;&#x662F;&#x5728;Zygote&#x8FDB;&#x7A0B;Fork&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x8FDB;&#x7A0B;&#x4E4B;&#x524D;&#x521B;&#x5EFA;&#x7684;&#x3002;&#x4EE5;&#x540E;&#x542F;&#x52A8;&#x7684;&#x6240;&#x6709;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x7A0B;&#x662F;&#x88AB;Zygote&#x8FDB;&#x7A0B;Fork&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x5E76;&#x90FD;&#x6301;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;Dalvik&#x865A;&#x62DF;&#x673A;&#x3002;&#x5728;&#x521B;&#x5EFA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;Dalvik&#x865A;&#x62DF;&#x673A;&#x91C7;&#x7528;Cow&#x7B56;&#x7565;&#x590D;&#x5236;Zygote&#x8FDB;&#x7A0B;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x3002;<br><strong>Cow&#x7B56;&#x7565;</strong>&#xFF1A;&#x4E00;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#xFF08;&#x672A;&#x590D;&#x5236;Zygote&#x8FDB;&#x7A0B;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x7684;&#x65F6;&#x5019;&#xFF09;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x7A0B;&#x548C;Zygote&#x8FDB;&#x7A0B;&#x5171;&#x4EAB;&#x4E86;&#x540C;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x7684;&#x5806;&#x3002;&#x5F53;Zygote&#x8FDB;&#x7A0B;&#x6216;&#x8005;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x7A0B;&#x5BF9;&#x8BE5;&#x5806;&#x8FDB;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x5185;&#x6838;&#x5C31;&#x4F1A;&#x6267;<br>&#x884C;&#x771F;&#x6B63;&#x7684;&#x62F7;&#x8D1D;&#x64CD;&#x4F5C;&#xFF0C;&#x4F7F;&#x5F97;Zygote&#x8FDB;&#x7A0B;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x7A0B;&#x5206;&#x522B;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4EFD;&#x62F7;&#x8D1D;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;Cow&#x3002;&#x56E0;&#x4E3A;Copy&#x662F;&#x5341;&#x5206;&#x8017;&#x65F6;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5FC5;&#x987B;&#x5C3D;&#x91CF;&#x907F;&#x514D;Copy&#x6216;&#x8005;&#x5C3D;&#x91CF;&#x5C11;&#x7684;Copy&#x3002;<br>        &#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#xFF0C;&#x5F53;&#x521B;&#x5EFA;&#x7B2C;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x7A0B;&#x65F6;&#xFF0C;&#x4F1A;&#x5C06;&#x5DF2;&#x7ECF;&#x4F7F;&#x7528;&#x4E86;&#x7684;&#x90A3;&#x90E8;&#x5206;&#x5806;&#x5185;&#x5B58;&#x5212;&#x5206;&#x4E3A;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x7684;&#x5806;&#x5185;&#x5B58;&#x5212;&#x5206;&#x4E3A;&#x53E6;&#x5916;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x524D;&#x8005;&#x5C31;&#x79F0;&#x4E3A;Zygote&#x5806;&#xFF0C;&#x540E;&#x8005;&#x5C31;&#x79F0;&#x4E3A;Active&#x5806;&#x3002;&#x8FD9;&#x6837;&#x53EA;&#x9700;&#x628A;zygote&#x5806;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x590D;&#x5236;&#x7ED9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x7A0B;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x4EE5;&#x540E;&#x65E0;&#x8BBA;&#x662F;Zygote&#x8FDB;&#x7A0B;&#xFF0C;&#x8FD8;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x7A0B;&#xFF0C;&#x5F53;&#x5B83;&#x4EEC;&#x9700;&#x8981;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x5728;Active&#x5806;&#x4E0A;&#x8FDB;&#x884C;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;Zygote&#x5806;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x5730;&#x88AB;&#x6267;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x800C;&#x5C31;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x6267;&#x884C;&#x5199;&#x65F6;&#x62F7;&#x8D1D;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5728;Zygote&#x5806;&#x91CC;&#x9762;&#x5206;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x5176;&#x5B9E;&#x4E3B;&#x8981;&#x5C31;&#x662F;Zygote&#x8FDB;&#x7A0B;&#x5728;&#x542F;&#x52A8;&#x8FC7;&#x7A0B;&#x4E2D;&#x9884;&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#x3001;&#x8D44;&#x6E90;&#x548C;&#x5BF9;&#x8C61;&#x4E86;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x4E9B;&#x9884;&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#x3001;&#x8D44;&#x6E90;&#x548C;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x5728;Zygote&#x8FDB;&#x7A0B;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x7A0B;&#x4E2D;&#x505A;&#x5230;&#x957F;&#x671F;&#x5171;&#x4EAB;&#x3002;&#x8FD9;&#x6837;&#x65E2;&#x80FD;&#x51CF;&#x5C11;&#x62F7;&#x8D1D;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD8;&#x80FD;&#x51CF;&#x5C11;&#x5BF9;&#x5185;&#x5B58;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<h4 id="2.2. &#x548C;GC&#x6709;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x6307;&#x6807;"><a href="#2-2-&#x548C;GC&#x6709;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x6307;&#x6807;" class="headerlink" title="2.2. &#x548C;GC&#x6709;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x6307;&#x6807;"></a>2.2. &#x548C;GC&#x6709;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x6307;&#x6807;</h4><p>&#x8BB0;&#x5F97;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5728;&#x4F18;&#x5316;&#x9B45;&#x65CF;&#x67D0;&#x624B;&#x673A;&#x7684;gc&#x5361;&#x987F;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x53D1;&#x73B0;&#x4ED6;&#x5F88;&#x5BB9;&#x6613;&#x89E6;&#x53D1;GC_FOR_MALLOC&#xFF0C;&#x8FD9;&#x4E2A;GC&#x7C7B;&#x522B;&#x540E;&#x7EED;&#x4F1A;&#x8BF4;&#x5230;&#xFF0C;&#x662F;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x65F6;&#x5BFC;&#x81F4;&#x7684;&#x3002;&#x53EF;&#x662F;&#x6211;&#x4EEC;&#x53C8;&#x8BBE;&#x7F6E;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x5806;Size&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x4F1A;&#x5185;&#x5B58;&#x4E0D;&#x591F;&#x5462;&#xFF0C;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x6982;&#x5FF5;&#xFF1A;&#x5206;&#x522B;&#x662F;Java&#x5806;&#x7684;&#x8D77;&#x59CB;&#x5927;&#x5C0F;&#xFF08;Starting Size&#xFF09;&#x3001;&#x6700;&#x5927;&#x503C;&#xFF08;Maximum Size&#xFF09;&#x548C;&#x589E;&#x957F;&#x4E0A;&#x9650;&#x503C;&#xFF08;Growth Limit&#xFF09;&#x3002;<br>        &#x5728;&#x542F;&#x52A8;Dalvik&#x865A;&#x62DF;&#x673A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5206;&#x522B;&#x901A;&#x8FC7;-Xms&#x3001;-Xmx&#x548C;-XX:HeapGrowthLimit&#x4E09;&#x4E2A;&#x9009;&#x9879;&#x6765;&#x6307;&#x5B9A;&#x4E0A;&#x8FF0;&#x4E09;&#x4E2A;&#x503C;&#xFF0C;&#x4EE5;&#x4E0A;&#x4E09;&#x4E2A;&#x503C;&#x5206;&#x522B;&#x8868;&#x793A;&#x8868;&#x793A;&#xFF1A;<br>         <code>Starting Size</code>: Dalvik&#x865A;&#x62DF;&#x673A;&#x542F;&#x52A8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x5148;&#x5206;&#x914D;&#x4E00;&#x5757;&#x521D;&#x59CB;&#x7684;&#x5806;&#x5185;&#x5B58;&#x7ED9;&#x865A;&#x62DF;&#x673A;&#x4F7F;&#x7528;&#x3002;<br>        <code>Growth Limit</code>: &#x662F;&#x7CFB;&#x7EDF;&#x7ED9;&#x6BCF;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x6700;&#x5927;&#x5806;&#x4E0A;&#x9650;,&#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;&#x4E0A;&#x9650;&#xFF0C;&#x7A0B;&#x5E8F;&#x5C31;&#x4F1A;OOM&#x3002;<br>        <code>Maximum Size</code>: &#x4E0D;&#x53D7;&#x63A7;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6700;&#x5927;&#x5806;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#xFF0C;&#x8D77;&#x59CB;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x7528;largeheap&#x5C5E;&#x6027;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x7CFB;&#x7EDF;&#x83B7;&#x53D6;&#x7684;&#x6700;&#x5927;&#x5806;&#x5927;&#x5C0F;&#x3002;<br>        &#x540C;&#x65F6;&#x9664;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x8FD9;&#x4E2A;&#x4E09;&#x4E2A;&#x6307;&#x6807;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x51E0;&#x4E2A;&#x6307;&#x6807;&#x4E5F;&#x662F;&#x503C;&#x5F97;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5806;&#x6700;&#x5C0F;&#x7A7A;&#x95F2;&#x503C;&#xFF08;Min Free&#xFF09;&#x3001;&#x5806;&#x6700;&#x5927;&#x7A7A;&#x95F2;&#x503C;&#xFF08;Max Free&#xFF09;&#x548C;&#x5806;&#x76EE;&#x6807;&#x5229;&#x7528;&#x7387;&#xFF08;Target Utilization&#xFF09;&#x3002;&#x5047;&#x8BBE;&#x5728;&#x67D0;&#x4E00;&#x6B21;GC&#x4E4B;&#x540E;&#xFF0C;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x5360;&#x7528;&#x5185;&#x5B58;&#x7684;&#x5927;&#x5C0F;&#x4E3A;LiveSize&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x65F6;&#x5019;&#x5806;&#x7684;&#x7406;&#x60F3;&#x5927;&#x5C0F;&#x5E94;&#x8BE5;&#x4E3A;(LiveSize / U)&#x3002;&#x4F46;&#x662F;(LiveSize / U)&#x5FC5;&#x987B;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;(LiveSize + MinFree)&#x5E76;&#x4E14;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;(LiveSize + MaxFree)&#xFF0C;&#x6BCF;&#x6B21;GC&#x540E;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x90FD;&#x4F1A;&#x5C3D;&#x91CF;&#x8BA9;&#x5806;&#x7684;&#x5229;&#x7528;&#x7387;&#x5F80;&#x76EE;&#x6807;&#x5229;&#x7528;&#x7387;&#x9760;&#x62E2;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x624B;&#x52A8;&#x53BB;&#x751F;&#x6210;&#x4E00;&#x4E9B;&#x51E0;&#x767E;K&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8BD5;&#x56FE;&#x53BB;&#x6269;&#x5927;&#x53EF;&#x7528;&#x5806;&#x5927;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53CD;&#x800C;&#x4F1A;&#x5BFC;&#x81F4;&#x9891;&#x7E41;&#x7684;GC&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x7684;&#x5206;&#x914D;&#x4F1A;&#x5BFC;&#x81F4;GC&#xFF0C;&#x800C;GC&#x540E;&#x4F1A;&#x8BA9;&#x5806;&#x5185;&#x5B58;&#x56DE;&#x5230;&#x5408;&#x9002;&#x7684;&#x6BD4;&#x4F8B;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5F88;&#x5FEB;&#x4F1A;&#x88AB;&#x56DE;&#x6536;&#x7406;&#x8BBA;&#x4E0A;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x8FD8;&#x662F;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5806;&#x5927;&#x5C0F;&#x4E5F;&#x4F1A;&#x7F29;&#x51CF;&#x56DE;&#x6765;&#x65E0;&#x6CD5;&#x8FBE;&#x5230;&#x6269;&#x5145;&#x7684;&#x76EE;&#x7684;&#x3002; &#x4E0E;&#x6B64;&#x540C;&#x65F6;&#x8FD9;&#x4E5F;&#x662F;&#x4EA7;&#x751F;CONCURRENT GC&#x7684;&#x4E00;&#x4E2A;&#x56E0;&#x7D20;&#xFF0C;&#x540E;&#x6587;&#x6211;&#x4EEC;&#x4F1A;&#x8BE6;&#x7EC6;&#x8BB2;&#x5230;&#x3002;</p>
<h4 id="2.3. GC&#x7684;&#x7C7B;&#x578B;"><a href="#2-3-GC&#x7684;&#x7C7B;&#x578B;" class="headerlink" title="2.3. GC&#x7684;&#x7C7B;&#x578B;"></a>2.3. GC&#x7684;&#x7C7B;&#x578B;</h4><p><code>GC_FOR_MALLOC</code>: &#x8868;&#x793A;&#x662F;&#x5728;&#x5806;&#x4E0A;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x65F6;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x89E6;&#x53D1;&#x7684;GC&#x3002;<br><code>GC_CONCURRENT</code>: &#x5F53;&#x6211;&#x4EEC;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5806;&#x5185;&#x5B58;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x91CF;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x5FEB;&#x8981;&#x6EE1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x81EA;&#x52A8;&#x89E6;&#x53D1;GC&#x64CD;&#x4F5C;&#x6765;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x3002;<br><code>GC_EXPLICIT</code>: &#x8868;&#x793A;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8C03;&#x7528;System.gc&#x3001;VMRuntime.gc&#x63A5;&#x53E3;&#x6216;&#x8005;&#x6536;&#x5230;SIGUSR1&#x4FE1;&#x53F7;&#x65F6;&#x89E6;&#x53D1;&#x7684;GC&#x3002;<br><code>GC_BEFORE_OOM</code>: &#x8868;&#x793A;&#x662F;&#x5728;&#x51C6;&#x5907;&#x629B;OOM&#x5F02;&#x5E38;&#x4E4B;&#x524D;&#x8FDB;&#x884C;&#x7684;&#x6700;&#x540E;&#x52AA;&#x529B;&#x800C;&#x89E6;&#x53D1;&#x7684;GC&#x3002;<br>        &#x5B9E;&#x9645;&#x4E0A;&#xFF0C;GC_FOR_MALLOC&#x3001;GC_CONCURRENT&#x548C;GC_BEFORE_OOM&#x4E09;&#x79CD;&#x7C7B;&#x578B;&#x7684;GC&#x90FD;&#x662F;&#x5728;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x7684;&#x8FC7;&#x7A0B;&#x89E6;&#x53D1;&#x7684;&#x3002;&#x800C;&#x5E76;&#x53D1;&#x548C;&#x975E;&#x5E76;&#x53D1;GC&#x7684;&#x533A;&#x522B;&#x4E3B;&#x8981;&#x5728;&#x4E8E;&#x524D;&#x8005;&#x5728;GC&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6709;&#x6761;&#x4EF6;&#x5730;&#x6302;&#x8D77;&#x548C;&#x5524;&#x9192;&#x975E;GC&#x7EBF;&#x7A0B;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x5728;&#x6267;&#x884C;GC&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x6302;&#x8D77;&#x975E;GC&#x7EBF;&#x7A0B;&#x7684;&#x3002;&#x5E76;&#x884C;GC&#x901A;&#x8FC7;&#x6709;&#x6761;&#x4EF6;&#x5730;&#x6302;&#x8D77;&#x548C;&#x5524;&#x9192;&#x975E;GC&#x7EBF;&#x7A0B;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x54CD;&#x5E94;&#x6027;&#x3002;&#x4F46;&#x662F;&#x540C;&#x65F6;&#x5E76;&#x884C;GC&#x9700;&#x8981;&#x591A;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x6807;&#x8BB0;&#x6839;&#x96C6;&#x5BF9;&#x8C61;&#x4EE5;&#x53CA;&#x9012;&#x5F52;&#x6807;&#x8BB0;&#x90A3;&#x4E9B;&#x5728;GC&#x8FC7;&#x7A0B;&#x88AB;&#x8BBF;&#x95EE;&#x4E86;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x7684;CPU&#x8D44;&#x6E90;&#x3002;&#x540E;&#x6587;&#x5728;ART&#x7684;&#x5E76;&#x53D1;&#x548C;&#x975E;&#x5E76;&#x53D1;GC&#x4E2D;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x7740;&#x91CD;&#x8BF4;&#x660E;&#x4E0B;&#x8FD9;&#x4E24;&#x8005;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<h4 id="2.4. &#x5BF9;&#x8C61;&#x7684;&#x5206;&#x914D;&#x548C;GC&#x89E6;&#x53D1;&#x65F6;&#x673A;"><a href="#2-4-&#x5BF9;&#x8C61;&#x7684;&#x5206;&#x914D;&#x548C;GC&#x89E6;&#x53D1;&#x65F6;&#x673A;" class="headerlink" title="2.4. &#x5BF9;&#x8C61;&#x7684;&#x5206;&#x914D;&#x548C;GC&#x89E6;&#x53D1;&#x65F6;&#x673A;"></a>2.4. &#x5BF9;&#x8C61;&#x7684;&#x5206;&#x914D;&#x548C;GC&#x89E6;&#x53D1;&#x65F6;&#x673A;</h4><ol>
<li>&#x8C03;&#x7528;&#x51FD;&#x6570;dvmHeapSourceAlloc&#x5728;Java&#x5806;&#x4E0A;&#x5206;&#x914D;&#x6307;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x3002;&#x5982;&#x679C;&#x5206;&#x914D;&#x6210;&#x529F;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5C06;&#x5206;&#x914D;&#x5F97;&#x5230;&#x7684;&#x5730;&#x5740;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x7ED9;&#x8C03;&#x7528;&#x8005;&#x4E86;&#x3002;&#x51FD;&#x6570;dvmHeapSourceAlloc&#x5728;&#x4E0D;&#x6539;&#x53D8;Java&#x5806;&#x5F53;&#x524D;&#x5927;&#x5C0F;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x8FDB;&#x884C;&#x5185;&#x5B58;&#x5206;&#x914D;&#xFF0C;&#x8FD9;&#x662F;&#x5C5E;&#x4E8E;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#x52A8;&#x4F5C;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E0A;&#x4E00;&#x6B65;&#x5185;&#x5B58;&#x5206;&#x914D;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x9700;&#x8981;&#x6267;&#x884C;&#x4E00;&#x6B21;GC&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#x5982;&#x679C;GC&#x7EBF;&#x7A0B;&#x5DF2;&#x7ECF;&#x5728;&#x8FD0;&#x884C;&#x4E2D;&#xFF0C;&#x5373;gDvm.gcHeap-&gt;gcRunning&#x7684;&#x503C;&#x7B49;&#x4E8E;true&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x51FD;&#x6570;dvmWaitForConcurrentGcToComplete&#x7B49;&#x5230;GC&#x6267;&#x884C;&#x5B8C;&#x6210;&#x5C31;&#x662F;&#x4E86;&#x3002;&#x5426;&#x5219;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x8C03;&#x7528;&#x51FD;&#x6570;gcForMalloc&#x6765;&#x6267;&#x884C;&#x4E00;&#x6B21;GC&#x4E86;&#xFF0C;&#x53C2;&#x6570;false&#x8868;&#x793A;&#x4E0D;&#x8981;&#x56DE;&#x6536;&#x8F6F;&#x5F15;&#x7528;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x3002;</li>
<li>GC&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x518D;&#x6B21;&#x8C03;&#x7528;&#x51FD;&#x6570;dvmHeapSourceAlloc&#x5C1D;&#x8BD5;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#x64CD;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x5206;&#x914D;&#x6210;&#x529F;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5C06;&#x5206;&#x914D;&#x5F97;&#x5230;&#x7684;&#x5730;&#x5740;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x7ED9;&#x8C03;&#x7528;&#x8005;&#x4E86;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E0A;&#x4E00;&#x6B65;&#x5185;&#x5B58;&#x5206;&#x914D;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x5F97;&#x8003;&#x8651;&#x5148;&#x5C06;Java&#x5806;&#x7684;&#x5F53;&#x524D;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A;Dalvik&#x865A;&#x62DF;&#x673A;&#x542F;&#x52A8;&#x65F6;&#x6307;&#x5B9A;&#x7684;Java&#x5806;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x518D;&#x8FDB;&#x884C;&#x5185;&#x5B58;&#x5206;&#x914D;&#x4E86;&#x3002;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x51FD;&#x6570;dvmHeapSourceAllocAndGrow&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8C03;&#x7528;&#x51FD;&#x6570;dvmHeapSourceAllocAndGrow&#x5206;&#x914D;&#x5185;&#x5B58;&#x6210;&#x529F;&#xFF0C;&#x5219;&#x76F4;&#x63A5;&#x5C06;&#x5206;&#x914D;&#x5F97;&#x5230;&#x7684;&#x5730;&#x5740;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x7ED9;&#x8C03;&#x7528;&#x8005;&#x4E86;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E0A;&#x4E00;&#x6B65;&#x5185;&#x5B58;&#x5206;&#x914D;&#x8FD8;&#x662F;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x5F97;&#x51FA;&#x72E0;&#x62DB;&#x4E86;&#x3002;&#x518D;&#x6B21;&#x8C03;&#x7528;&#x51FD;&#x6570;gcForMalloc&#x6765;&#x6267;&#x884C;GC&#x3002;&#x53C2;&#x6570;true&#x8868;&#x793A;&#x8981;&#x56DE;&#x6536;&#x8F6F;&#x5F15;&#x7528;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x3002;</li>
<li>GC&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x518D;&#x6B21;&#x8C03;&#x7528;&#x51FD;&#x6570;dvmHeapSourceAllocAndGrow&#x8FDB;&#x884C;&#x5185;&#x5B58;&#x5206;&#x914D;&#x3002;&#x8FD9;&#x662F;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x52AA;&#x529B;&#x4E86;&#xFF0C;&#x6210;&#x529F;&#x4E0E;&#x4E8B;&#x90FD;&#x5230;&#x6B64;&#x4E3A;&#x6B62;&#x3002;</li>
</ol>
<p>&#x793A;&#x4F8B;&#x56FE;&#x5982;&#x4E0B;&#xFF1A;<br><img src="http://ww1.sinaimg.cn/large/62b0904dgw1f04vr41xkaj210g11smzg.jpg" alt=""></p>
<p>&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5728;&#x5BF9;&#x8C61;&#x7684;&#x5206;&#x914D;&#x4E2D;&#x4F1A;&#x5BFC;&#x81F4;GC&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x5931;&#x8D25;&#x6211;&#x4EEC;&#x4F1A;&#x89E6;&#x53D1;GC&#x4F46;&#x662F;&#x4E0D;&#x56DE;&#x6536;Soft&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x518D;&#x6B21;&#x5206;&#x914D;&#x8FD8;&#x662F;&#x5931;&#x8D25;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x5C06;Soft&#x7684;&#x5185;&#x5B58;&#x4E5F;&#x7ED9;&#x56DE;&#x6536;&#xFF0C;&#x524D;&#x8005;&#x89E6;&#x53D1;&#x7684;GC&#x662F;GC_FOR_MALLOC&#x7C7B;&#x578B;&#x7684;GC&#xFF0C;&#x540E;&#x8005;&#x662F;GC_BEFORE_OOM&#x7C7B;&#x578B;&#x7684;GC&#x3002;&#x800C;&#x5F53;&#x5185;&#x5B58;&#x5206;&#x914D;&#x6210;&#x529F;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5224;&#x65AD;&#x5F53;&#x524D;&#x7684;&#x5185;&#x5B58;&#x5360;&#x7528;&#x662F;&#x5426;&#x662F;&#x8FBE;&#x5230;&#x4E86;GC_CONCURRENT&#x7684;&#x9600;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x8FBE;&#x5230;&#x4E86;&#x90A3;&#x4E48;&#x53C8;&#x4F1A;&#x89E6;&#x53D1;GC_CONCURRENT&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x9600;&#x503C;&#x53C8;&#x662F;&#x5982;&#x4F55;&#x6765;&#x7684;&#x5462;&#xFF0C;&#x4E0A;&#x9762;&#x6211;&#x4EEC;&#x8BF4;&#x5230;&#x7684;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x5229;&#x7528;&#x7387;&#xFF0C;GC&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x8BB0;&#x5F55;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x503C;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x7406;&#x8BBA;&#x4E0A;&#x9700;&#x8981;&#x518D;&#x4E0A;&#x8FF0;&#x7684;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x5728;&#x6211;&#x4EEC;&#x4F1A;&#x9009;&#x53D6;&#x8FB9;&#x754C;&#x503C;&#x505A;&#x4E3A;&#x76EE;&#x6807;&#x503C;&#x3002;&#x865A;&#x62DF;&#x673A;&#x4F1A;&#x8BB0;&#x5F55;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x503C;&#xFF0C;&#x5F53;&#x505A;&#x5F53;&#x524D;&#x5141;&#x8BB8;&#x603B;&#x7684;&#x53EF;&#x4EE5;&#x5206;&#x914D;&#x5230;&#x7684;&#x5185;&#x5B58;&#x3002;&#x540C;&#x65F6;&#x6839;&#x636E;&#x76EE;&#x6807;&#x503C;&#x51CF;&#x53BB;&#x56FA;&#x5B9A;&#x503C;&#xFF08;200~500K), &#x5F53;&#x505A;&#x89E6;&#x53D1;GC_CONCURRENT&#x4E8B;&#x4EF6;&#x7684;&#x9608;&#x503C;&#x3002;</p>
<h4 id="2.5. &#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x548C;&#x5185;&#x5B58;&#x788E;&#x7247;"><a href="#2-5-&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x548C;&#x5185;&#x5B58;&#x788E;&#x7247;" class="headerlink" title="2.5. &#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x548C;&#x5185;&#x5B58;&#x788E;&#x7247;"></a>2.5. &#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x548C;&#x5185;&#x5B58;&#x788E;&#x7247;</h4><p>&#x4E3B;&#x6D41;&#x7684;&#x5927;&#x90E8;&#x5206;Davik&#x91C7;&#x53D6;&#x7684;&#x90FD;&#x662F;&#x6807;&#x6CE8;&#x4E0E;&#x6E05;&#x7406;&#xFF08;Mark and Sweep&#xFF09;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF0C;&#x4E5F;&#x6709;&#x5B9E;&#x73B0;&#x4E86;&#x62F7;&#x8D1D;GC&#x7684;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x548C;HotSpot&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x7B97;&#x6CD5;&#x662F;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x65E0;&#x6CD5;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x52A8;&#x6001;&#x66F4;&#x6362;&#x3002;&#x5982;&#x679C;&#x5728;&#x7F16;&#x8BD1;dalvik&#x865A;&#x62DF;&#x673A;&#x7684;&#x547D;&#x4EE4;&#x4E2D;&#x6307;&#x660E;&#x4E86;&#x201D;WITH_COPYING_GC&#x201D;&#x9009;&#x9879;&#xFF0C;&#x5219;&#x7F16;&#x8BD1;&#x201D;/dalvik/vm/alloc/Copying.cpp&#x201D;&#x6E90;&#x7801; &#x2013; &#x6B64;&#x662F;Android&#x4E2D;&#x62F7;&#x8D1D;GC&#x7B97;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5426;&#x5219;&#x7F16;&#x8BD1;&#x201D;/dalvik/vm/alloc/HeapSource.cpp&#x201D; &#x2013; &#x5176;&#x5B9E;&#x73B0;&#x4E86;&#x6807;&#x6CE8;&#x4E0E;&#x6E05;&#x7406;GC&#x7B97;&#x6CD5;&#x3002;<br>        &#x7531;&#x4E8E;Mark and Sweep&#x7B97;&#x6CD5;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x4E0B;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x6709;&#x5927;&#x91CF;&#x4E0D;&#x8FDE;&#x7EED;&#x5C0F;&#x5185;&#x5B58;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x518D;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x8F83;&#x5927;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x8FD8;&#x662F;&#x4F1A;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;GC&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x8BE5;&#x624B;&#x673A;&#x4E0A;decode&#x56FE;&#x7247;&#xFF0C;&#x5177;&#x4F53;&#x60C5;&#x51B5;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="http://ww4.sinaimg.cn/large/62b0904dgw1f04vt0713pj210o0ecabi.jpg" alt=""></p>
<p>&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;Dalvik&#x865A;&#x62DF;&#x673A;&#x7684;&#x624B;&#x673A;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8981;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x6389;&#x9891;&#x7E41;&#x751F;&#x6210;&#x5F88;&#x591A;&#x4E34;&#x65F6;&#x5C0F;&#x53D8;&#x91CF;&#xFF08;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;getView, onDraw&#x7B49;&#x51FD;&#x6570;&#x4E2D;new&#x5BF9;&#x8C61;&#xFF09;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x53C8;&#x8981;&#x5C3D;&#x91CF;&#x53BB;&#x907F;&#x514D;&#x4EA7;&#x751F;&#x5F88;&#x591A;&#x957F;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x5927;&#x5BF9;&#x8C61;&#x3002;</p>
<h3 id="3. ART&#x5185;&#x5B58;&#x56DE;&#x6536;&#x673A;&#x5236;"><a href="#3-ART&#x5185;&#x5B58;&#x56DE;&#x6536;&#x673A;&#x5236;" class="headerlink" title="3. ART&#x5185;&#x5B58;&#x56DE;&#x6536;&#x673A;&#x5236;"></a>3. ART&#x5185;&#x5B58;&#x56DE;&#x6536;&#x673A;&#x5236;</h3><h4 id="3.1. Java&#x5806;"><a href="#3-1-Java&#x5806;" class="headerlink" title="3.1. Java&#x5806;"></a>3.1. Java&#x5806;</h4><p>ART&#x8FD0;&#x884C;&#x65F6;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x7684;Java&#x5806;&#x7684;&#x4E3B;&#x8981;&#x7EC4;&#x6210;&#x5305;&#x62EC;Image Space&#x3001;Zygote Space&#x3001;Allocation Space&#x548C;Large Object Space&#x56DB;&#x4E2A;Space&#xFF0C;Image Space&#x7528;&#x6765;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x9884;&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#xFF0C; Zygote Space&#x548C;Allocation Space&#x4E0E;Dalvik&#x865A;&#x62DF;&#x673A;&#x5783;&#x573E;&#x6536;&#x96C6;&#x673A;&#x5236;&#x4E2D;&#x7684;Zygote&#x5806;&#x548C;Active&#x5806;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;</p>
<p>Large Object Space&#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x79BB;&#x6563;&#x5730;&#x5740;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x7528;&#x6765;&#x5206;&#x914D;&#x4E00;&#x4E9B;&#x5927;&#x5BF9;&#x8C61;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x4E86;GC&#x7684;&#x7BA1;&#x7406;&#x6548;&#x7387;&#x548C;&#x6574;&#x4F53;&#x6027;&#x80FD;&#xFF0C;&#x7C7B;&#x4F3C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="http://ww2.sinaimg.cn/large/62b0904dgw1f04vuvd25jj210o0f8myh.jpg" alt=""></p>
<p>&#x5728;&#x4E0B;&#x6587;&#x7684;GC Log&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x80FD;&#x770B;&#x5230;&#x5728;ART&#x7684;GC Log&#x4E2D;&#x5305;&#x542B;&#x4E86;LOS&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x65B9;&#x4FBF;&#x6211;&#x4EEC;&#x67E5;&#x770B;&#x5927;&#x5185;&#x5B58;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<h4 id="3.2. GC&#x7684;&#x7C7B;&#x578B;"><a href="#3-2-GC&#x7684;&#x7C7B;&#x578B;" class="headerlink" title="3.2. GC&#x7684;&#x7C7B;&#x578B;"></a>3.2. GC&#x7684;&#x7C7B;&#x578B;</h4><ul>
<li>kGcCauseForAlloc: &#x5F53;&#x8981;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x73B0;&#x5185;&#x5B58;&#x4E0D;&#x591F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5F15;&#x8D77;&#x7684;GC&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7684;GC&#x4F1A;Stop World.</li>
<li>kGcCauseBackground: &#x5F53;&#x5185;&#x5B58;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x9600;&#x503C;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x53BB;&#x51FA;&#x53D1;GC&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x662F;&#x4E00;&#x4E2A;&#x540E;&#x53F0;GC&#xFF0C;&#x4E0D;&#x4F1A;&#x5F15;&#x8D77;Stop World.</li>
<li>kGcCauseExplicit&#xFF0C;&#x663E;&#x793A;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;&#x7684;gc&#xFF0C;&#x5982;&#x679C;ART&#x6253;&#x5F00;&#x4E86;&#x8FD9;&#x4E2A;&#x9009;&#x9879;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;system.gc&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x8FDB;&#x884C;GC.<br>&#x5176;&#x4ED6;&#x66F4;&#x591A;&#x3002;</li>
</ul>
<h4 id="3.3. &#x5BF9;&#x8C61;&#x7684;&#x5206;&#x914D;&#x548C;GC&#x89E6;&#x53D1;&#x65F6;&#x673A;"><a href="#3-3-&#x5BF9;&#x8C61;&#x7684;&#x5206;&#x914D;&#x548C;GC&#x89E6;&#x53D1;&#x65F6;&#x673A;" class="headerlink" title="3.3. &#x5BF9;&#x8C61;&#x7684;&#x5206;&#x914D;&#x548C;GC&#x89E6;&#x53D1;&#x65F6;&#x673A;"></a>3.3. &#x5BF9;&#x8C61;&#x7684;&#x5206;&#x914D;&#x548C;GC&#x89E6;&#x53D1;&#x65F6;&#x673A;</h4><p>&#x7531;&#x4E8E;ART&#x4E0B;&#x5185;&#x5B58;&#x5206;&#x914D;&#x548C;Dalvik&#x4E0B;&#x57FA;&#x672C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x533A;&#x522B;&#xFF0C;&#x6211;&#x76F4;&#x63A5;&#x8D34;&#x56FE;&#x5E26;&#x8FC7;&#x4E86;&#x3002;</p>
<p><img src="http://ww2.sinaimg.cn/large/62b0904dgw1f04vwhzl7tj210m11gtb2.jpg" alt=""></p>
<h4 id="3.4. &#x5E76;&#x53D1;&#x548C;&#x975E;&#x5E76;&#x53D1;GC"><a href="#3-4-&#x5E76;&#x53D1;&#x548C;&#x975E;&#x5E76;&#x53D1;GC" class="headerlink" title="3.4. &#x5E76;&#x53D1;&#x548C;&#x975E;&#x5E76;&#x53D1;GC"></a>3.4. &#x5E76;&#x53D1;&#x548C;&#x975E;&#x5E76;&#x53D1;GC</h4><p>ART&#x5728;GC&#x4E0A;&#x4E0D;&#x50CF;Dalvik&#x4EC5;&#x6709;&#x4E00;&#x79CD;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF0C;ART&#x5728;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;Alloc&#x5185;&#x5B58;&#x4E0D;&#x591F;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x91C7;&#x7528;&#x975E;&#x5E76;&#x53D1;GC&#xFF0C;&#x800C;&#x5728;Alloc&#x540E;&#x53D1;&#x73B0;&#x5185;&#x5B58;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x9600;&#x503C;&#x7684;&#x65F6;&#x5019;&#x53C8;&#x4F1A;&#x89E6;&#x53D1;&#x5E76;&#x53D1;GC&#x3002;&#x540C;&#x65F6;&#x5728;&#x524D;&#x540E;&#x53F0;&#x7684;&#x60C5;&#x51B5;&#x4E0B;GC&#x7B56;&#x7565;&#x4E5F;&#x4E0D;&#x5C3D;&#x76F8;&#x540C;&#xFF0C;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x4F1A;&#x4E00;&#x4E00;&#x7ED9;&#x5927;&#x5BB6;&#x8BF4;&#x660E;&#x3002;</p>
<ul>
<li>&#x975E;&#x5E76;&#x53D1;GC</li>
</ul>
<p>&#x6B65;&#x9AA4;1. &#x8C03;&#x7528;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;InitializePhase&#x6267;&#x884C;GC&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#x3002;<br>          &#x6B65;&#x9AA4;2. &#x6302;&#x8D77;&#x6240;&#x6709;&#x7684;ART&#x8FD0;&#x884C;&#x65F6;&#x7EBF;&#x7A0B;&#x3002;<br>          &#x6B65;&#x9AA4;3. &#x8C03;&#x7528;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;MarkingPhase&#x6267;&#x884C;GC&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x3002;<br>          &#x6B65;&#x9AA4;4. &#x8C03;&#x7528;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;ReclaimPhase&#x6267;&#x884C;GC&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x3002;<br>          &#x6B65;&#x9AA4;5. &#x6062;&#x590D;&#x7B2C;2&#x6B65;&#x6302;&#x8D77;&#x7684;ART&#x8FD0;&#x884C;&#x65F6;&#x7EBF;&#x7A0B;&#x3002;<br>          &#x6B65;&#x9AA4;6. &#x8C03;&#x7528;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;FinishPhase&#x6267;&#x884C;GC&#x7ED3;&#x675F;&#x9636;&#x6BB5;&#x3002;</p>
<ul>
<li>&#x5E76;&#x53D1;GC</li>
</ul>
<p>&#x6B65;&#x9AA4;1. &#x8C03;&#x7528;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;InitializePhase&#x6267;&#x884C;GC&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#x3002;<br>          &#x6B65;&#x9AA4;2. &#x83B7;&#x53D6;&#x7528;&#x4E8E;&#x8BBF;&#x95EE;Java&#x5806;&#x7684;&#x9501;&#x3002;<br>          &#x6B65;&#x9AA4;3. &#x8C03;&#x7528;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;MarkingPhase&#x6267;&#x884C;GC&#x5E76;&#x884C;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x3002;<br>          &#x6B65;&#x9AA4;4. &#x91CA;&#x653E;&#x7528;&#x4E8E;&#x8BBF;&#x95EE;Java&#x5806;&#x7684;&#x9501;&#x3002;<br>          &#x6B65;&#x9AA4;5. &#x6302;&#x8D77;&#x6240;&#x6709;&#x7684;ART&#x8FD0;&#x884C;&#x65F6;&#x7EBF;&#x7A0B;&#x3002;<br>          &#x6B65;&#x9AA4;6. &#x8C03;&#x7528;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;HandleDirtyObjectsPhase&#x5904;&#x7406;&#x5728;GC&#x5E76;&#x884C;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x88AB;&#x4FEE;&#x6539;&#x7684;&#x5BF9;&#x8C61;&#x3002;<br>          &#x6B65;&#x9AA4;7. &#x6062;&#x590D;&#x7B2C;4&#x6B65;&#x6302;&#x8D77;&#x7684;ART&#x8FD0;&#x884C;&#x65F6;&#x7EBF;&#x7A0B;&#x3002;<br>          &#x6B65;&#x9AA4;8. &#x91CD;&#x590D;&#x7B2C;5&#x5230;&#x7B2C;7&#x6B65;&#xFF0C;&#x76F4;&#x5230;&#x6240;&#x6709;&#x5728;GC&#x5E76;&#x884C;&#x9636;&#x6BB5;&#x88AB;&#x4FEE;&#x6539;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x5904;&#x7406;&#x5B8C;&#x6210;&#x3002;<br>          &#x6B65;&#x9AA4;9. &#x83B7;&#x53D6;&#x7528;&#x4E8E;&#x8BBF;&#x95EE;Java&#x5806;&#x7684;&#x9501;&#x3002;<br>          &#x6B65;&#x9AA4;10. &#x8C03;&#x7528;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;ReclaimPhase&#x6267;&#x884C;GC&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x3002;<br>          &#x6B65;&#x9AA4;11. &#x91CA;&#x653E;&#x7528;&#x4E8E;&#x8BBF;&#x95EE;Java&#x5806;&#x7684;&#x9501;&#x3002;<br>          &#x6B65;&#x9AA4;12. &#x8C03;&#x7528;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;FinishPhase&#x6267;&#x884C;GC&#x7ED3;&#x675F;&#x9636;&#x6BB5;&#x3002;<br>&#x6240;&#x4EE5;&#x4E0D;&#x8BBA;&#x662F;&#x5E76;&#x53D1;&#x8FD8;&#x662F;&#x975E;&#x5E76;&#x53D1;&#xFF0C;&#x90FD;&#x4F1A;&#x5F15;&#x8D77;Stop World&#x7684;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#xFF0C;&#x5E76;&#x53D1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5355;&#x6B21;Stop World&#x7684;&#x65F6;&#x95F4;&#x4F1A;&#x66F4;&#x77ED;&#xFF0C;&#x57FA;&#x672C;&#x533A;&#x522B;&#x548C;Dalvik&#x7C7B;&#x4F3C;&#x3002;</p>
<h4 id="3.5. ART&#x5E76;&#x53D1;&#x548C;Dalvik&#x5E76;&#x53D1;GC&#x7684;&#x5DEE;&#x5F02;"><a href="#3-5-ART&#x5E76;&#x53D1;&#x548C;Dalvik&#x5E76;&#x53D1;GC&#x7684;&#x5DEE;&#x5F02;" class="headerlink" title="3.5. ART&#x5E76;&#x53D1;&#x548C;Dalvik&#x5E76;&#x53D1;GC&#x7684;&#x5DEE;&#x5F02;"></a>3.5. ART&#x5E76;&#x53D1;&#x548C;Dalvik&#x5E76;&#x53D1;GC&#x7684;&#x5DEE;&#x5F02;</h4><p>&#x9996;&#x5148;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5982;&#x4E0B;2&#x5F20;&#x56FE;&#x6765;&#x5BF9;&#x6BD4;&#x4E0B;&#x3002;<br>Dalvik GC&#xFF1A;</p>
<p><img src="http://ww2.sinaimg.cn/large/62b0904dgw1f04wjcvt8rj20d015842i.jpg" alt=""></p>
<p>ART GC:</p>
<p><img src="http://ww3.sinaimg.cn/large/62b0904dgw1f04wlurmjmj20e70timzp.jpg" alt=""></p>
<p>ART&#x7684;&#x5E76;&#x53D1;GC&#x548C;Dalvik&#x7684;&#x5E76;&#x53D1;GC&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF0C;&#x521D;&#x770B;&#x597D;&#x50CF;2&#x8005;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x4E00;&#x76F4;&#x6302;&#x8D77;&#x7EBF;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x4F1A;&#x6709;&#x6682;&#x505C;&#x7EBF;&#x7A0B;&#x53BB;&#x6267;&#x884C;&#x6807;&#x8BB0;&#x5BF9;&#x8C61;&#x7684;&#x6D41;&#x7A0B;&#x3002;&#x901A;&#x8FC7;&#x9605;&#x8BFB;&#x76F8;&#x5173;&#x6587;&#x6863;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;&#x5230;ART&#x5E76;&#x53D1;GC&#x5BF9;&#x4E8E;Dalvik&#x6765;&#x8BF4;&#x4E3B;&#x8981;&#x6709;&#x4E09;&#x4E2A;&#x4F18;&#x52BF;&#x70B9;&#xFF1A;</p>
<ol>
<li>&#x6807;&#x8BB0;&#x81EA;&#x8EAB;</li>
</ol>
<p>ART&#x5728;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x65F6;&#x4F1A;&#x5C06;&#x65B0;&#x5206;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x538B;&#x5165;&#x5230;Heap&#x7C7B;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;allocation<em>stack</em>&#x63CF;&#x8FF0;&#x7684;Allocation Stack&#x4E2D;&#x53BB;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x7F29;&#x51CF;&#x5BF9;&#x8C61;&#x904D;&#x5386;&#x8303;&#x56F4;&#x3002;</p>
<ol>
<li>&#x9884;&#x8BFB;&#x53D6;</li>
</ol>
<p>&#x5BF9;&#x4E8E;&#x6807;&#x8BB0;Allocation Stack&#x7684;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x4F1A;&#x9884;&#x8BFB;&#x53D6;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x904D;&#x5386;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x540C;&#x65F6;&#x518D;&#x53D6;&#x51FA;&#x6765;&#x8BE5;&#x5BF9;&#x8C61;&#x540E;&#x53C8;&#x4F1A;&#x5C06;&#x8BE5;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x7684;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x538B;&#x5165;&#x6808;&#x4E2D;&#xFF0C;&#x76F4;&#x81F3;&#x904D;&#x5386;&#x5B8C;&#x6BD5;&#x3002;</p>
<ol>
<li>&#x51CF;&#x5C11;Suspend&#x65F6;&#x95F4;</li>
</ol>
<p>&#x5728;Mark&#x9636;&#x6BB5;&#x662F;&#x4E0D;&#x4F1A;Block&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x4F1A;&#x6709;&#x810F;&#x6570;&#x636E;&#xFF0C;&#x6BD4;&#x5982;Mark&#x53D1;&#x73B0;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x7684;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x53C8;&#x88AB;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5728;Mark&#x9636;&#x6BB5;&#x4E5F;&#x4F1A;&#x5904;&#x7406;&#x4E00;&#x4E9B;&#x810F;&#x6570;&#x636E;&#x800C;&#x4E0D;&#x662F;&#x7559;&#x5728;&#x6700;&#x540E;Block&#x7684;&#x65F6;&#x5019;&#x518D;&#x53BB;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x6837;&#x4E5F;&#x4F1A;&#x51CF;&#x5C11;&#x540E;&#x9762;Block&#x9636;&#x6BB5;&#x5BF9;&#x4E8E;&#x810F;&#x6570;&#x636E;&#x7684;&#x5904;&#x7406;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<h4 id="3.6. &#x524D;&#x540E;&#x53F0;GC"><a href="#3-6-&#x524D;&#x540E;&#x53F0;GC" class="headerlink" title="3.6. &#x524D;&#x540E;&#x53F0;GC"></a>3.6. &#x524D;&#x540E;&#x53F0;GC</h4><p>&#x524D;&#x53F0;Foreground&#x6307;&#x7684;&#x5C31;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x524D;&#x53F0;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x800C;&#x540E;&#x53F0;Background&#x5C31;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#x65F6;&#x3002;&#x56E0;&#x6B64;&#xFF0C;Foreground GC&#x5C31;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x524D;&#x53F0;&#x8FD0;&#x884C;&#x65F6;&#x6267;&#x884C;&#x7684;GC&#xFF0C;&#x800C;Background&#x5C31;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#x65F6;&#x6267;&#x884C;&#x7684;GC&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x524D;&#x53F0;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x54CD;&#x5E94;&#x6027;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x8981;&#x6C42;&#x6267;&#x884C;&#x7684;GC&#x662F;&#x9AD8;&#x6548;&#x7684;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x54CD;&#x5E94;&#x6027;&#x4E0D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x9002;&#x5408;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x5806;&#x7684;&#x5185;&#x5B58;&#x788E;&#x7247;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x6B64;&#xFF0C;Mark-Sweep GC&#x9002;&#x5408;&#x4F5C;&#x4E3A;Foreground GC&#xFF0C;&#x800C;Mark-Compact GC&#x9002;&#x5408;&#x4F5C;&#x4E3A;Background GC&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x6709;Compact&#x7684;&#x80FD;&#x529B;&#x5B58;&#x5728;&#xFF0C;&#x788E;&#x7247;&#x5316;&#x5728;ART&#x4E0A;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x88AB;&#x907F;&#x514D;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E5F;&#x662F;ART&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<h4 id="3.7. ART&#x5927;&#x6CD5;&#x597D;"><a href="#3-7-ART&#x5927;&#x6CD5;&#x597D;" class="headerlink" title="3.7. ART&#x5927;&#x6CD5;&#x597D;"></a>3.7. ART&#x5927;&#x6CD5;&#x597D;</h4><p>&#x603B;&#x7684;&#x6765;&#x770B;&#xFF0C;ART&#x5728;GC&#x4E0A;&#x505A;&#x7684;&#x6BD4;Dalvik&#x597D;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x4E0D;&#x5149;&#x662F;GC&#x7684;&#x6548;&#x7387;&#xFF0C;&#x51CF;&#x5C11;Pause&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x5728;&#x5185;&#x5B58;&#x5206;&#x914D;&#x4E0A;&#x5BF9;&#x5927;&#x5185;&#x5B58;&#x7684;&#x6709;&#x5355;&#x72EC;&#x7684;&#x5206;&#x914D;&#x533A;&#x57DF;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x80FD;&#x6709;&#x7B97;&#x6CD5;&#x5728;&#x540E;&#x53F0;&#x505A;&#x5185;&#x5B58;&#x6574;&#x7406;&#xFF0C;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x788E;&#x7247;&#x3002;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;ART&#x4E0B;&#x6211;&#x4EEC;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5F88;&#x591A;&#x7C7B;&#x4F3C;GC&#x5BFC;&#x81F4;&#x7684;&#x5361;&#x987F;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x53E6;&#x5916;&#x6839;&#x636E;&#x8C37;&#x6B4C;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x6765;&#x770B;&#xFF0C;ART&#x76F8;&#x5BF9;Dalvik&#x5185;&#x5B58;&#x5206;&#x914D;&#x7684;&#x6548;&#x7387;&#x63D0;&#x9AD8;&#x4E86;10&#x500D;&#xFF0C;GC&#x7684;&#x6548;&#x7387;&#x63D0;&#x9AD8;&#x4E86;2-3&#x500D;&#x3002;</p>
<h3 id="4. GC Log"><a href="#4-GC-Log" class="headerlink" title="4. GC Log"></a>4. GC Log</h3><p>&#x5F53;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x6839;&#x636E;GC&#x65E5;&#x5FD7;&#x6765;&#x8FFD;&#x67E5;&#x4E00;&#x4E9B;GC&#x53EF;&#x80FD;&#x9020;&#x6210;&#x7684;&#x5361;&#x987F;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E86;&#x89E3;GC&#x65E5;&#x5FD7;&#x7684;&#x7EC4;&#x6210;&#xFF0C;&#x4E0D;&#x540C;&#x4FE1;&#x606F;&#x4EE3;&#x8868;&#x4E86;&#x4EC0;&#x4E48;&#x542B;&#x4E49;&#x3002;</p>
<h4 id="4.1. Dalvik GC&#x65E5;&#x5FD7;"><a href="#4-1-Dalvik-GC&#x65E5;&#x5FD7;" class="headerlink" title="4.1. Dalvik GC&#x65E5;&#x5FD7;"></a>4.1. Dalvik GC&#x65E5;&#x5FD7;</h4><p>Dalvik&#x7684;&#x65E5;&#x5FD7;&#x683C;&#x5F0F;&#x57FA;&#x672C;&#x5982;&#x4E0B;&#xFF1A;<br><figure class="highlight xml"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">D/dalvikvm:<span class="tag">&lt;<span class="name">GC_Reason</span>&gt;</span><span class="tag">&lt;<span class="name">Amount_freed</span>&gt;</span>,<span class="tag">&lt;<span class="name">Heap_stats</span>&gt;</span>,<span class="tag">&lt;<span class="name">Pause_time</span>&gt;</span>,<span class="tag">&lt;<span class="name">Total_time</span>&gt;</span></div></pre></td></tr></table></figure></p>
<p><code>GC_Reason</code>: &#x5C31;&#x662F;&#x6211;&#x4EEC;&#x4E0A;&#x6587;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x662F;gc_alloc&#x8FD8;&#x662F;gc_concurrent&#xFF0C;&#x4E86;&#x89E3;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x539F;&#x56E0;&#x65B9;&#x4FBF;&#x6211;&#x4EEC;&#x505A;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x3002;<br><code>Amount_freed</code>: &#x8868;&#x793A;&#x7CFB;&#x7EDF;&#x901A;&#x8FC7;&#x8FD9;&#x6B21;GC&#x64CD;&#x4F5C;&#x91CA;&#x653E;&#x4E86;&#x591A;&#x5C11;&#x5185;&#x5B58;&#x3002;<br><code>Heap_stats</code>: &#x4E2D;&#x4F1A;&#x663E;&#x793A;&#x5F53;&#x524D;&#x5185;&#x5B58;&#x7684;&#x7A7A;&#x95F2;&#x6BD4;&#x4F8B;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#xFF08;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x5185;&#x5B58; / &#x5F53;&#x524D;&#x7A0B;&#x5E8F;&#x603B;&#x5185;&#x5B58;&#xFF09;&#x3002;<br><code>Pause_time</code>: &#x8868;&#x793A;&#x8FD9;&#x6B21;GC&#x64CD;&#x4F5C;&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6682;&#x505C;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x6682;&#x505C;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5728;2.3&#x4E4B;&#x524D;GC&#x64CD;&#x4F5C;&#x662F;&#x4E0D;&#x80FD;&#x5E76;&#x53D1;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7CFB;&#x7EDF;&#x6B63;&#x5728;&#x8FDB;&#x884C;GC&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C31;&#x53EA;&#x80FD;&#x963B;&#x585E;&#x4F4F;&#x7B49;&#x5F85;GC&#x7ED3;&#x675F;&#x3002;&#x800C;&#x81EA;2.3&#x4E4B;&#x540E;&#xFF0C;GC&#x64CD;&#x4F5C;&#x6539;&#x6210;&#x4E86;&#x5E76;&#x53D1;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;GC&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x5728;GC&#x64CD;&#x4F5C;&#x7684;&#x5F00;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x77ED;&#x6682;&#x963B;&#x585E;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x6709;&#x540E;&#x7EED;&#x7684;&#x4E00;&#x4E2A;total_time&#x3002;<br><code>Total_time</code>: &#x8868;&#x793A;&#x672C;&#x6B21;GC&#x6240;&#x82B1;&#x8D39;&#x7684;&#x603B;&#x65F6;&#x95F4;&#x548C;&#x4E0A;&#x9762;&#x7684;Pause_time,&#x4E5F;&#x5C31;&#x662F;stop all&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5361;&#x987F;&#x65F6;&#x95F4;&#x4E3B;&#x8981;&#x770B;&#x4E0A;&#x9762;&#x7684;pause_time&#x3002;</p>
<h4 id="4.2. ART GC&#x65E5;&#x5FD7;"><a href="#4-2-ART-GC&#x65E5;&#x5FD7;" class="headerlink" title="4.2. ART GC&#x65E5;&#x5FD7;"></a>4.2. ART GC&#x65E5;&#x5FD7;</h4><figure class="highlight vim"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">I/<span class="keyword">ar</span><span class="variable">t:</span><span class="symbol">&lt;GC_Reason&gt;</span><span class="symbol">&lt;Amount_freed&gt;</span>,<span class="symbol">&lt;LOS_Space_Status&gt;</span>,<span class="symbol">&lt;Heap_stats&gt;</span>,<span class="symbol">&lt;Pause_time&gt;</span>,<span class="symbol">&lt;Total_time&gt;</span></div></pre></td></tr></table></figure>
<p>&#x57FA;&#x672C;&#x60C5;&#x51B5;&#x548C;Dalvik&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5DEE;&#x522B;&#xFF0C;GC&#x7684;Reason&#x66F4;&#x591A;&#x4E86;&#xFF0C;&#x8FD8;&#x591A;&#x4E86;&#x4E00;&#x4E2A;OS_Space_Status.<br><code>LOS_Space_Status</code>&#xFF1A;Large Object Space&#xFF0C;&#x5927;&#x5BF9;&#x8C61;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5B58;&#x5E76;&#x4E0D;&#x662F;&#x5206;&#x914D;&#x5728;&#x5806;&#x4E0A;&#x7684;&#xFF0C;&#x4F46;&#x4ECD;&#x5C5E;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x7BA1;&#x7406; bitmap &#x7B49;&#x5360;&#x5185;&#x5B58;&#x5927;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x907F;&#x514D;&#x56E0;&#x5206;&#x914D;&#x5927;&#x5185;&#x5B58;&#x5BFC;&#x81F4;&#x5806;&#x9891;&#x7E41; GC&#x3002;<br>&#x5199;&#x5728;&#x6700;&#x540E;&#xFF1A;&#x56FE;&#x7247;&#x6765;&#x6E90;&#x81EA;&#x7F51;&#x7EDC;&#xFF0C;&#x7279;&#x522B;&#x9E23;&#x8C22;&#x7F57;&#x5347;&#x9633;&#x3002; </p>
<p>&#x539F;&#x6587;&#x5730;&#x5740;:<a href="http://mp.weixin.qq.com/s?__biz=MzI1MTA1MzM2Nw==&amp;mid=400021278&amp;idx=1&amp;sn=0e971807eb0e9dcc1a81853189a092f3&amp;scene=0#rd" target="_blank" rel="external">http://mp.weixin.qq.com/s?__biz=MzI1MTA1MzM2Nw==&amp;mid=400021278&amp;idx=1&amp;sn=0e971807eb0e9dcc1a81853189a092f3&amp;scene=0#rd</a> &#x7248;&#x6743;&#x7531;&#x539F;&#x4F5C;&#x8005;&#x6240;&#x6709;</p>

      
      
      
        <div class="post-copyright">
<p><a href="http://www.ithome.me/archives/Android-GC-那点事/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2016年1月19日 18:01</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav" class="block-select">
  
    <a href="/archives/React-Native首次运行提示-ReferenceError-Can-t-find-variable-fbBatchedBridge/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          React Native首次运行提示&#39;ReferenceError: Can&#39;t find variable: _fbBatchedBridge&#39;
        
      </div>
    </a>
  
  
    <a href="/archives/Android无需权限显示悬浮窗-兼谈逆向分析app/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">Android无需权限显示悬浮窗, 兼谈逆向分析app</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer" class="block-select">
  <div class="outer">
    <div id="footer-info">
      <div class="footer-left">&copy; 2015-2018
        Simon.Chen
      </div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {fancybox: false,mathjax: false,animate: false,isHome: false,isPost: true,isArchive: false,isTag: false,isCategory: false,open_in_new: true, CDN_PATH: '' }
</script>


    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/base.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>





  </div>
</body>
</html>
