<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>创业前需要知道的5个编程谬论</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#00796b">
  <meta name="msapplication-TileColor" content="#4E8071"/>
  
  
  
  
  <link rel="stylesheet" href="/css/style.css" type="text/css"> 
</head>


<body>

  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
  <header id="header" class="inner">
    <a href="/" class="profilepic">
      <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	</a>
	<p class="header-subtitle">分享有助于提升</p>
    <nav class="header-menu">
      <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li>
      </ul>
    </nav>
  </header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  <div class="intrude-less">
    <header id="header" class="inner">
      <a href="/" class="profilepic">
        <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	  </a>
	  <p class="header-subtitle">分享有助于提升</p>
	  <nav class="header-menu">
	    <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li><div class="clearfix"></div>
		</ul>
	  </nav>
	</header>				
  </div>
</nav>

      <div class="body-wrap">
<article id="post-创业前需要知道的5个编程谬论" class="article article-type-post" itemscope itemprop="blogPost">

   
    
    <div class="article-meta">
      
<div class="article-date">
<span class="datetime-published-tag"> 2015-03-06 </span>
</div>


    </div>
    
    
  
  <div class="article-inner block-select">
  
    
    
      <header class="article-header">
        
           
  
    <h1 class="article-title" itemprop="name">
      创业前需要知道的5个编程谬论
    </h1>
  

        
      </header>
      
      <div class="article-info article-info-post">
        
	<div class="article-tag tagcloud block-select">
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/创业/">创业</a></li></ul>
	</div>


        
             <div class="clearfix"></div>
        
      </div>
      
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <p><strong>&#x672C;&#x6587;&#x662F;<a href="http://www.codeceo.com/" title="&#x7801;&#x519C;&#x7F51;" target="_blank" rel="external">&#x7801;&#x519C;&#x7F51;</a>&#x539F;&#x521B;&#x7FFB;&#x8BD1;&#xFF0C;&#x8F6C;&#x8F7D;&#x8BF7;&#x770B;&#x6E05;&#x6587;&#x672B;&#x7684;&#x8F6C;&#x8F7D;&#x8981;&#x6C42;&#xFF0C;&#x8C22;&#x8C22;&#x5408;&#x4F5C;&#xFF01;</strong></p>
<p>&#x6211;&#x662F;&#x4E00;&#x540D;&#x9ED1;&#x5BA2;&#x3002;&#x5728;&#x6211;&#x8FD8;&#x5C31;&#x819D;&#x76D6;&#x90A3;&#x4E48;&#x9AD8;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5F00;&#x59CB;&#x7528;&#x4E00;&#x53F0;&#x53E4;&#x8001;&#x7684;Commodore 64&#x5199;&#x4EE3;&#x7801;&#x4E86;&#x3002;&#x76F4;&#x5230;&#x4ECA;&#x5929;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6BD4;&#x6234;&#x4E0A;&#x8033;&#x673A;&#xFF0C;&#x7834;&#x89E3;&#x4E1C;&#x897F;&#x66F4;&#x8BA9;&#x6211;&#x7740;&#x9B54;&#x7684;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x6211;&#x521B;&#x5EFA;&#x6211;&#x7684;&#x7B2C;&#x4E00;&#x5BB6;&#x4F01;&#x4E1A;&#x65F6;&#xFF0C;&#x6211;&#x5C31;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4E86;&#x5F88;&#x591A;&#x6709;&#x5173;&#x4E8E;&#x7F16;&#x7A0B;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x662F;&#x4E0D;&#x662F;&#x8C2C;&#x8BBA;&#xFF0C;&#x4E14;&#x542C;&#x6211;&#x4E0B;&#x9762;&#x4E00;&#x4E00;&#x9053;&#x6765;&#xFF1A;</p>
<p><img src="http://static.codeceo.com/images/2015/03/6d34d8428f0e07ff16ca046ffecb9da1.png" alt="Jiro scoffs at your code."></p>
<h2 id="1.&#x4EE3;&#x7801;&#x5F88;&#x91CD;&#x8981;"><a href="#1-&#x4EE3;&#x7801;&#x5F88;&#x91CD;&#x8981;" class="headerlink" title="1.&#x4EE3;&#x7801;&#x5F88;&#x91CD;&#x8981;"></a>1.&#x4EE3;&#x7801;&#x5F88;&#x91CD;&#x8981;</h2><p>&#x6211;&#x5728;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x5DE5;&#x4F5C;&#x8FC7;&#xFF0C;&#x53D1;&#x73B0;&#x6210;&#x529F;&#x4E4B;&#x4E2D;&#x9690;&#x85CF;&#x7740;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x666E;&#x904D;&#x73B0;&#x8C61;&#xFF1A;&#x65E9;&#x671F;&#x7684;&#x4EE3;&#x7801;&#x770B;&#x4E0A;&#x53BB;&#x50CF;&#x662F;&#x4E00;&#x7FA4;&#x7A0B;&#x5E8F;&#x733F;&#x559D;&#x9189;&#x4E4B;&#x540E;&#x5199;&#x7684;&#x3002;&#x8FD9;&#x542C;&#x4E0A;&#x53BB;&#x4F3C;&#x4E4E;&#x6709;&#x6096;&#x5E38;&#x7406;&#xFF0C;&#x90A3;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x5F97;&#x7AED;&#x5C3D;&#x5168;&#x529B;&#x8BA9;&#x4F01;&#x4E1A;&#x6210;&#x957F;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x53BB;&#x8FFD;&#x6C42;&#x8F6F;&#x4EF6;&#x7684;&#x5B8C;&#x7F8E;&#x3002;&#x4ECE;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x8BB2;&#xFF0C;&#x5931;&#x8D25;&#x7684;&#x4F01;&#x4E1A;&#xFF0C;&#x5374;&#x4F1A;&#x82B1;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x6765;&#x4FEE;&#x6B63;&#x5176;&#x4EE3;&#x7801;&#x5E93;&#x3002;</p>
<p>&#x6253;&#x4E2A;&#x6BD4;&#x65B9;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x5BFF;&#x53F8;&#x5E08;&#x5085;&#x3002;&#x4F5C;&#x4E3A;&#x4F60;&#x5DE5;&#x4F5C;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4F60;&#x6536;&#x96C6;&#x4E86;&#x4E00;&#x5957;&#x7EDD;&#x7248;&#x7684;&#x5200;&#x5177;&#x3002;&#x4F60;&#x82B1;&#x65F6;&#x95F4;&#x82B1;&#x7CBE;&#x529B;&#x6765;&#x5B8C;&#x6210;&#x6536;&#x85CF;&#xFF0C;&#x5B83;&#x4EEC;&#x63D0;&#x5347;&#x4E86;&#x4F60;&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x53A8;&#x5E08;&#x7684;&#x7ADE;&#x4E89;&#x529B;&#x3002;</p>
<p>&#x4F46;&#x65E0;&#x8BBA;&#x4F60;&#x6BCF;&#x5929;&#x7528;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#x53BB;&#x6253;&#x78E8;&#x4F60;&#x7684;&#x9053;&#x5177;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x94C1;&#x5320;&#x3002;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x4F9D;&#x7136;&#x662F;&#x505A;&#x5BFF;&#x53F8;&#x3002;&#x4F60;&#x867D;&#x7136;&#x62E5;&#x6709;&#x4E86;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x597D;&#x7684;&#x5200;&#x5177;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x505A;&#x4E0D;&#x597D;&#x5BFF;&#x53F8;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#x670D;&#x52A1;&#x5C31;&#x662F;&#x5DEE;&#x8BC4;&#x3002;&#x4F60;&#x7684;&#x9910;&#x9986;&#x751F;&#x610F;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6210;&#x529F;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x4E5F;&#x662F;&#x540C;&#x6837;&#x7684;&#x9053;&#x7406;&#x3002;&#x5F53;&#x4F60;&#x8FD0;&#x8425;&#x516C;&#x53F8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x76EE;&#x7684;&#x662F;&#x6EE1;&#x8DB3;&#x5BA2;&#x6237;&#x3002;&#x4EE3;&#x7801;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x80FD;&#x8FBE;&#x5230;&#x76EE;&#x7684;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x662F;&#x76EE;&#x7684;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#xFF0C;&#x4E5F;&#x5E94;&#x5F53;&#x5173;&#x5FC3;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x80FD;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x5347;&#x5BA2;&#x6237;&#x670D;&#x52A1;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x9519;&#x5C06;&#x5DE5;&#x5177;&#x5F53;&#x4F5C;&#x4E86;&#x76EE;&#x6807;&#xFF0C;&#x90A3;&#x4E48;&#x6CE8;&#x5B9A;&#x4F60;&#x5C06;&#x4E00;&#x8D25;&#x6D82;&#x5730;&#x3002;</p>
<p>&#x7ECF;&#x9A8C;&#x6559;&#x8BAD;&#xFF1A;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#x5E76;&#x4E0D;&#x5173;&#x5FC3;&#x4EC0;&#x4E48;&#x6D4B;&#x8BD5;&#x8986;&#x76D6;&#x7387;&#x3001;&#x6280;&#x672F;&#x5806;&#x6808;&#xFF0C;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x4E0D;&#x5728;&#x4E4E;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x4EC0;&#x4E48;&#x7B97;&#x6CD5;&#x3002;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x89E3;&#x51B3;&#x5BA2;&#x6237;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8D8A;&#x65B9;&#x4FBF;&#x8D8A;&#x597D;&#x3002;</p>
<h2 id="2. &#x2026;&#x5173;&#x6CE8;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x70B9;&#x5B50;&#x3002;"><a href="#2-&#x2026;&#x5173;&#x6CE8;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x70B9;&#x5B50;&#x3002;" class="headerlink" title="2. &#x2026;&#x5173;&#x6CE8;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x70B9;&#x5B50;&#x3002;"></a>2. &#x2026;&#x5173;&#x6CE8;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x70B9;&#x5B50;&#x3002;</h2><p>&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x4F3C;&#x4E4E;&#x8FDD;&#x80CC;&#x4E86;&#x4F20;&#x7EDF;&#x7684;&#x521B;&#x4E1A;&#x987B;&#x77E5;&#xFF1A;&#x5FEB;&#x901F;&#x53D1;&#x5E03;&#xFF01;&#x6267;&#x884C;&#xFF01;&#x8FED;&#x4EE3;&#xFF01;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x521B;&#x610F;&#xFF01;&#x5FEB;&#x901F;&#x5931;&#x8D25;&#xFF01;</p>
<p>&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4F1F;&#x5927;&#x7684;&#x5FE0;&#x544A;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x201C;&#x4E0D;&#x9700;&#x8981;&#x521B;&#x610F;&#x201D;&#xFF0C;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x80FD;&#x901A;&#x8FC7;&#x5353;&#x8D8A;&#x7684;&#x6267;&#x884C;&#x77EB;&#x6B63;&#x4E00;&#x4E2A;&#x7CDF;&#x7CD5;&#x7684;&#x70B9;&#x5B50;&#x3002;&#x6210;&#x529F;&#x5C31;&#x662F;&#x53D1;&#x73B0;&#x597D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x518D;&#x597D;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x70B9;&#x5B50;&#x597D;&#x5374;&#x6CA1;&#x6709;&#x597D;&#x597D;&#x5B9E;&#x73B0;&#x6216;&#x8005;&#x5B8C;&#x7F8E;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x574F;&#x70B9;&#x5B50;&#xFF0C;&#x90FD;&#x662F;&#x4E0D;&#x884C;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#x524D;&#x8005;&#x8FD8;&#x6709;&#x5F97;&#x6551;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x88AB;&#x56F0;&#x5B9E;&#x73B0;&#x7684;&#x6B7B;&#x4EA1;&#x6F29;&#x6DA1;&#x4E2D;&#xFF0C;&#x82B1;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x521B;&#x5EFA;&#x5404;&#x79CD;&#x529F;&#x80FD;&#x6216;&#x8005;&#x4FEE;&#x590D;bug&#xFF0C;&#x76F8;&#x4FE1;&#x518D;&#x6DFB;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x5C31;&#x80FD;&#x6210;&#x529F;&#x3002;&#x6211;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x8FD9;&#x662F;&#x9519;&#x89C9;&#x3002;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x4E86;&#x67D0;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x8FD9;&#x6837;&#x4E0D;&#x65AD;&#x4E3A;&#x4EA7;&#x54C1;&#x6DFB;&#x52A0;&#x529F;&#x80FD;&#x6839;&#x672C;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x6DFB;&#x52A0;&#x7684;&#x529F;&#x80FD;&#x786E;&#x5B9E;&#x80FD;&#x89E3;&#x51B3;&#x9700;&#x8981;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x70B9;&#x5B50;&#x597D;&#x5374;&#x6CA1;&#x6709;&#x597D;&#x597D;&#x5B9E;&#x73B0;&#xFF0C;&#x603B;&#x6BD4;&#x5B8C;&#x7F8E;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x574F;&#x70B9;&#x5B50;&#x8981;&#x597D;&#x3002;<br>&#x7ECF;&#x9A8C;&#x6559;&#x8BAD;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x6DFB;&#x52A0;&#x7684;&#x529F;&#x80FD;&#x662F;&#x7528;&#x6765;&#x4FEE;&#x590D;&#x4E00;&#x4E2A;&#x5931;&#x8D25;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x597D;&#x5148;&#x95EE;&#x95EE;&#x81EA;&#x5DF1;&#x8FD9;&#x80FD;&#x4E0D;&#x80FD;&#x771F;&#x6B63;&#x5730;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;</p>
</blockquote>
<h2 id="3. &#x2026;&#x2026;&#x4EE3;&#x7801;&#x662F;&#x5199;&#x7ED9;&#x8BA1;&#x7B97;&#x673A;&#x7684;"><a href="#3-&#x2026;&#x2026;&#x4EE3;&#x7801;&#x662F;&#x5199;&#x7ED9;&#x8BA1;&#x7B97;&#x673A;&#x7684;" class="headerlink" title="3. &#x2026;&#x2026;&#x4EE3;&#x7801;&#x662F;&#x5199;&#x7ED9;&#x8BA1;&#x7B97;&#x673A;&#x7684;"></a>3. &#x2026;&#x2026;&#x4EE3;&#x7801;&#x662F;&#x5199;&#x7ED9;&#x8BA1;&#x7B97;&#x673A;&#x7684;</h2><p>&#x6211;&#x603B;&#x662F;&#x60F3;&#x4E0D;&#x901A;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E00;&#x9519;&#x8BEF;&#x4F1A;&#x5982;&#x6B64;&#x4E4B;&#x5386;&#x4E45;&#x5F25;&#x575A;&#x3002;&#x65E0;&#x8BBA;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x7B2C;&#x51E0;&#x6B21;&#x56E0;&#x4E3A;&#x540C;&#x4E8B;&#x7684;&#x7CDF;&#x7CD5;&#x6587;&#x6863;&#x548C;&#x6C9F;&#x901A;&#x4E60;&#x60EF;&#x800C;&#x9677;&#x5165;&#x56F0;&#x5883;&#xFF0C;&#x4ED6;&#x4EEC;&#x56E0;&#x6B64;&#x800C;&#x5F97;&#x51FA;&#x7684;&#x7ED3;&#x8BBA;&#x5F80;&#x5F80;&#x8FD8;&#x662F;&#x2014;&#x2014;&#x7A0B;&#x5E8F;&#x5458;&#x5929;&#x751F;&#x4E0D;&#x64C5;&#x957F;&#x8FD9;&#x7C7B;&#x4E8B;&#x60C5;&#xFF0C;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x505A;&#x505A;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5927;&#x9519;&#x7279;&#x9519;&#x554A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x90A3;&#x4E48;&#x63D0;&#x5347;&#x56E2;&#x961F;&#x6548;&#x7387;&#x6700;&#x5927;&#x7684;&#x4E00;&#x4E2A;&#x969C;&#x788D;&#x5C31;&#x662F;&#x6C9F;&#x901A;&#x2014;&#x2014;&#x8FD9;&#x4E0D;&#x662F;&#x5938;&#x5F20;&#xFF0C;&#x56E2;&#x961F;&#x9762;&#x5BF9;&#x7684;&#x662F;O(n<sup>2</sup>)&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x662F;&#x4F60;&#x7684;&#x4E3B;&#x8981;&#x8F93;&#x51FA;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x9700;&#x8981;&#x6539;&#x53D8;&#x4F60;&#x5BF9;&#x7F16;&#x7A0B;&#x7684;&#x770B;&#x6CD5;&#xFF1A;&#x4EE3;&#x7801;&#x662F;&#x5199;&#x7ED9;&#x4EBA;&#x770B;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x521A;&#x597D;&#x80FD;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x7A0B;&#x5E8F;&#x5458;&#x82B1;&#x4E86;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x5B5C;&#x5B5C;&#x4E0D;&#x5026;&#x5730;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x7701;&#x7565;&#x4E86;&#x7528;&#x4E8E;&#x66F4;&#x65B0;&#x4EE3;&#x7801;&#x6587;&#x6863;&#x7684;&#x5341;&#x5206;&#x949F;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x89C9;&#x5F97;&#xFF1A;&#x201C;&#x6740;&#x9E21;&#x7109;&#x7528;&#x5BB0;&#x725B;&#x5200;&#xFF0C;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x7559;&#x7ED9;&#x4EE5;&#x540E;&#x7684;&#x4EBA;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x6211;&#x7684;&#x65F6;&#x95F4;&#x5B9D;&#x8D35;&#x7740;&#x5462;&#x3002;&#x201D;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x8BB2;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x60F3;&#x6CD5;&#x8352;&#x8C2C;&#x81F3;&#x6781;&#x3002;</p>
<p>&#x7ECF;&#x9A8C;&#x6559;&#x8BAD;&#xFF1A;&#x4EE3;&#x7801;&#x662F;&#x5199;&#x7ED9;&#x4EBA;&#x770B;&#x7684;&#x3002;&#x6CA1;&#x6587;&#x6863;&#x5C31;&#x4E0D;&#x8981;&#x5199;&#x4EE3;&#x7801;&#x3002;</p>
<h2 id="4. &#x2026;&#x8FD9;&#x662F;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x4E86;&#x3002;"><a href="#4-&#x2026;&#x8FD9;&#x662F;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x4E86;&#x3002;" class="headerlink" title="4. &#x2026;&#x8FD9;&#x662F;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x4E86;&#x3002;"></a>4. &#x2026;&#x8FD9;&#x662F;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x4E86;&#x3002;</h2><p>&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x8BA4;&#x4E3A;&#xFF0C;&#x4E00;&#x65E6;&#x4F60;&#x5199;&#x5B8C;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x6295;&#x5165;&#x4EA7;&#x54C1;&#xFF0C;&#x90A3;&#x5C31;&#x5927;&#x529F;&#x544A;&#x6210;&#x4E86;&#xFF1F;&#x9519;&#x4E86;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;&#x4F60;&#x4ECA;&#x5929;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5982;&#x679C;&#x6210;&#x529F;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x4F1A;&#x5728;&#x4F60;&#x4E4B;&#x540E;&#x7684;&#x591A;&#x4EE3;&#x7A0B;&#x5E8F;&#x5458;&#x4E2D;&#x8000;&#x6B66;&#x626C;&#x5A01;&#x3002;&#x53EF;&#x80FD;&#xFF0C;&#x5C31;&#x4E3A;&#x4E86;&#x7167;&#x6599;&#x4F60;&#x4ECA;&#x5929;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E0D;&#x5F97;&#x4E0D;&#x6210;&#x7ACB;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x3002;</p>
<p>&#x597D;&#x597D;&#x60F3;&#x4E00;&#x60F3;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x7167;&#x6599;&#x522B;&#x4EBA;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x613F;&#x4E0D;&#x613F;&#x610F;&#xFF1F;</p>
<p>&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x5173;&#x952E;&#x662F;&#x8981;&#x6709;&#x5371;&#x673A;&#x610F;&#x601D;&#xFF1A;&#x5199;&#x5B8C;&#x7B2C;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4EE3;&#x7801;&#x7684;&#x5B8C;&#x7ED3;&#x3002;&#x52A1;&#x5FC5;&#x505A;&#x597D;&#x6587;&#x6863;&#x3001;&#x6CE8;&#x91CA;&#x3001;&#x6574;&#x7406;&#x7B49;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x7ECF;&#x9A8C;&#x6559;&#x8BAD;&#xFF1A;&#x5DF1;&#x6240;&#x4E0D;&#x6B32;&#xFF0C;&#x52FF;&#x65BD;&#x4E8E;&#x4EBA;&#x3002;</p>
<h2 id="5. &#x2026;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x5199;&#x4EE3;&#x7801;"><a href="#5-&#x2026;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x5199;&#x4EE3;&#x7801;" class="headerlink" title="5. &#x2026;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x5199;&#x4EE3;&#x7801;"></a>5. &#x2026;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x5199;&#x4EE3;&#x7801;</h2><p>&#x5927;&#x591A;&#x6570;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x8BA4;&#x4E3A;&#x5229;&#x7528;&#x65F6;&#x95F4;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x5F0F;&#x662F;&#x5750;&#x5728;&#x7535;&#x8111;&#x524D;&#xFF0C;&#x6234;&#x4E0A;&#x8033;&#x673A;&#x6572;&#x4EE3;&#x7801;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5199;&#x7684;&#x6BCF;&#x884C;&#x4EE3;&#x7801;&#x90FD;&#x5FC5;&#x987B;&#x7EF4;&#x62A4;&#x548C;&#x652F;&#x6301;&#x6574;&#x4E2A;&#x4EA7;&#x54C1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x90A3;&#x4E48;&#x7B97;&#x6CD5;&#x5C31;&#x53C8;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x4E86;&#x3002;</p>
<p><img src="http://static.codeceo.com/images/2015/03/ec42367b6f75c5f45b830b398e6d9050.jpg" alt="The only believable moment in this film."></p>
<p>&#x5F53;&#x4F60;&#x662F;&#x56E0;&#x4E3A;&#x7231;&#x597D;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x4E3A;&#x6240;&#x6B32;&#x4E3A;&#xFF0C;&#x505A;&#x4EFB;&#x4F55;&#x4F60;&#x559C;&#x6B22;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x4E2D;&#x751F;&#x4EA7;&#x4EA7;&#x54C1;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7684;&#x9996;&#x8981;&#x4E49;&#x52A1;&#x53D8;&#x6210;&#x4E86;&#x7EF4;&#x62A4;&#x73B0;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5176;&#x4ED6;&#x7684;&#x91CD;&#x8981;&#x5DE5;&#x4F5C;&#x4E3A;&#xFF1A;&#x534F;&#x8C03;&#x3001;&#x6C9F;&#x901A;&#x3001;&#x89C4;&#x5212;&#x548C;&#x6307;&#x5BFC;&#x3002;</p>
<p>&#x7ECF;&#x9A8C;&#x6559;&#x8BAD;&#xFF1A;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x6307;&#x7684;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x5199;&#x4EE3;&#x7801;&#x3002;</p>
<h2 id="&#x4F60;&#x4E0D;&#x4EC5;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4E5F;&#x662F;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x3002;"><a href="#&#x4F60;&#x4E0D;&#x4EC5;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4E5F;&#x662F;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x3002;" class="headerlink" title="&#x4F60;&#x4E0D;&#x4EC5;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4E5F;&#x662F;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x3002;"></a>&#x4F60;&#x4E0D;&#x4EC5;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4E5F;&#x662F;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x3002;</h2><p>&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#xFF1A;&#x8FD9;&#x4E8B;&#x60C5;&#x542C;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x62FF;&#x7684;&#x662F;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x85AA;&#x6C34;&#x2014;&#x2014;&#x5C24;&#x5176;&#x662F;&#x5728;&#x521D;&#x521B;&#x4F01;&#x4E1A;&#x2014;&#x2014;&#x90A3;&#x4E48;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x6210;&#x662F;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x5427;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E5F;&#x5E0C;&#x671B;&#x4EA7;&#x54C1;&#x80FD;&#x83B7;&#x5F97;&#x6210;&#x529F;&#xFF0C;&#x90A3;&#x4E48;&#x4ECE;&#x5927;&#x5C40;&#x51FA;&#x53D1;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x6709;&#x5229;&#x4E8E;&#x4F60;&#x7684;&#x521D;&#x521B;&#x4F01;&#x4E1A;&#xFF0C;&#x5BF9;&#x4F60;&#x5C06;&#x6765;&#x7684;&#x4E8B;&#x4E1A;&#x53D1;&#x5C55;&#x4E5F;&#x5F88;&#x6709;&#x597D;&#x5904;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x5404;&#x4F4D;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x89C1;&#x89E3;&#xFF0C;&#x6B22;&#x8FCE;&#x4E0D;&#x541D;&#x8D50;&#x6559;&#x3002;</p>
<div class="bd_ad_bottom"></div><br><div class="article-entry"><br><br>&#x8BD1;&#x6587;&#x94FE;&#x63A5;&#xFF1A;<a href="http://www.codeceo.com/article/5-error-programming-startup.html" target="_blank" rel="external">http://www.codeceo.com/article/5-error-programming-startup.html</a><br>&#x82F1;&#x6587;&#x539F;&#x6587;&#xFF1A;<a href="http://omniref.com/blog/blog/2015/03/04/five-things-i-knew-about-programming-before-i-did-a-startup/" target="_blank" rel="external">Five Things I Knew About Programming Before I Did a Startup</a><br>&#x7FFB;&#x8BD1;&#x4F5C;&#x8005;&#xFF1A;<a href="http://www.codeceo.com/" target="_blank" rel="external">&#x7801;&#x519C;&#x7F51;</a> &#x2013; &#x5C0F;&#x5CF0;<br>[ <strong>&#x8F6C;&#x8F7D;&#x5FC5;&#x987B;&#x5728;&#x6B63;&#x6587;&#x4E2D;&#x6807;&#x6CE8;&#x5E76;&#x4FDD;&#x7559;&#x539F;&#x6587;&#x94FE;&#x63A5;&#x3001;&#x8BD1;&#x6587;&#x94FE;&#x63A5;&#x548C;&#x8BD1;&#x8005;&#x7B49;&#x4FE1;&#x606F;&#x3002;</strong>]<br><br></div>
      
      
      
        <div class="post-copyright">
<p><a href="http://www.ithome.me/archives/创业前需要知道的5个编程谬论/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年7月28日 16:07</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav" class="block-select">
  
    <a href="/archives/带你看看未来的可穿戴设备/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          带你看看未来的可穿戴设备
        
      </div>
    </a>
  
  
    <a href="/archives/Android开发最佳实践/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">Android开发最佳实践</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer" class="block-select">
  <div class="outer">
    <div id="footer-info">
      <div class="footer-left">&copy; 2015-2018
        Simon.Chen
      </div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {fancybox: false,mathjax: false,animate: false,isHome: false,isPost: true,isArchive: false,isTag: false,isCategory: false,open_in_new: true, CDN_PATH: '' }
</script>


    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/base.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>





  </div>
</body>
</html>
