<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>程序员也配吃10元的饭盒?</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#00796b">
  <meta name="msapplication-TileColor" content="#4E8071"/>
  
  
  
  
  <link rel="stylesheet" href="/css/style.css" type="text/css"> 
</head>


<body>

  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
  <header id="header" class="inner">
    <a href="/" class="profilepic">
      <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	</a>
	<p class="header-subtitle">分享有助于提升</p>
    <nav class="header-menu">
      <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li>
      </ul>
    </nav>
  </header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  <div class="intrude-less">
    <header id="header" class="inner">
      <a href="/" class="profilepic">
        <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	  </a>
	  <p class="header-subtitle">分享有助于提升</p>
	  <nav class="header-menu">
	    <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li><div class="clearfix"></div>
		</ul>
	  </nav>
	</header>				
  </div>
</nav>

      <div class="body-wrap">
<article id="post-程序员也配吃10元的饭盒" class="article article-type-post" itemscope itemprop="blogPost">

   
    
    <div class="article-meta">
      
<div class="article-date">
<span class="datetime-published-tag"> 2015-08-03 </span>
</div>


    </div>
    
    
  
  <div class="article-inner block-select">
  
    
    
      <header class="article-header">
        
           
  
    <h1 class="article-title" itemprop="name">
      程序员也配吃10元的饭盒?
    </h1>
  

        
      </header>
      
      <div class="article-info article-info-post">
        
	<div class="article-tag tagcloud block-select">
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/盒饭/">盒饭</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/程序员/">程序员</a></li></ul>
	</div>


        
             <div class="clearfix"></div>
        
      </div>
      
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <blockquote>
<p>&#x6587;&#x7AE0;&#x6765;&#x81EA;&#x7F51;&#x7EDC;&#xFF0C;&#x7248;&#x6743;&#x5F52;&#x539F;&#x4F5C;&#x8005;&#x6240;&#x6709;&#x3002;<br>&#x770B;&#x4E00;&#x6B21;&#x7B11;&#x4E00;&#x6B21;&#x7CFB;&#x5217;  </p>
</blockquote>
<p>&#x53C8;&#x662F;&#x4E00;&#x4E2A;&#x9633;&#x5149;&#x707F;&#x70C2;&#x7684;&#x4E2D;&#x5348;&#xFF0C;&#x770B;&#x4E86;&#x4E00;&#x4E0A;&#x5348;&#x7684;&#x62A5;&#x7EB8;&#xFF0C;&#x8336;&#x6C34;&#x4E5F;&#x987A;&#x5E26;&#x559D;&#x4E86;&#x4E0D;&#x5C11;&#xFF0C;&#x809A;&#x5B50;&#x65E9;&#x5DF2;&#x7ECF;&#x5495;&#x5495;&#x4F5C;&#x54CD;&#x4E86;&#xFF0C;&#x4ECA;&#x5929;&#x4E2D;&#x5348;&#x5403;&#x70B9;&#x4EC0;&#x4E48;&#x5462;&#xFF0C;&#x8C8C;&#x4F3C;&#x697C;&#x4E0B;&#x7684;&#x65B0;&#x5F00;&#x5F20;&#x7684;<strong>&#x76D2;&#x996D;</strong>&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x6765;&#x5230;&#x697C;&#x4E0B;&#x51C6;&#x5907;&#x4E70;&#x4E0A;&#x4E00;&#x76D2;&#x3002;</p>
<p>&#x83DC;&#x8272;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x4EF7;&#x683C;&#x6709;6&#x5143;&#xFF0C;8&#x5143;&#xFF0C;10&#x5143;&#xFF0C;12&#x5143;&#xFF0C;20&#x5143;&#x7684;&#xFF0C;&#x50CF;&#x54E5;&#x8FD9;&#x6837;&#x7684;&#x7CBE;&#x82F1;&#x7BA1;&#x7406;&#x4EBA;&#x624D;&#xFF0C;&#x600E;&#x4E48;&#x7740;&#x4E5F;&#x7684;&#x5403;&#x6700;&#x9AD8;&#x7EA7;&#x7684;&#x624D;&#x914D;&#x5408;&#x8EAB;&#x4EFD;&#xFF0C;&#x5C31;&#x5728;&#x6211;&#x51C6;&#x5907;&#x8D2D;&#x4E70;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x54CD;&#x4EAE;&#x7684;&#x58F0;&#x97F3;&#x54CD;&#x8D77;&#xFF0C;</p>
<p><strong>&#x201C;&#x8001;&#x677F;&#xFF0C;&#x7ED9;&#x6211;&#x4E00;&#x4EFD;10&#x5143;&#x7684;&#x76D2;&#x996D;&#x201D;&#xFF0C;</strong>  </p>
<p>&#x987A;&#x52BF;&#x6487;&#x4E86;&#x4E00;&#x773C;&#xFF0C;&#x4E00;&#x4E2A;&#x5C0F;&#x4F19;&#x5B50;&#xFF0C;&#x7709;&#x5F00;&#x773C;&#x7B11;&#x7684;&#x9760;&#x8FD1;&#x76D2;&#x996D;&#x94FA;&#xFF0C;&#x4ECA;&#x5929;&#x662F;1&#x53F7;&#xFF0C;&#x770B;&#x6837;&#x5B50;&#x662F;&#x53D1;&#x5DE5;&#x8D44;&#x4E86;&#x3002;&#x5C31;&#x5F53;&#x4ED6;&#x8D70;&#x8FD1;&#x65F6;&#xFF0C;&#x770B;&#x5230;&#x4E86;&#x6211;&#xFF0C;&#x521A;&#x624D;&#x7684;&#x6B22;&#x6109;&#x7684;&#x8868;&#x60C5;&#x77AC;&#x65F6;&#x9EEF;&#x6DE1;&#x4E0B;&#x53BB;&#xFF0C;&#x4ED6;&#x77E5;&#x9053;&#x6211;&#x8BA4;&#x51FA;&#x4E86;&#x4ED6;&#xFF0C;&#x9760;&#xFF0C;&#x6EE1;&#x5934;&#x767D;&#x91CC;&#x5E26;&#x4E00;&#x70B9;&#x9ED1;&#x7684;&#x5934;&#x53D1;&#xFF0C;&#x6C38;&#x8FDC;&#x6CA1;&#x7761;&#x9192;&#x7684;&#x773C;&#x795E;&#xFF0C;&#x4EE5;&#x53CA;&#x90A3;&#x51CC;&#x4E71;&#x7684;&#x80E1;&#x6E23;&#x5B50;&#xFF0C;&#x90FD;&#x51FA;&#x5356;&#x4E86;&#x4ED6;&#x7684;&#x8EAB;&#x4EFD;&#x3002;&#x6211;&#x7EE7;&#x7EED;&#x72E0;&#x72E0;&#x7684;&#x76EF;&#x7740;&#x4ED6;&#xFF0C;&#x4ED6;&#x8D8A;&#x53D1;&#x7684;&#x7F9E;&#x6127;&#x4E86;&#xFF0C;&#x6211;&#x7280;&#x5229;&#x7684;&#x773C;&#x795E;&#x6B63;&#x5728;&#x548C;&#x4ED6;&#x505A;&#x7740;&#x5E95;&#x5C42;&#x901A;&#x4FE1;&#xFF0C;&#x6211;&#x9ED8;&#x9ED8;&#x7684;&#x5411;&#x4ED6;&#x4F20;&#x8FBE;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#xFF0C;</p>
<p><strong>&#x201C;&#x4F60;&#xFF0C;&#x4E5F;&#x914D;&#x5403;10&#x5143;&#x7684;&#x76D2;&#x996D;?&#x201D;.</strong></p>
<a id="more"></a>
<p>&#x4ED6;&#x54C0;&#x601C;&#x7684;&#x773C;&#x795E;&#x4F3C;&#x4E4E;&#x5728;&#x7948;&#x6C42;&#x6211;&#x4E0D;&#x8981;&#x62C6;&#x7A7F;&#x4ED6;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x53EF;&#x60DC;&#xFF0C;&#x54E5;&#x8FD9;&#x4E48;&#x6709;&#x6B63;&#x4E49;&#x611F;&#x7684;&#x4EBA;&#xFF0C;&#x600E;&#x4E48;&#x80FD;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x653E;&#x5F03;&#x539F;&#x5219;&#xFF01;</p>
<p><strong>&#x201C;&#x4F60;&#x4E0D;&#x662F;&#x9694;&#x58C1;&#x516C;&#x53F8;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4E48;&#xFF1F;&#x201D;</strong></p>
<p>&#x5C31;&#x8FD9;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x4ED6;&#x6574;&#x4E2A;&#x4EBA;&#x4F3C;&#x4E4E;&#x5D29;&#x6E83;&#x4E0B;&#x53BB;&#xFF0C;&#x521A;&#x624D;&#x6B22;&#x6109;&#x7684;&#x8868;&#x60C5;&#x5F7B;&#x5E95;&#x53D8;&#x4E3A;&#x54ED;&#x4E27;&#xFF0C;&#x5468;&#x56F4;&#x7684;&#x5C0F;&#x644A;&#x8D29;&#x4EE5;&#x53CA;&#x8DEF;&#x4EBA;&#x7532;&#x4E59;&#x4E19;&#x4E01;&#xFF0C;&#x90FD;&#x7EB7;&#x7EB7;&#x6295;&#x6765;&#x4E86;&#x9119;&#x89C6;&#x7684;&#x773C;&#x5149;&#xFF0C;&#x4ED6;&#x761F;&#x9E21;&#x4E00;&#x6837;&#x7684;&#x53CC;&#x624B;&#x6293;&#x7740;&#x5934;&#x53D1;&#xFF0C;&#x75DB;&#x82E6;&#x7684;&#x8E72;&#x4E86;&#x4E0B;&#x53BB;&#x3002;</p>
<p>&#x5C31;&#x5728;&#x8FD9;&#x65F6;&#xFF0C;&#x4EBA;&#x7FA4;&#x4E2D;&#x7EC8;&#x4E8E;&#x6709;&#x4EBA;&#x5FCD;&#x4E0D;&#x4F4F;&#x4E86;&#xFF0C;&#x5927;&#x58F0;&#x5475;&#x9A82;&#x5230;&#xFF0C;</p>
<p><strong>&#x201C;&#x5478;,&#x7A0B;&#x5E8F;&#x5458;&#x4E5F;&#x6562;&#x5403;10&#x5143;&#x7684;&#x76D2;&#x996D;&#xFF0C;&#x771F;&#x4E0D;&#x8981;&#x8138;&#x201D;</strong>  </p>
<p>&#x4E00;&#x4F4D;&#x8001;&#x5927;&#x5A18;&#x597D;&#x5FC3;&#x7684;&#x63D0;&#x9192;&#x5230;&#xFF0C;  </p>
<p><strong>&#x201C;&#x5C0F;&#x4F19;&#x5B50;&#x554A;,&#x4F60;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x6323;&#x70B9;&#x94B1;&#x4E0D;&#x5BB9;&#x6613;&#x554A;&#xFF0C;&#x600E;&#x4E48;&#x5403;10&#x5143;&#x7684;&#x76D2;&#x996D;&#x554A;&#x201D;</strong>  </p>
<p>&#x4E00;&#x540D;&#x6253;&#x626E;&#x5996;&#x8273;&#x5165;&#x65F6;&#x7684;&#x59D1;&#x5A18;&#x8BF4;&#x5230;&#xFF0C;  </p>
<p><strong>&#x201C;&#x4EBA;&#x5BB6;&#x5F53;&#x5C0F;&#x59D0;&#x7684;&#x90FD;&#x624D;&#x5403;10&#x5143;&#xFF0C;&#x4F60;&#x4E5F;&#x6562;&#x8981;10&#x5143;&#x7684;&#xFF1F;&#x201D;</strong>  </p>
<p>&#x6211;&#x4E49;&#x6B63;&#x8A00;&#x8F9E;&#x7684;&#x7ED9;&#x4ED6;&#x8BF4;&#x5230;&#xFF0C;  </p>
<p><strong>&#x201C;&#x6211;&#x8BF4;&#x4E00;&#x53E5;&#x8BDD;&#x9876;&#x4F60;&#x5199;&#x4E00;&#x4E07;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x4E5F;&#x624D;&#x5403;20&#x5143;&#x7684;&#x76D2;&#x996D;&#xFF0C;&#x4F60;&#x7ADF;&#x6562;&#x5403;10&#x5143;&#x7684;&#x201D;</strong>  </p>
<p>&#x8001;&#x677F;&#x4E5F;&#x53D1;&#x8BDD;&#x4E86;&#xFF0C; </p>
<p><strong>&#x201C;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x554A;&#xFF0C;&#x592A;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x4E86;&#xFF0C;&#x4F60;&#x5403;6&#x5143;&#x7684;&#x5427;&#xFF0C;&#x4E0D;&#x7136;&#x4EBA;&#x5BB6;&#x77E5;&#x9053;&#x6211;&#x5356;&#x4E86;&#x4F60;10&#x5143;&#x7684;&#xFF0C;&#x6211;&#x8FD9;&#x751F;&#x610F;&#x5C31;&#x505A;&#x4E0D;&#x4E86;&#x554A;&#x201D;</strong> </p>
<p>&#x4ED6;&#x7EC8;&#x4E8E;&#x53D1;&#x51FA;&#x98A4;&#x6296;&#x7684;&#x58F0;&#x97F3;&#x8BF4;&#x5230;  </p>
<p><strong>&#x201C;&#x5BF9;&#x4E0D;&#x8D77;&#xFF0C;&#x6211;&#x521A;&#x624D;&#x8BF4;&#x9519;&#x4E86;&#xFF0C;&#x7ED9;&#x6211;&#x4E00;&#x4EFD;6&#x5143;&#x7684;&#x201D;&#x3002;</strong>  </p>
<p>&#x8FD9;&#x65F6;&#x4EBA;&#x7FA4;&#x4E2D;&#x7206;&#x53D1;&#x51FA;&#x6FC0;&#x70C8;&#x7684;&#x638C;&#x58F0;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x53C8;&#x4E00;&#x6B21;&#x575A;&#x6301;&#x539F;&#x5219;&#xFF0C;&#x6362;&#x6765;&#x7684;&#x8363;&#x8A89;&#x7684;&#x8D5E;&#x8D4F;</p>

      
      
      
        <div class="post-copyright">
<p><a href="http://www.ithome.me/archives/程序员也配吃10元的饭盒/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年8月12日 12:08</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav" class="block-select">
  
    <a href="/archives/android-material-design学习-一/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          android material design学习(一)
        
      </div>
    </a>
  
  
    <a href="/archives/转载-未雨绸缪：程序员保值的5个秘密/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">[转载]未雨绸缪：程序员保值的5个秘密</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer" class="block-select">
  <div class="outer">
    <div id="footer-info">
      <div class="footer-left">&copy; 2015-2018
        Simon.Chen
      </div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {fancybox: false,mathjax: false,animate: false,isHome: false,isPost: true,isArchive: false,isTag: false,isCategory: false,open_in_new: true, CDN_PATH: '' }
</script>


    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/base.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>





  </div>
</body>
</html>
