<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>人人网8000万美金收购视频网站56网</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#00796b">
  <meta name="msapplication-TileColor" content="#4E8071"/>
  
  
  
  
  <link rel="stylesheet" href="/css/style.css" type="text/css"> 
</head>


<body>

  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
  <header id="header" class="inner">
    <a href="/" class="profilepic">
      <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	</a>
	<p class="header-subtitle">分享有助于提升</p>
    <nav class="header-menu">
      <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li>
      </ul>
    </nav>
  </header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  <div class="intrude-less">
    <header id="header" class="inner">
      <a href="/" class="profilepic">
        <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	  </a>
	  <p class="header-subtitle">分享有助于提升</p>
	  <nav class="header-menu">
	    <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li><div class="clearfix"></div>
		</ul>
	  </nav>
	</header>				
  </div>
</nav>

      <div class="body-wrap">
<article id="post-人人网8000万美金收购视频网站56网" class="article article-type-post" itemscope itemprop="blogPost">

   
    
    <div class="article-meta">
      
<div class="article-date">
<span class="datetime-published-tag"> 2013-03-19 </span>
</div>


    </div>
    
    
  
  <div class="article-inner block-select">
  
    
    
      <header class="article-header">
        
           
  
    <h1 class="article-title" itemprop="name">
      人人网8000万美金收购视频网站56网
    </h1>
  

        
      </header>
      
      <div class="article-info article-info-post">
        

        
             <div class="clearfix"></div>
        
      </div>
      
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>9&#x6708;27&#x65E5;&#x6D88;&#x606F;&#xFF0C;&#x4EBA;&#x4EBA;&#x516C;&#x53F8;(NYSE&#xFF1A;RENN)&#x4ECA;&#x65E5;&#x5BF9;&#x5916;&#x5BA3;&#x5E03;&#x5C06;&#x4EE5;8000&#x4E07;&#x7F8E;&#x5143;&#x5168;&#x8D44;&#x6536;&#x8D2D;&#x89C6;&#x9891;&#x5206;&#x4EAB;&#x7F51;&#x7AD9;56&#x7F51;(www.56.com)&#xFF0C;&#x6B64;&#x4EA4;&#x6613;&#x5C06;&#x5728;2011&#x5E74;&#x7B2C;&#x56DB;&#x5B63;&#x5EA6;&#x5185;&#x5B8C;&#x6210;&#x3002;&#x901A;&#x8FC7;&#x6B64;&#x6B21;&#x6536;&#x8D2D;&#xFF0C;56&#x7F51;&#x5C06;&#x6210;&#x4E3A;&#x4EBA;&#x4EBA;&#x516C;&#x53F8;&#x7684;&#x5168;&#x8D44;&#x5B50;&#x516C;&#x53F8;&#xFF0C; 56&#x7F51;&#x8054;&#x5408;&#x521B;&#x59CB;&#x4EBA;&#x517C;&#x9996;&#x5E2D;&#x6267;&#x884C;&#x5B98;&#x5468;&#x5A1F;&#x4E5F;&#x5C06;&#x52A0;&#x5165;&#x4EBA;&#x4EBA;&#x516C;&#x53F8;&#x7BA1;&#x7406;&#x5C42;&#x62C5;&#x4EFB;&#x526F;&#x603B;&#x88C1;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4EBA;&#x4EBA;&#x516C;&#x53F8;&#x7EBD;&#x4EA4;&#x6240;&#x4E0A;&#x5E02;&#x4EE5;&#x6765;&#xFF0C;&#x9996;&#x6B21;&#x91CD;&#x5927;&#x6218;&#x7565;&#x6536;&#x8D2D;&#x3002;</p>
<p>56&#x7F51;&#x521B;&#x529E;&#x4E8E;2005&#x5E74;&#xFF0C;&#x662F;&#x4E2D;&#x56FD;&#x9886;&#x5148;&#x7684;&#x89C6;&#x9891;&#x5206;&#x4EAB;&#x7F51;&#x7AD9;&#xFF0C;&#x4E3A;&#x7F51;&#x6C11;&#x63D0;&#x4F9B;&#x89C6;&#x9891;&#x7684;&#x4E0A;&#x4F20;&#x3001;&#x5B58;&#x50A8;&#x548C;&#x5206;&#x4EAB;&#x670D;&#x52A1;&#x3002;&#x8BE5;&#x7F51;&#x7AD9;&#x4E0A;&#x5927;&#x90E8;&#x5206;&#x7684;&#x89C6;&#x9891;&#x90FD;&#x662F;&#x7531;&#x4E00;&#x4E9B;&#x8349;&#x6839;&#x8868;&#x6F14;&#x8005;&#x3001;&#x4E1A;&#x4F59;&#x89C6;&#x9891;&#x56E2;&#x4F53;&#x6216;&#x89C6;&#x9891;&#x7231;&#x597D;&#x8005;&#x6240;&#x539F;&#x521B;&#xFF0C;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x7535;&#x8111;&#x6216;&#x8005;&#x5404;&#x79CD;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x521B;&#x9020;&#x548C;&#x5206;&#x4EAB;&#x5F88;&#x591A;&#x7CBE;&#x5F69;&#x7684;&#x89C6;&#x9891;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x201C;&#x4E92;&#x8054;&#x7F51;&#x7528;&#x6237;&#x5728;&#x793E;&#x4EA4;&#x7F51;&#x7AD9;&#x4E0A;&#x6C9F;&#x901A;&#x548C;&#x5206;&#x4EAB;&#x7684;&#x9700;&#x6C42;&#x5DF2;&#x7ECF;&#x4E0D;&#x518D;&#x4EC5;&#x4EC5;&#x5C40;&#x9650;&#x4E8E;&#x6587;&#x5B57;&#x548C;&#x56FE;&#x7247;&#x4E86;&#xFF0C;&#x7528;&#x6237;&#x8D8A;&#x6765;&#x8D8A;&#x559C;&#x6B22;&#x5206;&#x4EAB;&#x81EA;&#x5DF1;&#x539F;&#x521B;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x539F;&#x521B;&#x89C6;&#x9891;&#x4E0E;&#x597D;&#x53CB;&#x8FDB;&#x884C;&#x6C9F;&#x901A;&#x3002;&#x5BF9;56&#x7F51;&#x7684;&#x6536;&#x8D2D;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4EBA;&#x4EBA;&#x7684;&#x7528;&#x6237;&#x66F4;&#x52A0;&#x65B9;&#x4FBF;&#x7684;&#x5728;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x4E0A;&#x901A;&#x8FC7;&#x89C6;&#x9891;&#x8BB0;&#x5F55;&#x548C;&#x5206;&#x4EAB;&#x4ED6;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x201D; &#x4EBA;&#x4EBA;&#x516C;&#x53F8;&#x8463;&#x4E8B;&#x957F;&#x517C;&#x9996;&#x5E2D;&#x6267;&#x884C;&#x5B98;&#x9648;&#x4E00;&#x821F;&#x5148;&#x751F;&#x8868;&#x793A;&#xFF0C;&#x201C;&#x76F8;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x4EE5;&#x8D2D;&#x4E70;&#x4E13;&#x4E1A;&#x5185;&#x5BB9;&#x4E3A;&#x4E3B;&#x7684;&#x89C6;&#x9891;&#x7F51;&#x7AD9;&#x6765;&#x8BF4;&#xFF0C;56&#x7F51;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x90FD;&#x5728;&#x52AA;&#x529B;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x539F;&#x521B;&#x89C6;&#x9891;&#x5206;&#x4EAB;&#x670D;&#x52A1;&#xFF0C;&#x5E76;&#x4E14;&#x62E5;&#x6709;&#x4E00;&#x5927;&#x6279;&#x70ED;&#x8877;&#x4E8E;&#x521B;&#x4F5C;&#x539F;&#x521B;&#x89C6;&#x9891;&#x7684;&#x7528;&#x6237;&#x3002;&#x6536;&#x8D2D;&#x5B8C;&#x6210;&#x540E;&#xFF0C;56&#x7F51;&#x548C;&#x4EBA;&#x4EBA;&#x7F51;&#x4E4B;&#x95F4;&#x5C06;&#x8FDB;&#x884C;&#x6DF1;&#x5165;&#x5BC6;&#x5207;&#x7684;&#x5408;&#x4F5C;&#xFF0C;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x6EE1;&#x8DB3;&#x6211;&#x4EEC;&#x7528;&#x6237;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5E76;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;&#x7684;56&#x7F51;&#x548C;&#x4EBA;&#x4EBA;&#x7F51;&#x7528;&#x6237;&#x6D3B;&#x8DC3;&#x5EA6;&#x548C;&#x7F51;&#x7AD9;&#x6D41;&#x91CF;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x5BA2;&#x6237;&#x63D0;&#x4F9B;&#x66F4;&#x4E30;&#x5BCC;&#x7684;&#x5E7F;&#x544A;&#x5F62;&#x5F0F;&#x3002;&#x201D;</p>
<p>56&#x7F51;&#x8054;&#x5408;&#x521B;&#x59CB;&#x4EBA;&#x517C;&#x9996;&#x5E2D;&#x6267;&#x884C;&#x5B98;&#x5468;&#x5A1F;&#x8868;&#x793A;&#xFF1A;&#x201C;&#x6211;&#x4EEC;&#x5F88;&#x9AD8;&#x5174;&#x80FD;&#x6210;&#x4E3A;&#x4EBA;&#x4EBA;&#x516C;&#x53F8;&#x5927;&#x5BB6;&#x5EAD;&#x7684;&#x4E00;&#x4F4D;&#x6210;&#x5458;&#x3002;&#x4EBA;&#x4EBA;&#x5F3A;&#x5927;&#x7684;&#x7528;&#x6237;&#x57FA;&#x7840;&#x4EE5;&#x53CA;&#x4EBA;&#x4EBA;&#x5728;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x3001;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x548C;&#x793E;&#x4EA4;&#x5316;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x7B49;&#x65B9;&#x9762;&#x7684;&#x6210;&#x529F;&#x7ECF;&#x9A8C;&#x548C;&#x4E30;&#x5BCC;&#x8D44;&#x6E90;&#xFF0C;&#x53EF;&#x4EE5;&#x7ED9;56&#x7F51;&#x5F88;&#x591A;&#x652F;&#x6301;&#xFF0C;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x8FDB;&#x4E00;&#x6B65;&#x52A0;&#x5F3A;&#x5BF9;&#x7528;&#x6237;&#x7684;&#x5438;&#x5F15;&#x529B;&#x3002;&#x201D;</p>
<p>&#x5728;&#x6B64;&#x6B21;&#x6536;&#x8D2D;&#x4E2D;&#xFF0C;&#x6295;&#x8D44;&#x94F6;&#x884C;&#x534E;&#x5174;&#x8D44;&#x672C;&#x62C5;&#x4EFB;&#x4E86;56&#x7F51;&#x7684;&#x72EC;&#x5BB6;&#x8D22;&#x52A1;&#x987E;&#x95EE;&#x3002; &#x534E;&#x5174;&#x8D44;&#x672C;&#x4E13;&#x6CE8;&#x4E8E;&#x4E3A;&#x4E2D;&#x56FD;&#x9AD8;&#x901F;&#x6210;&#x957F;&#x521B;&#x4E1A;&#x578B;&#x4F01;&#x4E1A;&#x63D0;&#x4F9B;&#x5404;&#x9879;&#x8D22;&#x52A1;&#x987E;&#x95EE;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://roll.sohu.com/20110927/n320636248.shtml" target="_blank" rel="external">http://roll.sohu.com/20110927/n320636248.shtml</a></p>

      
      
      
        <div class="post-copyright">
<p><a href="http://www.ithome.me/archives/人人网8000万美金收购视频网站56网/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年7月28日 16:07</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav" class="block-select">
  
    <a href="/archives/eclipse4-2安装ADT插件时报错/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          eclipse4.2安装ADT插件时报错
        
      </div>
    </a>
  
  
    <a href="/archives/调用android系统自带图标（转载）/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">调用android系统自带图标（转载）</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer" class="block-select">
  <div class="outer">
    <div id="footer-info">
      <div class="footer-left">&copy; 2015-2018
        Simon.Chen
      </div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {fancybox: false,mathjax: false,animate: false,isHome: false,isPost: true,isArchive: false,isTag: false,isCategory: false,open_in_new: true, CDN_PATH: '' }
</script>


    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/base.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>





  </div>
</body>
</html>
