<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>[转]上有政策，下有对策——如何继续下载VeryCD资源 | IT驿站</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#4f6b79">
  <meta name="msapplication-TileColor" content="#4f6b79"/>
  
  
  <meta name="description" content="VeryCD&amp;#x6B7B;&amp;#x6389;&amp;#x5DF2;&amp;#x7ECF;&amp;#x6709;&amp;#x4E00;&amp;#x6BB5;&amp;#x65F6;&amp;#x95F4;&amp;#x4E86;&amp;#xFF0C;&amp;#x4E0D;&amp;#x5C11;zasver&amp;#x90FD;&amp;#x8868;&amp;#x793A;&amp;#x9057;&amp;#x61BE;&amp;#x3002;&amp;#x6211;&amp;#x66FE;&amp;#x7ECF;&amp;#x4E5F;&amp;#x6">
<meta property="og:type" content="article">
<meta property="og:title" content="[转]上有政策，下有对策——如何继续下载VeryCD资源">
<meta property="og:url" content="http://chensiming.me/archives/转-上有政策，下有对策——如何继续下载VeryCD资源/index.html">
<meta property="og:site_name" content="IT驿站">
<meta property="og:description" content="VeryCD&amp;#x6B7B;&amp;#x6389;&amp;#x5DF2;&amp;#x7ECF;&amp;#x6709;&amp;#x4E00;&amp;#x6BB5;&amp;#x65F6;&amp;#x95F4;&amp;#x4E86;&amp;#xFF0C;&amp;#x4E0D;&amp;#x5C11;zasver&amp;#x90FD;&amp;#x8868;&amp;#x793A;&amp;#x9057;&amp;#x61BE;&amp;#x3002;&amp;#x6211;&amp;#x66FE;&amp;#x7ECF;&amp;#x4E5F;&amp;#x6">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2015-07-28T08:33:49.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="[转]上有政策，下有对策——如何继续下载VeryCD资源">
<meta name="twitter:description" content="VeryCD&amp;#x6B7B;&amp;#x6389;&amp;#x5DF2;&amp;#x7ECF;&amp;#x6709;&amp;#x4E00;&amp;#x6BB5;&amp;#x65F6;&amp;#x95F4;&amp;#x4E86;&amp;#xFF0C;&amp;#x4E0D;&amp;#x5C11;zasver&amp;#x90FD;&amp;#x8868;&amp;#x793A;&amp;#x9057;&amp;#x61BE;&amp;#x3002;&amp;#x6211;&amp;#x66FE;&amp;#x7ECF;&amp;#x4E5F;&amp;#x6">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link rel="stylesheet" href="/css/style.css" type="text/css"> 
  

</head>

<body>
  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			
		</a>
		
		<p class="header-subtitle">分享有助于提升</p>
		
        <nav class="header-menu">
            <ul>
                
                    <li><a href="/">主页</a></li>
                
                    <li><a href="/archives">所有文章</a></li>
                
                    <li><a href="/categories/移动开发">移动开发</a></li>
                
                    <li><a href="/about-me">关于我</a></li>
                
            </ul>
        </nav>
	</header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
	<div class="intrude-less">
		<header id="header" class="inner">
			<a href="/" class="profilepic">
                
			        <img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			    
			</a>
			<!-- <hgroup>
			  <h1 class="header-author">Simon.Chen</h1>
			</hgroup>-->
			
			<p class="header-subtitle">分享有助于提升</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
					<li><a href="/categories/移动开发">移动开发</a></li>
		        
					<li><a href="/about-me">关于我</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap"><article id="post-转-上有政策，下有对策——如何继续下载VeryCD资源" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/archives/转-上有政策，下有对策——如何继续下载VeryCD资源/" class="article-date">
<span class="datetime-published-tag"> 2013-10-16 </span>
</a>

    </div>
  
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      [转]上有政策，下有对策——如何继续下载VeryCD资源
    </h1>
  

      </header>
      
      <div class="article-info article-info-post">
        <!-- 
	<div class="article-category tagcloud">
	<a class="article-category-link" href="/categories/转载/">转载</a>
	</div>

 -->
        
        <div class="clearfix"></div>
      </div>
      
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>VeryCD&#x6B7B;&#x6389;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x4E0D;&#x5C11;zasver&#x90FD;&#x8868;&#x793A;&#x9057;&#x61BE;&#x3002;&#x6211;&#x66FE;&#x7ECF;&#x4E5F;&#x611F;&#x89C9;&#x5F88;&#x9057;&#x61BE;&#xFF0C;&#x867D;&#x7136;&#x8BF4;VeryCD&#x6162;&#xFF0C;&#x4F46;&#x662F;&#x4E0A;&#x9762;&#x7684;&#x65E0;&#x635F;&#x8D44;&#x6E90;&#x5728;&#x8D28;&#x548C;&#x91CF;&#x4E0A;&#x90FD;&#x662F;&#x6570;&#x4E00;&#x6570;&#x4E8C;&#x7684;&#x3002;&#x6211;&#x521A;&#x5F00;&#x59CB;&#x542C;&#x65E0;&#x635F;&#x97F3;&#x4E50;&#x65F6;&#x5C31;&#x662F;&#x5728;VeryCD&#x4E0A;&#x627E;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x4E5F;&#x5C31;&#x5927;&#x6982;&#x4E00;&#x5E74;&#x524D;&#x5427;&#x3002;&#x90A3;&#x65F6;&#x5019;VeryCD&#x867D;&#x7136;&#x5728;&#x7535;&#x5F71;&#x65B9;&#x9762;&#x65E9;&#x5C31;&#x5E9F;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x65E0;&#x635F;&#x97F3;&#x4E50;&#x8D44;&#x6E90;&#x8FD8;&#x53EF;&#x4EE5;&#x4E0B;&#x7684;&#xFF0C;&#x597D;&#x666F;&#x4E0D;&#x957F;&#xFF0C;&#x4E0D;&#x591A;&#x4E45;&#x5C31;&#x5F00;&#x59CB;&#x5168;&#x9762;&#x62A5;&#x5E9F;&#x4E86;&#xFF0C;&#x8FDE;&#x7535;&#x5B50;&#x4E66;&#x4E5F;&#x6CA1;&#x4E86;&#x3002;<br>&#x6709;&#x70B9;&#x7F57;&#x55E6;&#xFF0C;&#x6B63;&#x5728;&#x8FDB;&#x5165;&#x6B63;&#x9898;&#x3002;<br>VeryCD&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#x79EF;&#x7D2F;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x600E;&#x4E48;&#x8BF4;&#x6CA1;&#x5C31;&#x6CA1;&#x4E86;&#xFF1F;&#x5176;&#x5B9E;&#x8FD8;&#x5728;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;VeryCD&#x5C06;&#x8FDE;&#x63A5;&#x5728;&#x5176;&#x5B98;&#x7F51;&#x5C4F;&#x853D;&#x4E86;&#x800C;&#x5DF2;&#xFF0C;&#x53EA;&#x8981;&#x6709;ed2k&#x94FE;&#x63A5;&#xFF0C;&#x8D44;&#x6E90;&#x7167;&#x6837;&#x4E0B;&#x3002;&#x5982;&#x4F55;&#x83B7;&#x5F97;&#x8D44;&#x6E90;&#x7684;ed2k&#x94FE;&#x63A5;&#x5C31;&#x662F;&#x6838;&#x5FC3;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x6211;&#x5728;&#x7F51;&#x4E0A;&#x4E00;&#x901A;&#x641C;&#x7D22;&#xFF0C;&#x603B;&#x7ED3;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x81EA;&#x5DF1;&#x4E00;&#x76F4;&#x90FD;&#x5728;&#x7528;&#xFF0C;&#x8FD1;&#x671F;&#x5E94;&#x8BE5;&#x4E5F;&#x8FD8;&#x80FD;&#x7528;&#x3002;<br><strong>1&#x3001;&#x641C;&#x7D22;&#x5668;&#xFF1A;</strong><br>&#x5E38;&#x7528;&#x7684;&#x641C;&#x7D22;&#x5668;&#x6709;&#x4E24;&#x79CD;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x5B98;&#x65B9;&#x7684;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x5C31;&#x662F;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;&#x79CD;&#x5B50;&#x641C;&#x7D22;&#x795E;&#x5668;&#xFF0C;&#x53EB;&#x505A;P2P Searcher&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x633A;&#x597D;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x88AB;&#x67D0;&#x4E9B;&#x4EBA;&#x7528;&#x81ED;&#x4E86;&#xFF08;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x767E;&#x5EA6;&#x4E00;&#x4E0B;&#xFF0C;&#x63D0;&#x793A;&#xFF0C;&#x8DDF;&#x65E5;&#x672C;&#x6709;&#x5173;&#xFF09;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x7528;&#x79CD;&#x5B50;&#x641C;&#x7D22;&#x5668;&#x641C;&#x5230;&#x7684;&#x8D44;&#x6E90;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x662F;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x6E90;&#x7684;&#xFF0C;&#x66F4;&#x6709;&#x751A;&#x8005;&#x8FDE;&#x7528;&#x8FC5;&#x96F7;&#x79BB;&#x7EBF;&#x90FD;&#x4E0D;&#x80FD;&#x4E0B;&#x2026;&#x2026;&#x4F46;&#x4E0D;&#x53EF;&#x5426;&#x8BA4;&#xFF0C;&#x65B9;&#x4FBF;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#xFF0C;&#x79CD;&#x5B50;&#x641C;&#x7D22;&#x795E;&#x5668;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x8D44;&#x6E90;&#x4ECB;&#x7ECD;&#x4E4B;&#x7C7B;&#x7684;&#x4E86;&#xFF0C;&#x4F60;&#x8981;&#x6E05;&#x695A;&#x81EA;&#x5DF1;&#x8981;&#x641C;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x624D;&#x884C;.<br><strong>2&#x3001;SimpleCD</strong><br>SimpleCD&#x662F;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;VeryCD&#x7684;&#x8D44;&#x6E90;&#x5206;&#x4EAB;&#x7AD9;&#xFF0C;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x6807;&#x699C;&#x662F;VeryCD&#x7684;&#x7CBE;&#x7B80;&#x7248;&#x955C;&#x50CF;&#xFF0C;&#x4E0D;&#x8FC7;&#x73B0;&#x5728;&#x6539;&#x7248;&#x4E4B;&#x540E;&#x6CA1;&#x8FD9;&#x4E48;&#x8BF4;&#x4E86;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x65E0;&#x635F;&#x8D44;&#x6E90;&#x57FA;&#x672C;&#x4E0A;&#x8DDF;VeryCD&#x6709;&#x7684;&#x4E00;&#x62FC;&#xFF0C;&#x5F88;&#x591A;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#x8BE5;&#x7AD9;&#x5E7F;&#x544A;&#x591A;&#x4E00;&#x70B9;&#xFF0C;&#x800C;&#x4E14;&#x6BD4;VeryCD&#x7C97;&#x7CD9;&#x3002;<br>&#x5730;&#x5740;&#x662F;&#xFF1A;<a href="http://www.simplecd.me/" target="_blank" rel="external">http://www.simplecd.me/</a><br><strong>3&#x3001;verycd&#x7F51;&#x5740;&#x7684;verycd&#x548C;.com&#x4E2D;&#x95F4;&#x52A0;&#x4E2A;.gdajie &#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E0B;&#x8F7D;&#x94FE;&#x63A5;</strong><br>&#x4F8B;&#x5982;&#xFF1A;<a href="http://www.verycd.com/topics/2846318/" target="_blank" rel="external">http://www.verycd.com/topics/2846318/</a><br>&#x53EA;&#x8981;&#x5C06;&#x7F51;&#x5740;&#x6539;&#x6210;&#xFF1A;<a href="http://www.verycd.gdajie.com/topics/2846318/" target="_blank" rel="external">http://www.verycd.gdajie.com/topics/2846318/</a><br>&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x770B;&#x5230;ed2k&#x7684;&#x94FE;&#x63A5;&#x4E86;<br><strong>4&#x3001;VeryCd Fetch&#x6D4F;&#x89C8;&#x5668;&#x6269;&#x5C55;</strong><br>&#x8FD9;&#x662F;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x7528;&#x8FC7;&#x7684;&#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x76F4;&#x63A5;&#x7834;&#x89E3;VeryCD&#x7F51;&#x7AD9;&#x4E0A;&#x7684;&#x5C4F;&#x853D;&#x3002;&#x4F60;&#x53EA;&#x8981;&#x76F4;&#x63A5;&#x5728;VeryCD&#x7F51;&#x7AD9;&#x4E0A;&#x641C;&#x5230;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x6253;&#x5F00;&#x7F51;&#x9875;&#xFF0C;&#x90A3;&#x53E5;&#x201C;<span style="color: #333333;">&#x8BE5;&#x5185;&#x5BB9;&#x5C1A;&#x672A;&#x63D0;&#x4F9B;&#x6743;&#x5229;&#x8BC1;&#x660E;&#xFF0C;&#x65E0;&#x6CD5;&#x63D0;&#x4F9B;&#x4E0B;&#x8F7D;&#x3002;</span> &#x201D;&#x7684;&#x8BDD;&#x9A6C;&#x4E0A;&#x53D8;&#x56DE;&#x539F;&#x6765;&#x7684;&#x4E0B;&#x8F7D;&#x94FE;&#x63A5;&#x3002;<br>&#x8FD9;&#x662F;&#x8BE5;&#x6269;&#x5C55;&#x7684;&#x5B98;&#x65B9;&#x5730;&#x5740;&#xFF1A;<a href="http://verycdfetch.duapp.com/" target="_blank" rel="external">http://verycdfetch.duapp.com/</a><br>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x60F3;&#x88C5;&#x6269;&#x5C55;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x5B98;&#x7F51;&#x4E0A;&#x8F93;&#x5165;&#x4F60;&#x8981;&#x7684;&#x8D44;&#x6E90;&#x6240;&#x5728;&#x7684;VeryCD&#x9875;&#x9762;&#x7F51;&#x5740;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#xFF0C;&#x540C;&#x6837;&#x80FD;&#x663E;&#x793A;&#x4E0B;&#x8F7D;&#x94FE;&#x63A5;&#x3002;<br>&#x6269;&#x5C55;&#x652F;&#x6301;Chrome&#x3001;&#x706B;&#x72D0;&#x3001;Opera&#x3001;Safari&#x7B49;&#x6D4F;&#x89C8;&#x5668;&#x3002;&#x4E00;&#x70B9;&#x5C0F;&#x63D0;&#x793A;&#xFF0C;&#x6211;&#x7528;&#x7684;&#x662F;Chrome&#xFF0C;&#x8FD9;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#x4E0D;&#x652F;&#x6301;&#x5B89;&#x88C5;&#x975E;&#x5E94;&#x7528;&#x5546;&#x5E97;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x6269;&#x5C55;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x70B9;&#x5F00;&#x201C;&#x5DE5;&#x5177;&#x2013;&gt;&#x6269;&#x5C55;&#x7A0B;&#x5E8F;&#x201D;&#xFF0C;&#x5C06;&#x4F60;&#x4E0B;&#x8F7D;&#x7684;&#x6269;&#x5C55;&#x6587;&#x4EF6;&#xFF08;crx&#x540E;&#x7F00;&#x7684;&#x6587;&#x4EF6;&#xFF09;&#x62D6;&#x5165;&#x6D4F;&#x89C8;&#x5668;&#x9875;&#x9762;&#x5373;&#x53EF;&#x3002;&#xFF08;&#x9644;&#x4E0A;Chrome&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x8BF7;&#x81EA;&#x884C;&#x5230;&#x5B98;&#x7F51;&#x5730;&#x5740;&#x4E0B;&#x8F7D;&#xFF09;<br><strong>&#x5F53;&#x7136;&#xFF0C;&#x4E07;&#x80FD;&#x7684;&#x767E;&#x5EA6;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x4E5F;&#x80FD;&#x4ECE;&#x4E00;&#x4E9B;&#x8BBA;&#x575B;&#x3001;&#x8D34;&#x5427;&#x7B49;&#x5730;&#x65B9;&#x641C;&#x5230;&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF0C;&#x4F46;&#x662F;&#x6548;&#x7387;&#x6BD4;&#x8F83;&#x4F4E;&#x3002;</strong><br><strong><br>8&#x6708;14&#x65E5;&#x66F4;&#x65B0;&#xFF1A;</strong><br><strong>&#x4E3A;&#x4F20;&#x64AD;&#x4E0B;&#x8F7D;&#x6280;&#x672F;&#x800C;&#x594B;&#x6597;&#xFF01;</strong><br><strong>1&#x3001;&#x611F;&#x8C22;17&#x697C;&#x7AE5;&#x978B;&#x63D0;&#x9192;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;&#x6CE8;&#x518C;verycd&#x5E10;&#x53F7;&#xFF0C;&#x5728;verycd&#x4E0A;&#x5C3D;&#x91CF;&#x591A;&#x7684;&#x7559;&#x70B9;&#x53E3;&#x6C34;&#xFF0C;&#x51D1;&#x591F;100&#x79EF;&#x5206;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;&#x8D44;&#x6E90;&#x9875;&#x9762;&#x770B;&#x5230;&#x8D44;&#x6E90;&#x7684;&#x4E0B;&#x8F7D;&#x94FE;&#x63A5;&#x4E86;</strong><br><strong>2&#x3001;&#x627E;&#x5230;ed2k&#x8FDE;&#x63A5;&#x4E4B;&#x540E;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x4E0B;&#x8F7D;&#x3002;&#x4E0D;&#x5C11;&#x4EBA;&#x62B1;&#x6028;&#x6CA1;&#x901F;&#x5EA6;&#xFF0C;&#x786E;&#x5B9E;&#x5982;&#x6B64;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6709;&#x8FC5;&#x96F7;&#x4F1A;&#x5458;&#x5C31;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FD8;&#x662F;&#x633A;&#x597D;&#x7528;&#x7684;&#x3002;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x8981;&#x82B1;&#x94B1;&#x3002;</strong><br><strong>&#x73B0;&#x5728;&#x7ED9;&#x5927;&#x5BB6;&#x4ECB;&#x7ECD;&#x4E00;&#x4E2A;&#x4E0D;&#x7528;&#x82B1;&#x94B1;&#x800C;&#x80FD;&#x7528;&#x8FC5;&#x96F7;&#x79BB;&#x7EBF;&#x529F;&#x80FD;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</strong><br><strong>&#x8FC5;&#x96F7;&#x4E4B;&#x524D;&#x63A8;&#x51FA;&#x4E86;&#x514D;&#x8D39;&#x79BB;&#x7EBF;&#x7A7A;&#x95F4;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x6CE8;&#x518C;&#x4E86;&#x4E00;&#x4E2A;&#x8FC5;&#x96F7;&#x5E10;&#x53F7;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x514D;&#x8D39;&#x7533;&#x8BF7;&#x4E00;&#x4E2A;8G&#x7684;&#x514D;&#x8D39;&#x79BB;&#x7EBF;&#x7A7A;&#x95F4;&#xFF0C;&#x4E3A;&#x671F;6&#x4E2A;&#x6708;&#x3002;&#x4F46;&#x662F;&#x4E0B;&#x8F7D;&#x7684;&#x65F6;&#x5019;&#x53EA;&#x80FD;&#x80FD;&#x79BB;&#x7EBF;&#x4E0B;&#x8F7D;&#x5230;&#x8FD9;&#x4E2A;8G&#x7684;&#x7A7A;&#x95F4;&#x91CC;&#x9762;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x6FC0;&#x6D3B;&#x8FC5;&#x96F7;&#x8F6F;&#x4EF6;&#x91CC;&#x9762;&#x7684;&#x201C;&#x79BB;&#x7EBF;&#x52A0;&#x901F;&#x529F;&#x80FD;&#x201D;&#xFF0C;&#x8981;&#x4EAB;&#x53D7;&#x8FD9;&#x4E2A;&#x52A0;&#x901F;&#x529F;&#x80FD;&#xFF0C;&#x8FD8;&#x5F97;&#x5F00;&#x4F1A;&#x5458;&#x3002;&#x8BF4;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x8FC5;&#x96F7;&#x7ED9;&#x7684;&#x8FD9;&#x4E2A;&#x514D;&#x8D39;&#x5348;&#x9910;&#x6839;&#x672C;&#x4E0D;&#x80FD;&#x5403;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4ED6;&#x65E2;&#x7136;&#x7ED9;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5F97;&#x60F3;&#x529E;&#x6CD5;&#x5403;&#xFF0C;&#x6240;&#x4EE5;&#x65B9;&#x6CD5;&#x6765;&#x4E86;&#x3002;</strong><br><strong>&#x5DE5;&#x5177;&#xFF1A;chrome&#x6D4F;&#x89C8;&#x5668;&#x3001;&#x8FC5;&#x96F7;&#x79BB;&#x7EBF;&#x52A9;&#x624B;&#x63D2;&#x4EF6;&#x3001;IDM&#xFF08;Internet Download Manager,&#x4E00;&#x6B3E;&#x591A;&#x7EBF;&#x7A0B;&#x4E0B;&#x8F7D;&#x8F6F;&#x4EF6;&#xFF09;</strong><br>1&#xFF09;&#x6CE8;&#x518C;&#x8FC5;&#x96F7;&#x5E10;&#x53F7;&#xFF0C;&#x767B;&#x5F55;<a href="http://lixian.vip.xunlei.com/task.html" target="_blank" rel="external">http://lixian.vip.xunlei.com/task.html</a>&#xFF0C;&#x6309;&#x63D0;&#x793A;&#x7533;&#x8BF7;&#x514D;&#x8D39;&#x79BB;&#x7EBF;&#x7A7A;&#x95F4;&#xFF0C;&#x627E;&#x5230;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x7528;&#x8FC5;&#x96F7;&#x4E0B;&#x8F7D;&#xFF0C;&#x767B;&#x5F55;&#x5E10;&#x6237;&#xFF0C;&#x5E76;&#x70B9;&#x51FB;&#x201C;&#x79BB;&#x7EBF;&#x4E0B;&#x8F7D;&#x52A0;&#x901F;&#x201D;&#xFF0C;&#x76F4;&#x81F3;&#x51FA;&#x73B0;&#x201C;&#x4EFB;&#x52A1;&#x5DF2;&#x5907;&#x4EFD;&#x5230;&#x4E91;&#x7AEF;&#x7A7A;&#x95F4;&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x63D0;&#x793A;&#x3002;<br>2&#xFF09;&#x5B89;&#x88C5;IDM&#xFF0C;&#x8F6F;&#x4EF6;&#x662F;&#x6536;&#x8D39;&#x8F6F;&#x4EF6;&#xFF0C;&#x60F3;&#xD7;&#xD7;&#x7684;&#x81EA;&#x5DF1;&#x767E;&#x5EA6;&#x53BB;<br>3&#xFF09;&#x5728;chrome&#x7684;&#x5E94;&#x7528;&#x5546;&#x5E97;&#x641C;&#x7D22;&#x201C;&#x8FC5;&#x96F7;&#x79BB;&#x7EBF;&#x52A9;&#x624B;&#x201D;&#xFF0C;&#x5B89;&#x88C5;&#x63D2;&#x4EF6;<br>4&#xFF09;&#x7528;chrome&#x767B;&#x5F55;&#x8FC5;&#x96F7;&#x79BB;&#x7EBF;&#x7A7A;&#x95F4;&#xFF0C;&#x5728;&#x5217;&#x8868;&#x91CC;&#x770B;&#x5230;&#x4F60;&#x4E4B;&#x524D;&#x79BB;&#x7EBF;&#x4E0B;&#x8F7D;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x4F1A;&#x5728;&#x5DE5;&#x5177;&#x680F;&#x90A3;&#x91CC;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x201C;&#x6279;&#x91CF;&#x5BFC;&#x51FA;&#x201D;&#x7684;&#x6309;&#x94AE;&#xFF08;&#x6CA1;&#x6709;&#x88C5;&#x8FC5;&#x96F7;&#x79BB;&#x7EBF;&#x52A9;&#x624B;&#x662F;&#x6CA1;&#x6709;&#x7684;&#xFF09;&#xFF0C;&#x9009;&#x4E2D;&#x4F60;&#x8981;&#x4E0B;&#x7684;&#x90A3;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x7136;&#x540E;&#x70B9;&#x201C;&#x6279;&#x91CF;&#x5BFC;&#x51FA;&#x201D;&#xFF0C;&#x9009;&#x62E9;&#x201C;IDM&#x5BFC;&#x51FA;&#x201D;&#xFF0C;&#x5BFC;&#x51FA;&#x4E00;&#x4E2A;<span style="font-family: Tahoma,;">.ef2&#x683C;&#x5F0F;&#x7684;&#x6587;&#x4EF6;</span><br><span style="font-family: Tahoma,;">5&#xFF09;&#x6253;&#x5F00;IDM&#xFF0C;&#x6587;&#x4EF6;&#x2014;&#x5BFC;&#x5165;&#x2014;&#x4ECE;&#x201C;IDM&#x5BFC;&#x51FA;&#x6587;&#x4EF6;&#x201D;&#x5BFC;&#x5165;&#xFF0C;&#x9009;&#x62E9;&#x521A;&#x624D;&#x5BFC;&#x51FA;&#x7684;.ef2&#x683C;&#x5F0F;&#x6587;&#x4EF6;&#x3002;</span></p>
<p><span style="font-family: Tahoma, Microsoft Yahei, Simsun;"><span>&#x884C;&#x4E86;&#xFF0C;&#x5927;&#x529F;&#x544A;&#x6210;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x80FD;&#x8FBE;&#x5230;&#x6EE1;&#x901F;&#x4E0B;&#x8F7D;&#x7684;&#x3002;</span></span></p>
<p>&#x539F;&#x5E16;&#x5730;&#x5740;&#xFF1A;<a href="http://www.zasv.com/thread-1564000-1-1.html" target="_blank" rel="external">http://www.zasv.com/thread-1564000-1-1.html</a></p>

      
      
        <div class="post-copyright">
<p><a href="http://chensiming.me/archives/转-上有政策，下有对策——如何继续下载VeryCD资源/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年7月28日 16:07</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/archives/转-史上最强女程序员或将跳槽到顽皮狗-酷爱PS4/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          [转]史上最强女程序员或将跳槽到顽皮狗 酷爱PS4
        
      </div>
    </a>
  
  
    <a href="/archives/android-NDK官方下载地址/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">android NDK官方下载地址</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2017
            
                 Simon.Chen
            
    	</div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {
		fancybox: false,
		mathjax: false,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: true,
     CDN_PATH: '' 
	}
</script>




    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/common.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>







  </div>
</body>
</html>
