<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>[转]马化腾首度开腔回应“腾讯抄袭”质疑 | IT驿站</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#4f6b79">
  <meta name="msapplication-TileColor" content="#4f6b79"/>
  
  
  <meta name="description" content="&amp;#x6DF1;&amp;#x5733;&amp;#x65B0;&amp;#x95FB;&amp;#x7F51;&amp;#x5317;&amp;#x4EAC;3&amp;#x6708;3&amp;#x65E5;&amp;#x8BAF;&amp;#xFF08;&amp;#x7279;&amp;#x6D3E;&amp;#x8BB0;&amp;#x8005; &amp;#x738B;&amp;#x6D77;&amp;#x5A77;&amp;#xFF09;&amp;#x867D;&amp;#x7136;&amp;#x88AB;&amp;#x5A92;&amp;#x4F53;&amp;#x4E">
<meta name="keywords" content="转载">
<meta property="og:type" content="article">
<meta property="og:title" content="[转]马化腾首度开腔回应“腾讯抄袭”质疑">
<meta property="og:url" content="http://www.ithome.me/archives/转-马化腾首度开腔回应“腾讯抄袭”质疑/index.html">
<meta property="og:site_name" content="IT驿站">
<meta property="og:description" content="&amp;#x6DF1;&amp;#x5733;&amp;#x65B0;&amp;#x95FB;&amp;#x7F51;&amp;#x5317;&amp;#x4EAC;3&amp;#x6708;3&amp;#x65E5;&amp;#x8BAF;&amp;#xFF08;&amp;#x7279;&amp;#x6D3E;&amp;#x8BB0;&amp;#x8005; &amp;#x738B;&amp;#x6D77;&amp;#x5A77;&amp;#xFF09;&amp;#x867D;&amp;#x7136;&amp;#x88AB;&amp;#x5A92;&amp;#x4F53;&amp;#x4E">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2015-07-28T08:33:49.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="[转]马化腾首度开腔回应“腾讯抄袭”质疑">
<meta name="twitter:description" content="&amp;#x6DF1;&amp;#x5733;&amp;#x65B0;&amp;#x95FB;&amp;#x7F51;&amp;#x5317;&amp;#x4EAC;3&amp;#x6708;3&amp;#x65E5;&amp;#x8BAF;&amp;#xFF08;&amp;#x7279;&amp;#x6D3E;&amp;#x8BB0;&amp;#x8005; &amp;#x738B;&amp;#x6D77;&amp;#x5A77;&amp;#xFF09;&amp;#x867D;&amp;#x7136;&amp;#x88AB;&amp;#x5A92;&amp;#x4F53;&amp;#x4E">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link rel="stylesheet" href="/css/style.css" type="text/css"> 
  

</head>

<body>
  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			
		</a>
		
		<p class="header-subtitle">分享有助于提升</p>
		
        <nav class="header-menu">
            <ul>
                
                    <li><a href="/">主页</a></li>
                
                    <li><a href="/archives">所有文章</a></li>
                
                    <li><a href="/categories/移动开发">移动开发</a></li>
                
                    <li><a href="/about-me">关于我</a></li>
                
            </ul>
        </nav>
	</header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
	<div class="intrude-less">
		<header id="header" class="inner">
			<a href="/" class="profilepic">
                
			        <img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			    
			</a>
			<!-- <hgroup>
			  <h1 class="header-author">Simon.Chen</h1>
			</hgroup>-->
			
			<p class="header-subtitle">分享有助于提升</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
					<li><a href="/categories/移动开发">移动开发</a></li>
		        
					<li><a href="/about-me">关于我</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap"><article id="post-转-马化腾首度开腔回应“腾讯抄袭”质疑" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/archives/转-马化腾首度开腔回应“腾讯抄袭”质疑/" class="article-date">
<span class="datetime-published-tag"> 2013-03-04 </span>
</a>

    </div>
  
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      [转]马化腾首度开腔回应“腾讯抄袭”质疑
    </h1>
  

      </header>
      
      <div class="article-info article-info-post">
        <!-- 
	<div class="article-category tagcloud">
	<a class="article-category-link" href="/categories/杂谈/">杂谈</a>
	</div>

 -->
        
	<div class="article-tag tagcloud">
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/转载/">转载</a></li></ul>
	</div>

        <div class="clearfix"></div>
      </div>
      
    
    <div class="article-entry" itemprop="articleBody">
      
        <p><strong>&#x6DF1;&#x5733;&#x65B0;&#x95FB;&#x7F51;</strong>&#x5317;&#x4EAC;3&#x6708;3&#x65E5;&#x8BAF;&#xFF08;&#x7279;&#x6D3E;&#x8BB0;&#x8005; &#x738B;&#x6D77;&#x5A77;&#xFF09;&#x867D;&#x7136;&#x88AB;&#x5A92;&#x4F53;&#x4EB2;&#x5207;&#x79F0;&#x4E3A;&#x201C;&#x5C0F;&#x9A6C;&#x54E5;&#x201D;&#xFF0C;&#x9A6C;&#x5316;&#x817E;&#x5374;&#x7ECF;&#x5E38;&#x201C;&#x51B7;&#x5BF9;&#x201D;&#x5A92;&#x4F53;&#xFF0C;&#x4F46;&#x5F53;&#x4ED6;&#x4F5C;&#x4E3A;&#x65B0;&#x4EFB;&#x5168;&#x56FD;&#x4EBA;&#x5927;&#x4EE3;&#x8868;&#x51FA;&#x73B0;&#x5728;&#x4E24;&#x4F1A;&#x5E7F;&#x4E1C;&#x56E2;&#x4F4F;&#x5730;&#xFF0C;&#x4ECD;&#x7136;&#x5F15;&#x8D77;&#x4E0D;&#x61C8;&#x56F4;&#x5835;&#x3002;3&#x6708;3&#x65E5;&#xFF0C;&#x6DF1;&#x5733;&#x65B0;&#x95FB;&#x7F51;&#x8BB0;&#x8005;&#x4E13;&#x8BBF;&#x5230;&#x8FD9;&#x4F4D;&#x96BE;&#x8BBF;&#x7684;&#x201C;&#x5C0F;&#x9A6C;&#x54E5;&#x201D;&#xFF0C;&#x4ED6;&#x4E0D;&#x4EC5;&#x4E0E;&#x8BB0;&#x8005;&#x5206;&#x4EAB;&#x4E86;&#x5BF9;&#x4E2D;&#x56FD;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x4E1A;&#x73B0;&#x72B6;&#x548C;&#x672A;&#x6765;&#x53D1;&#x5C55;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x817E;&#x8BAF;&#x672A;&#x6765;&#x53D1;&#x5C55;&#x6218;&#x7565;&#xFF0C;&#x4EE5;&#x53CA;&#x4F5C;&#x4E3A;&#x5168;&#x56FD;&#x4EBA;&#x5927;&#x4EE3;&#x8868;&#x7684;&#x5C65;&#x804C;&#x8BA1;&#x5212;&#xFF0C;&#x8FD8;&#x9996;&#x5EA6;&#x56DE;&#x5E94;&#x4E86;&#x201C;&#x817E;&#x8BAF;&#x6284;&#x88AD;&#x201D;&#x7684;&#x8D28;&#x7591;&#x3002;</p>
<p><strong>&#x8C08;&#x6240;&#x63D0;&#x5EFA;&#x8BAE;&#xFF1A;&#x5E94;&#x4ECE;&#x56FD;&#x5BB6;&#x6218;&#x7565;&#x5C42;&#x9762;&#x63A8;&#x8FDB;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x53D1;&#x5C55;</strong></p>
<p>&#x201C;&#x8FC7;&#x53BB;&#x4E2D;&#x56FD;&#x4E92;&#x8054;&#x7F51;&#x53D1;&#x5C55;&#x662F;&#x91CE;&#x751F;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x6307;&#x5BFC;&#x5C31;&#x751F;&#x51FA;&#x6765;&#xFF0C;&#x653F;&#x5E9C;&#x5F3A;&#x8C03;&#x7BA1;&#x7406;&#xFF0C;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x8003;&#x8651;&#x53D1;&#x5C55;&#x5F97;&#x597D;&#x4E0D;&#x597D;&#x3002;&#x201D; &#x9A6C;&#x5316;&#x817E;&#x8868;&#x793A;&#xFF0C;&#x6B64;&#x6B21;&#x4F5C;&#x4E3A;&#x5E7F;&#x4E1C;&#x4EC5;&#x6709;&#x7684;2&#x4F4D;&#x6765;&#x81EA;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x7684;&#x5168;&#x56FD;&#x4EBA;&#x5927;&#x4EE3;&#x8868;&#x4E4B;&#x4E00;&#xFF0C;&#x4ED6;&#x5EFA;&#x8BAE;&#x653F;&#x5E9C;&#x80FD;&#x4ECE;&#x9876;&#x5C42;&#x8BBE;&#x8BA1;&#x4E0A;&#x652F;&#x6301;&#x3001;&#x4ECE;&#x56FD;&#x5BB6;&#x6218;&#x7565;&#x4E0A;&#x63A8;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x4ECE;&#x6218;&#x7565;&#x4E0A;&#x63A8;&#x52A8;&#xFF1F;&#x9A6C;&#x5316;&#x817E;&#x4E3E;&#x4F8B;&#x8BF4;&#xFF0C;&#x4E2D;&#x56FD;&#x65E0;&#x7EBF;&#x5BBD;&#x5E26;&#x73B0;&#x5728;&#x5B8C;&#x5168;&#x4F9D;&#x9760;&#x8FD0;&#x8425;&#x5546;&#xFF0C;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#xFF0C;&#x7F51;&#x901F;&#x6162;&#x3001;&#x8D44;&#x8D39;&#x5374;&#x5F88;&#x9AD8;&#x3002;&#x201C;&#x8FD9;&#x662F;&#x5982;&#x9AD8;&#x901F;&#x516C;&#x8DEF;&#x4E00;&#x6837;&#x662F;&#x57FA;&#x672C;&#x8BBE;&#x65BD;&#xFF0C;&#x5E94;&#x66F4;&#x591A;&#x7531;&#x56FD;&#x5BB6;&#x627F;&#x62C5;&#xFF0C;&#x627E;&#x56FD;&#x4F01;&#x627F;&#x5EFA;&#xFF0C;&#x8BBE;&#x5F88;&#x591A;&#x5173;&#x5361;&#xFF0C;&#x5411;&#x7528;&#x6237;&#x6536;&#x8D39;&#xFF0C;&#x8FD9;&#x5F88;&#x963B;&#x788D;&#x53D1;&#x5C55;&#x3002;&#x201D;&#x4ED6;&#x4EE5;&#x6DF1;&#x5733;&#x5E02;&#x653F;&#x5E9C;&#x63A8;&#x52A8;&#x201C;&#x65E0;&#x7EBF;&#x57CE;&#x5E02;&#x201D;&#x9879;&#x76EE;&#x4E3E;&#x4F8B;&#xFF0C;&#x5E0C;&#x671B;&#x56FD;&#x5BB6;&#x5728;&#x6218;&#x7565;&#x5C42;&#x9762;&#x80FD;&#x591F;&#x6709;&#x6240;&#x52A8;&#x4F5C;&#xFF0C;&#x652F;&#x6301;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x9A6C;&#x5316;&#x817E;&#x8BA4;&#x4E3A;&#xFF0C;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x7ACB;&#x6CD5;&#x65B9;&#x9762;&#x4E2D;&#x56FD;&#x4ECD;&#x5904;&#x4E8E;&#x201C;&#x4E8B;&#x4EF6;&#x63A8;&#x52A8;&#x201D;&#x9636;&#x6BB5;&#xFF0C;&#x201C;&#x51FA;&#x4E86;&#x4E2A;&#x5927;&#x4E8B;&#x624D;&#x60F3;&#x600E;&#x4E48;&#x529E;&#xFF0C;&#x8FD9;&#x6837;&#x975E;&#x5E38;&#x88AB;&#x52A8;&#x201D;&#xFF0C;&#x5E0C;&#x671B;&#x56FD;&#x5BB6;&#x80FD;&#x591F;&#x5C3D;&#x5FEB;&#x4E3B;&#x52A8;&#x63A8;&#x8FDB;&#x4E92;&#x8054;&#x7F51;&#x7ACB;&#x6CD5;&#x3002;</p>
<p>&#x8C08;&#x516C;&#x53F8;&#x6218;&#x7565;&#xFF1A;&#x5FAE;&#x4FE1;&#x5C06;&#x4F1A;&#x201C;&#x8D70;&#x51FA;&#x53BB;&#x201D; &#x8003;&#x8651;&#x7533;&#x8BF7;&#x91D1;&#x878D;&#x724C;&#x7167;&#x5728;&#x63A5;&#x53D7;&#x91C7;&#x8BBF;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6709;&#x8BB0;&#x8005;&#x53CB;&#x5584;&#x8868;&#x793A;&#xFF0C;&#x8BB8;&#x591A;&#x4E24;&#x4F1A;&#x4E0A;&#x7684;&#x8BB0;&#x8005;&#x56E2;&#x961F;&#x4F5C;&#x6218;&#x65F6;&#x90FD;&#x4F1A;&#x7528;&#x5FAE;&#x4FE1;&#x4EA4;&#x6D41;&#xFF0C;&#x5C0F;&#x9A6C;&#x54E5;&#x5F00;&#x5FC3;&#x5927;&#x7B11;&#x8868;&#x793A;&#x611F;&#x8C22;&#x3002;&#x4ED6;&#x900F;&#x9732;&#xFF0C;&#x817E;&#x8BAF;&#x6B63;&#x5728;&#x8BA1;&#x5212;&#x63A8;&#x52A8;&#x8BA9;&#x5FAE;&#x4FE1;&#x201C;&#x8D70;&#x51FA;&#x53BB;&#x201D;&#x3002; &#x201C;&#x4E2D;&#x56FD;&#x8F83;&#x5927;&#x7684;&#x56FD;&#x9645;&#x5316;&#x4F01;&#x4E1A;&#x534E;&#x4E3A;&#x3001;&#x4E2D;&#x5174;&#x90FD;&#x5728;&#x6DF1;&#x5733;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x90FD;&#x662F;&#x5236;&#x9020;&#x4E1A;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x5FAE;&#x4FE1;&#x6210;&#x4E3A;&#x4E2D;&#x56FD;&#x7684;&#x56FD;&#x9645;&#x5316;&#x4E92;&#x8054;&#x7F51;&#x5E73;&#x53F0;&#x3002;&#x201D; &#x636E;&#x6089;&#xFF0C;&#x5FAE;&#x4FE1;&#x7684;&#x56FD;&#x9645;&#x5316;&#x6218;&#x7565;&#x9996;&#x5148;&#x5728;&#x9999;&#x6E2F;&#x3001;&#x53F0;&#x6E7E;&#x8BD5;&#x70B9;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C06;&#x63A8;&#x5370;&#x5C3C;&#x3001;&#x8D8A;&#x5357;&#x7B49;&#x4E1C;&#x5357;&#x4E9A;&#x5730;&#x533A;&#xFF0C;&#x76EE;&#x524D;&#x5728;&#x7F8E;&#x56FD;&#x4E5F;&#x5DF2;&#x7ECF;&#x8BBE;&#x4E86;&#x529E;&#x516C;&#x5BA4;&#x3002;</p>
<p>&#x9A6C;&#x5316;&#x817E;&#x8FD8;&#x8868;&#x793A;&#x4F1A;&#x8003;&#x8651;&#x7533;&#x8BF7;&#x91D1;&#x878D;&#x724C;&#x7167;&#x3002;&#x76EE;&#x524D;&#x817E;&#x8BAF;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x652F;&#x4ED8;&#x724C;&#x7167;&#xFF0C;&#x901A;&#x8FC7;&#x548C;&#x5E73;&#x5B89;&#x5408;&#x4F5C;&#x53C2;&#x4E0E;&#x4E86;&#x4FDD;&#x9669;&#x3002;&#x5728;&#x4E0E;&#x9A6C;&#x4E91;&#x3001;&#x9A6C;&#x660E;&#x54F2;&#x5408;&#x4F5C;&#x8BBE;&#x7ACB;&#x7684;&#x65B0;&#x4FDD;&#x9669;&#x516C;&#x53F8;&#x4E2D;&#xFF0C;&#x4E09;&#x65B9;&#x4F1A;&#x8D21;&#x732E;&#x81EA;&#x5DF1;&#x6240;&#x62E5;&#x6709;&#x7684;&#x8D44;&#x6E90;&#x3002;</p>
<p><strong>&#x8C08;&#x201C;&#x6284;&#x88AD;&#x201D;&#x8D28;&#x7591;&#xFF1A;&#x4F60;&#x505A;&#x4E86;&#x8F66;&#x522B;&#x4EBA;&#x5C31;&#x4E0D;&#x80FD;&#x5236;&#x9020;&#x8F66;&#x4E86;&#x5417;&#xFF1F;</strong></p>
<p>&#x5BF9;&#x4E8E;&#x8BB0;&#x8005;&#x63D0;&#x51FA;&#x7684;&#x201C;&#x6709;&#x4EBA;&#x8BF4;&#x817E;&#x8BAF;&#x505A;&#x7684;&#x4EA7;&#x54C1;&#x5728;&#x6284;&#x88AD;&#x201D;&#x7684;&#x8D28;&#x7591;&#xFF0C;&#x9A6C;&#x5316;&#x817E;&#x8868;&#x793A;&#xFF0C;&#x817E;&#x8BAF;&#x53EA;&#x662F;&#x4ECE;&#x4E8B;&#x4E86;&#x522B;&#x4EBA;&#x505A;&#x8FC7;&#x7684;&#x884C;&#x4E1A;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x4E3E;&#x51FA;&#x8BC1;&#x636E;&#x8BC1;&#x660E;&#x817E;&#x8BAF;&#x6284;&#x88AD;&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x5728;&#x6284;&#x88AD;&#x817E;&#x8BAF;&#x65E9;&#x5DF2;&#x88AB;&#x544A;&#x5012;&#x3002;</p>
<p>&#x201C;&#x4F60;&#x505A;&#x4E86;&#x8F66;&#x522B;&#x4EBA;&#x5C31;&#x4E0D;&#x80FD;&#x5236;&#x9020;&#x8F66;&#x4E86;&#x5417;&#xFF1F;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x5176;&#x4ED6;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x90FD;&#x5728;&#x505A;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7B2C;&#x4E00;&#x4E2A;&#x505A;&#x5F97;&#x90A3;&#x4E48;&#x5168;&#x9762;&#xFF0C;&#x6240;&#x4EE5;&#x538B;&#x529B;&#x5168;&#x90E8;&#x538B;&#x6211;&#x4EEC;&#x8EAB;&#x4E0A;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x63A8;&#x6F14;&#xFF0C;&#x52A0;&#x4E0A;&#x6211;&#x4EEC;&#x521B;&#x65B0;&#x6295;&#x5165;&#xFF0C;&#x65B0;&#x4EA7;&#x54C1;&#x63A8;&#x51FA;&#xFF0C;&#x8FD9;&#x79CD;&#x8D28;&#x7591;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#x3002;&#x201D;</p>
<p>&#x8C08;&#x4E24;&#x4F1A;&#x5C65;&#x804C;&#xFF1A;&#x5C06;&#x5438;&#x53D6;&#x6559;&#x8BAD;&#x8BA4;&#x771F;&#x53C2;&#x4F1A; &#x52AA;&#x529B;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x53D1;&#x58F0;</p>
<p>&#x5728;&#x6DF1;&#x5733;&#x4E24;&#x4F1A;&#x65F6;&#xFF0C;&#x9A6C;&#x5316;&#x817E;&#x66FE;&#x56E0;&#x8FDF;&#x5230;20&#x5206;&#x949F;&#x53C2;&#x4F1A;&#x88AB;&#x5A92;&#x4F53;&#x66DD;&#x5149;&#xFF0C;&#x518D;&#x88AB;&#x95EE;&#x5230;&#x8FD9;&#x4E8B;&#x4EF6;&#xFF0C;&#x9A6C;&#x5316;&#x817E;&#x5E7D;&#x9ED8;&#x8868;&#x793A;&#xFF0C;&#x201C;&#x4E0A;&#x6B21;&#x8FDF;&#x5230;20&#x5206;&#x949F;&#x5C31;&#x88AB;&#x4F60;&#x4EEC;&#x5199;&#x4E86;&#xFF0C;&#x8FD9;&#x6B21;&#x6211;&#x4F1A;&#x6C72;&#x53D6;&#x6559;&#x8BAD;&#xFF0C;&#x5168;&#x7A0B;&#x53C2;&#x52A0;&#x3002;&#x201D;</p>
<p>&#x5BF9;&#x4E8E;&#x81EA;&#x5DF1;&#x672A;&#x6765;5&#x5E74;&#x7684;&#x5168;&#x56FD;&#x4EBA;&#x5927;&#x4EE3;&#x8868;&#x751F;&#x6DAF;&#xFF0C;&#x9A6C;&#x5316;&#x817E;&#x627F;&#x8BFA;&#x5C06;&#x8BA4;&#x771F;&#x5C65;&#x804C;&#x3002;</p>
<p>&#x201C;&#x4E4B;&#x524D;&#x5168;&#x56FD;&#x4EBA;&#x5927;&#x6CA1;&#x6709;&#x4E00;&#x4F4D;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x4EE3;&#x8868;&#xFF0C;&#x524D;5&#x5E74;&#x5168;&#x56FD;&#x4E24;&#x4F1A;&#x4E5F;&#x6CA1;&#x6709;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x4ECA;&#x5E74;&#x5E7F;&#x4E1C;&#x7701;&#x5C31;&#x6709;2&#x4F4D;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x4EA7;&#x4E1A;&#x5DF2;&#x7ECF;&#x8FD9;&#x4E48;&#x5927;&#x4E86;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x501F;&#x6B64;&#x673A;&#x4F1A;&#x52A0;&#x5927;&#x529B;&#x5EA6;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x53D1;&#x58F0;&#x3002;&#x201D;</p>
<p>&#x9A6C;&#x5316;&#x817E;&#x8BA4;&#x4E3A;&#xFF0C;&#x4EE3;&#x8868;&#x5C65;&#x804C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x63D0;&#x51FA;&#x4E00;&#x4E9B;&#x53EF;&#x5B9E;&#x65BD;&#xFF0C;&#x6709;&#x524D;&#x77BB;&#x6027;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x5927;&#x5BB6;&#x90FD;&#x6251;&#x5728;&#x70ED;&#x70B9;&#x4E0A;&#x4F1A;&#x5F88;&#x91CD;&#x590D;&#xFF0C;&#x884C;&#x4E1A;&#x4EE3;&#x8868;&#x8981;&#x63D0;&#x81EA;&#x5DF1;&#x884C;&#x4E1A;&#x6709;&#x5173;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x53EA;&#x4ECE;&#x516C;&#x53F8;&#x89D2;&#x5EA6;&#xFF0C;&#x800C;&#x662F;&#x5E94;&#x8BE5;&#x4ECE;&#x56FD;&#x5BB6;&#x53D1;&#x5C55;&#x89D2;&#x5EA6;&#x63D0;&#x51FA;&#x5EFA;&#x8BAE;&#x3002;</p>

      
      
        <div class="post-copyright">
<p><a href="http://www.ithome.me/archives/转-马化腾首度开腔回应“腾讯抄袭”质疑/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年7月28日 16:07</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/archives/转-三大UML建模工具Visio、Rational-Rose、PowerDesign的区别/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          [转]三大UML建模工具Visio、Rational Rose、PowerDesign的区别
        
      </div>
    </a>
  
  
    <a href="/archives/转-手机背后的设计师：诺基亚-三星-小米的幕后故事/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">[转]手机背后的设计师：诺基亚/三星/小米的幕后故事</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2018
            
                 Simon.Chen
            
    	</div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {
		fancybox: false,
		mathjax: false,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: true,
     CDN_PATH: '' 
	}
</script>




    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/common.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>







  </div>
</body>
</html>
