<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>谷歌欲将Chrome和Android合二为一 | IT驿站</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#4f6b79">
  <meta name="msapplication-TileColor" content="#4f6b79"/>
  
  
  <meta name="description" content="-谷歌欲将Chrome和Android合二为一">
<meta name="keywords" content="-chrome -android">
<meta property="og:type" content="article">
<meta property="og:title" content="谷歌欲将Chrome和Android合二为一">
<meta property="og:url" content="http://chensiming.me/archives/谷歌欲将Chrome和Android合二为一/index.html">
<meta property="og:site_name" content="IT驿站">
<meta property="og:description" content="-谷歌欲将Chrome和Android合二为一">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="http://img1.gtimg.com/tech/pics/hv1/242/146/1954/127096322.jpg">
<meta property="og:updated_time" content="2015-11-07T03:30:30.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="谷歌欲将Chrome和Android合二为一">
<meta name="twitter:description" content="-谷歌欲将Chrome和Android合二为一">
<meta name="twitter:image" content="http://img1.gtimg.com/tech/pics/hv1/242/146/1954/127096322.jpg">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link rel="stylesheet" href="/css/style.css" type="text/css"> 
  

</head>

<body>
  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			
		</a>
		
		<p class="header-subtitle">分享有助于提升</p>
		
        <nav class="header-menu">
            <ul>
                
                    <li><a href="/">主页</a></li>
                
                    <li><a href="/archives">所有文章</a></li>
                
                    <li><a href="/categories/移动开发">移动开发</a></li>
                
                    <li><a href="/about-me">关于我</a></li>
                
            </ul>
        </nav>
	</header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
	<div class="intrude-less">
		<header id="header" class="inner">
			<a href="/" class="profilepic">
                
			        <img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			    
			</a>
			<!-- <hgroup>
			  <h1 class="header-author">Simon.Chen</h1>
			</hgroup>-->
			
			<p class="header-subtitle">分享有助于提升</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
					<li><a href="/categories/移动开发">移动开发</a></li>
		        
					<li><a href="/about-me">关于我</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap"><article id="post-谷歌欲将Chrome和Android合二为一" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/archives/谷歌欲将Chrome和Android合二为一/" class="article-date">
<span class="datetime-published-tag"> 2015-11-07 </span>
</a>

    </div>
  
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      谷歌欲将Chrome和Android合二为一
    </h1>
  

      </header>
      
      <div class="article-info article-info-post">
        <!-- 
	<div class="article-category tagcloud">
	<a class="article-category-link" href="/categories/转载/">转载</a>
	</div>

 -->
        
	<div class="article-tag tagcloud">
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/移动开发/">移动开发</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/转载/">转载</a></li></ul>
	</div>

        <div class="clearfix"></div>
      </div>
      
    
    <div class="article-entry" itemprop="articleBody">
      
        <p><img src="http://img1.gtimg.com/tech/pics/hv1/242/146/1954/127096322.jpg" alt=""></p>
<p>  &#x817E;&#x8BAF;&#x79D1;&#x6280;&#x8BAF; 10&#x6708;30&#x65E5;&#x6D88;&#x606F;&#xFF0C;&#x636E;&#x5916;&#x7535;&#x62A5;&#x9053;&#xFF0C;&#x6D88;&#x606F;&#x4EBA;&#x58EB;&#x5468;&#x56DB;&#x900F;&#x9732;&#xFF0C;Alphabet&#x65D7;&#x4E0B;&#x5B50;&#x516C;&#x53F8;&#x8C37;&#x6B4C;(&#x5FAE;&#x535A;)&#x6B63;&#x7B79;&#x5212;&#x628A;PC&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;Chrome&#x4E0E;&#x79FB;&#x52A8;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;Android&#x8FDB;&#x884C;&#x5408;&#x5E76;&#x3002;&#x6B64;&#x4E3E;&#x8868;&#x660E;&#x79FB;&#x52A8;&#x8BA1;&#x7B97;&#x5DF2;&#x8D8A;&#x6765;&#x8D8A;&#x5360;&#x636E;&#x4E3B;&#x5BFC;&#x5730;&#x4F4D;&#x3002;  </p>
<p>  &#x6D88;&#x606F;&#x4EBA;&#x58EB;&#x79F0;&#xFF0C;&#x4E3A;&#x628A;&#x8FD9;&#x4E24;&#x6B3E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5408;&#x5E76;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x8C37;&#x6B4C;&#x7684;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x5DF2;&#x4ED8;&#x51FA;&#x4E86;&#x8FD1;&#x4E24;&#x5E74;&#x7684;&#x8F9B;&#x52B3;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x5728;&#x65E5;&#x524D;&#x53D6;&#x5F97;&#x4E86;&#x8FDB;&#x5C55;&#x3002;&#x636E;&#x6089;&#xFF0C;&#x8C37;&#x6B4C;&#x8BA1;&#x5212;&#x5728;2017&#x5E74;&#x6B63;&#x5F0F;&#x63A8;&#x51FA;&#x5408;&#x5E76;&#x7248;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x4E14;&#x8BE5;&#x516C;&#x53F8;&#x4F1A;&#x5728;&#x660E;&#x5E74;&#x5BF9;&#x5916;&#x5C55;&#x793A;&#x65E9;&#x671F;&#x7248;&#x7684;&#x65B0;&#x6B3E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;  </p>
<p>  Android&#x76EE;&#x524D;&#x662F;&#x5168;&#x7403;&#x5E94;&#x7528;&#x6700;&#x5E7F;&#x6CDB;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x652F;&#x6301;&#x4E86;&#x8D85;&#x8FC7;10&#x4EBF;&#x90E8;&#x667A;&#x80FD;&#x624B;&#x673A;&#xFF0C;&#x4EE5;&#x53CA;&#x7531;&#x4F17;&#x591A;&#x5382;&#x5546;&#x5F00;&#x53D1;&#x7684;&#x5176;&#x5B83;&#x8BBE;&#x5907;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x6B3E;PC&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;Chrome&#x4E3B;&#x8981;&#x88AB;Chromebook&#x7B49;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x548C;&#x53F0;&#x5F0F;&#x673A;&#x6240;&#x91C7;&#x7528;&#x3002;&#x5E02;&#x573A;&#x8C03;&#x7814;&#x516C;&#x53F8;IDC&#x7684;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x663E;&#x793A;&#xFF0C;Chrome&#x4ECD;&#x53EA;&#x662F;PC&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E02;&#x573A;&#x7684;&#x5C0F;&#x4F17;&#x4EA7;&#x54C1;&#xFF0C;&#x4EFD;&#x989D;&#x5C1A;&#x4E0D;&#x8DB3;3%&#x3002;  </p>
<p>  &#x6D88;&#x606F;&#x4EBA;&#x58EB;&#x79F0;&#xFF0C;&#x8C37;&#x6B4C;&#x5C06;&#x63A8;&#x51FA;&#x7684;&#x65B0;&#x7248;Android&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x540C;&#x6837;&#x4E5F;&#x5C06;&#x652F;&#x6301;PC&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x80FD;&#x591F;&#x8FDB;&#x5165;&#x76EE;&#x524D;&#x63D0;&#x4F9B;&#x4E86;&#x8D85;100&#x4E07;&#x6B3E;&#x5E94;&#x7528;&#x7684;&#x5E94;&#x7528;&#x5546;&#x5E97;Google Play&#x3002;&#x8C37;&#x6B4C;&#x5E0C;&#x671B;&#x8BA9;&#x641C;&#x7D22;&#x3001;YouTube&#x7B49;&#x76C8;&#x5229;&#x670D;&#x52A1;&#x8FDB;&#x5165;&#x66F4;&#x591A;&#x7684;&#x8BBE;&#x5907;&#x3002;&#x8BE5;&#x516C;&#x53F8;&#x540C;&#x6837;&#x8FD8;&#x5E0C;&#x671B;&#x8FCE;&#x5408;&#x72EC;&#x7ACB;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x80C3;&#x53E3;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x5728;&#x5FAE;&#x5E45;&#x8C03;&#x6574;&#x540E;&#x5C31;&#x80FD;&#x591F;&#x9002;&#x7528;&#x4E8E;&#x66F4;&#x591A;&#x7684;&#x8BBE;&#x5907;&#x3002;  </p>
<p>&#x6D88;&#x606F;&#x4EBA;&#x58EB;&#x79F0;&#xFF0C;&#x5728;&#x8C37;&#x6B4C;&#x7684;&#x4E24;&#x6B3E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5408;&#x5E76;&#x4E4B;&#x540E;&#xFF0C;Chromebook&#x5C06;&#x4F1A;&#x8FDB;&#x884C;&#x66F4;&#x540D;&#xFF0C;&#x4F46;&#x76EE;&#x524D;&#x5C1A;&#x672A;&#x786E;&#x5B9A;&#x540D;&#x79F0;&#x3002;&#x4E0D;&#x8FC7;&#x8C37;&#x6B4C;&#x6253;&#x7B97;&#x7EE7;&#x7EED;&#x4FDD;&#x7559;&#x79FB;&#x52A8;&#x548C;PC&#x6D4F;&#x89C8;&#x5668;Chrome&#x7684;&#x540D;&#x79F0;&#x3002;  </p>
<p>2009&#x5E74;&#x66FE;&#x8D1F;&#x8D23;Chrome&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x7684;&#x8C37;&#x6B4C;&#x9996;&#x5E2D;&#x6267;&#x884C;&#x5B98;&#x6851;&#x8FBE;&#x5C14;&#xB7;&#x76AE;&#x67E5;&#x4F0A;&#xFF08;Sundar Pichai&#xFF09;&#xFF0C;&#x4E0A;&#x5468;&#x5728;&#x8D22;&#x62A5;&#x7535;&#x8BDD;&#x4F1A;&#x8BAE;&#x4E2D;&#x5411;&#x5206;&#x6790;&#x5E08;&#x8868;&#x793A;&#xFF0C;&#x201C;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x8BA1;&#x7B97;&#x6A21;&#x5F0F;&#xFF0C;&#x79FB;&#x52A8;&#x8BA1;&#x7B97;&#x6700;&#x7EC8;&#x5C06;&#x4F1A;&#x540C;&#x5982;&#x4ECA;&#x6211;&#x4EEC;&#x6240;&#x8BA4;&#x4E3A;&#x7684;&#x53F0;&#x5F0F;&#x8BA1;&#x7B97;&#x4EA4;&#x878D;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x201D;  </p>
<p>&#x4F5C;&#x4E3A;&#x8C37;&#x6B4C;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E02;&#x573A;&#x7684;&#x4E3B;&#x8981;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x4E4B;&#x4E00;&#xFF0C;&#x5FAE;&#x8F6F;&#x6B64;&#x524D;&#x5DF2;&#x91C7;&#x53D6;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x5FAE;&#x8F6F;Windows 10&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x652F;&#x6301;PC&#x548C;&#x667A;&#x80FD;&#x624B;&#x673A;&#xFF0C;&#x5E76;&#x51C6;&#x8BB8;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#x5728;&#x4E24;&#x79CD;&#x8BBE;&#x5907;&#x4E2D;&#x90FD;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x3002;&#x4E0D;&#x8FC7;&#x4E0E;&#x5FAE;&#x8F6F;&#x7684;&#x505A;&#x6CD5;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF0C;&#x82F9;&#x679C;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x95EE;&#x9898;&#x4E0A;&#x4ECD;&#x575A;&#x6301;&#x5206;&#x800C;&#x6CBB;&#x4E4B;&#x7684;&#x7ACB;&#x573A;&#xFF1A;iOS&#x9762;&#x5411;&#x667A;&#x80FD;&#x624B;&#x673A;&#x548C;&#x5E73;&#x677F;&#x7535;&#x8111;&#xFF0C;OS X&#x9762;&#x5411;Mac&#x3002;&#x82F9;&#x679C;&#x9996;&#x5E2D;&#x6267;&#x884C;&#x5B98;&#x8482;&#x59C6;&#xB7;&#x5E93;&#x514B;&#xFF08;Tim Cook&#xFF09;&#x4E0A;&#x6708;&#x66FE;&#x8868;&#x793A;&#xFF0C;&#x628A;&#x4E24;&#x6B3E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#x201C;&#x53EA;&#x4F1A;&#x524A;&#x5F31;&#x5B83;&#x4EEC;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x7528;&#x6237;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x6700;&#x4F73;&#x7684;&#x4F53;&#x9A8C;&#x3002;&#x201D;  </p>
<p>&#x5C31;&#x8C37;&#x6B4C;&#x800C;&#x8A00;&#xFF0C;Android&#x5730;&#x4F4D;&#x7684;&#x63D0;&#x5347;&#x4E0E;Chrome&#x7684;&#x6D88;&#x4EA1;&#xFF0C;&#x4EE3;&#x8868;&#x7740;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x91CD;&#x5927;&#x8F6C;&#x53D8;&#x3002;&#x8C37;&#x6B4C;&#x521B;&#x529E;&#x4E8E;&#x7F51;&#x7EDC;&#x65F6;&#x4EE3;&#xFF0C;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#x6700;&#x521D;&#x7684;&#x670D;&#x52A1;&#x4F9D;&#x65E7;&#x8FD8;&#x5728;&#x3002;&#x8C37;&#x6B4C;&#x4E4B;&#x6240;&#x4EE5;&#x63A8;&#x51FA;Chrome&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x7ED9;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x670D;&#x52A1;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x7684;&#x6D41;&#x91CF;&#x3002;&#x8C37;&#x6B4C;&#x767D;&#x624B;&#x8D77;&#x5BB6;&#x5F00;&#x53D1;&#x4E86;&#x79FB;&#x52A8;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;Android&#x3002;&#x5728;&#x7ECF;&#x5386;&#x4E86;&#x4E00;&#x756A;&#x5185;&#x90E8;&#x4E89;&#x8BBA;&#x4E4B;&#x540E;&#xFF0C;&#x8C37;&#x6B4C;&#x51B3;&#x5B9A;&#x540C;&#x65F6;&#x517C;&#x987E;&#x4E24;&#x6B3E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x4E0D;&#x8FC7;&#x968F;&#x7740;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x548C;&#x5E94;&#x7528;&#x7684;&#x9010;&#x6E10;&#x6D41;&#x884C;&#xFF0C;Android&#x53D6;&#x5F97;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x6210;&#x529F;&#x3002;  </p>
<p>&#x5E02;&#x573A;&#x6B64;&#x524D;&#x66FE;&#x4E00;&#x76F4;&#x9884;&#x8BA1;&#x8C37;&#x6B4C;&#x7684;&#x4E24;&#x6B3E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5C06;&#x4F1A;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#x3002;&#x5728;2013&#x5E74;Android&#x8054;&#x5408;&#x521B;&#x59CB;&#x4EBA;&#x5B89;&#x8FEA;&#xB7;&#x9C81;&#x5BBE;&#xFF08;Andy Rubin&#xFF09;&#x8F6C;&#x4EFB;&#x673A;&#x5668;&#x4EBA;&#x9879;&#x76EE;&#x8D1F;&#x8D23;&#x4EBA;&#x4E4B;&#x540E;&#xFF0C;&#x76AE;&#x67E5;&#x4F0A;&#x66FE;&#x540C;&#x65F6;&#x8D1F;&#x8D23;Chrome&#x548C;Android&#x4E1A;&#x52A1;&#x3002;&#x53BB;&#x5E74;&#xFF0C;&#x76AE;&#x67E5;&#x4F0A;&#x4EFB;&#x547D;Android&#x6280;&#x672F;&#x526F;&#x603B;&#x88C1;&#x6D1B;&#x514B;&#x6D77;&#x9ED8;&#xFF08;Hiroshi Lockheimer&#xFF09;&#x517C;&#x4EFB;Chrome&#x4E1A;&#x52A1;&#x8D1F;&#x8D23;&#x4EBA;&#x3002;  </p>
<p>&#x4ECA;&#x5E74;9&#x6708;&#xFF0C;&#x8C37;&#x6B4C;&#x63A8;&#x51FA;&#x4E00;&#x6B3E;&#x642D;&#x8F7D;Android&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x529E;&#x516C;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;Pixel C&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x8C37;&#x6B4C;Pixel&#x4EA7;&#x54C1;&#x7EBF;&#x4E2D;&#x9996;&#x6B3E;&#x653E;&#x5F03;&#x4F7F;&#x7528;Chrome&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x53BB;&#x5E74;&#xFF0C;&#x8C37;&#x6B4C;&#x8FD8;&#x8BA9;&#x4E00;&#x4E9B;Android&#x5E94;&#x7528;&#x80FD;&#x591F;&#x5728;Chromebook&#x4E0A;&#x8FD0;&#x884C;&#x3002;  </p>
<p>Chrome&#x548C;Android&#x5747;&#x57FA;&#x4E8E;Linux&#x5F00;&#x6E90;&#x4EE3;&#x7801;&#x3002;&#x4E0D;&#x8FC7;&#x6D88;&#x606F;&#x4EBA;&#x58EB;&#x79F0;&#xFF0C;&#x7531;&#x4E8E;&#x4E24;&#x6B3E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6709;&#x7740;&#x91CD;&#x5927;&#x533A;&#x522B;&#xFF0C;&#x56E0;&#x6B64;&#x628A;&#x4E24;&#x6B3E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5408;&#x5E76;&#x5230;&#x4E00;&#x8D77;&#x7684;&#x5DE5;&#x4F5C;&#x5E76;&#x4E0D;&#x8F7B;&#x677E;&#x3002;  </p>
<p>&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x62E5;&#x6709;&#x952E;&#x76D8;&#xFF0C;&#x4E14;&#x62E5;&#x6709;&#x6BD4;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x66F4;&#x5927;&#x7684;&#x663E;&#x793A;&#x5C4F;&#xFF0C;&#x56E0;&#x6B64;&#x7528;&#x6237;&#x7ECF;&#x5E38;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x5728;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x76F8;&#x4E92;&#x4F20;&#x8F93;&#x5185;&#x5BB9;&#x3002;&#x867D;&#x7136;Android&#x667A;&#x80FD;&#x624B;&#x673A;&#x548C;&#x5E73;&#x677F;&#x7535;&#x8111;&#x4E5F;&#x80FD;&#x591F;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#xFF0C;&#x4F46;&#x5374;&#x65E0;&#x6CD5;&#x540C;&#x65F6;&#x5C55;&#x793A;&#x5728;&#x663E;&#x793A;&#x5C4F;&#x4E2D;&#x3002;&#x8FD9;&#x4E5F;&#x8BA9;&#x7528;&#x6237;&#x5728;&#x5E94;&#x7528;&#x95F4;&#x8FDB;&#x884C;&#x5207;&#x6362;&#x53D8;&#x5F97;&#x5341;&#x5206;&#x56F0;&#x96BE;&#x3002;<br>Chromebook&#x7528;&#x6237;&#x76EE;&#x524D;&#x5E76;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x53EF;&#x9009;&#x62E9;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;Chromebook&#x7684;&#x7528;&#x6237;&#x6570;&#x91CF;&#x592A;&#x5C11;&#xFF0C;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x8005;&#x4E00;&#x76F4;&#x4E0D;&#x592A;&#x613F;&#x610F;&#x4E3A;Chromebook&#x5F00;&#x53D1;&#x5E94;&#x7528;&#x3002;  </p>
<p>Airbnb&#x6280;&#x672F;&#x7ECF;&#x7406;&#x4E9A;&#x5386;&#x514B;&#x65AF;&#xB7;&#x6234;&#x7EF4;&#x65AF;&#xFF08;Alex Davis&#xFF09;&#x8868;&#x793A;&#xFF0C;&#x201C;&#x76EE;&#x524D;&#x6211;&#x4EEC;&#x5BF9;&#x4E3A;Chrome OS&#x5F00;&#x53D1;&#x5E94;&#x7528;&#x7684;&#x5174;&#x8DA3;&#x4E0D;&#x5927;&#xFF0C;&#x56E0;&#x4E3A;Chrome OS&#x7684;&#x5E02;&#x573A;&#x89C4;&#x6A21;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#x3002;&#x201D;&#x6234;&#x7EF4;&#x65AF;&#x8BA4;&#x4E3A;&#xFF0C;&#x5BF9;&#x8C37;&#x6B4C;&#x800C;&#x8A00;&#xFF0C;&#x628A;&#x4E24;&#x6B3E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#x53EF;&#x80FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x56E0;&#x4E3A;Android&#x5DF2;&#x7ECF;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x3002;<br>&#x628A;Chrome&#x878D;&#x5165;&#x5230;Android&#x5F53;&#x4E2D;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x8C37;&#x6B4C;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x4EA7;&#x529B;&#x5E94;&#x7528;Docs&#x548C;Sheets&#x7B49;&#x8D62;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x4F01;&#x4E1A;&#x7528;&#x6237;&#x3002;&#x56E0;&#x4E3A;&#x540C;&#x65F6;&#x517C;&#x987E;&#x7740;&#x4E24;&#x6B3E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x76EE;&#x524D;&#x8FD9;&#x5BF9;&#x8C37;&#x6B4C;&#x800C;&#x8A00;&#x8FD8;&#x662F;&#x4E00;&#x9879;&#x6311;&#x6218;&#x3002;&#xFF08;&#x660E;&#x8F69;&#xFF09;</p>

      
      
        <div class="post-copyright">
<p><a href="http://chensiming.me/archives/谷歌欲将Chrome和Android合二为一/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年11月7日 11:11</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/archives/gridview添加网格的方法/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          gridview添加网格的方法
        
      </div>
    </a>
  
  
    <a href="/archives/copy-Android开发必知Tip/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">[copy]Android开发必知Tip</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2017
            
                 Simon.Chen
            
    	</div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {
		fancybox: false,
		mathjax: false,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: true,
     CDN_PATH: '' 
	}
</script>




    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/common.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>







  </div>
</body>
</html>
