<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>[转]IT众生相 | IT驿站</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#4f6b79">
  <meta name="msapplication-TileColor" content="#4f6b79"/>
  
  
  <meta name="description" content="&amp;#x7B2C;&amp;#x4E00;&amp;#x7EA7;&amp;#xFF1A;&amp;#x795E;&amp;#x4EBA;&amp;#xFF0C;&amp;#x5929;&amp;#x8D44;&amp;#x8FC7;&amp;#x4EBA;&amp;#x800C;&amp;#x53C8;&amp;#x662F;&amp;#x6280;&amp;#x672F;&amp;#x72C2;&amp;#x70ED;&amp;#x8005;&amp;#x540C;&amp;#x65F6;&amp;#x8FD8;&amp;#x62E5;&amp;#x6709;&amp;#x8FC7;">
<meta name="keywords" content="IT">
<meta property="og:type" content="article">
<meta property="og:title" content="[转]IT众生相">
<meta property="og:url" content="http://chensiming.me/archives/转-IT众生相/index.html">
<meta property="og:site_name" content="IT驿站">
<meta property="og:description" content="&amp;#x7B2C;&amp;#x4E00;&amp;#x7EA7;&amp;#xFF1A;&amp;#x795E;&amp;#x4EBA;&amp;#xFF0C;&amp;#x5929;&amp;#x8D44;&amp;#x8FC7;&amp;#x4EBA;&amp;#x800C;&amp;#x53C8;&amp;#x662F;&amp;#x6280;&amp;#x672F;&amp;#x72C2;&amp;#x70ED;&amp;#x8005;&amp;#x540C;&amp;#x65F6;&amp;#x8FD8;&amp;#x62E5;&amp;#x6709;&amp;#x8FC7;">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2015-07-28T08:33:49.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="[转]IT众生相">
<meta name="twitter:description" content="&amp;#x7B2C;&amp;#x4E00;&amp;#x7EA7;&amp;#xFF1A;&amp;#x795E;&amp;#x4EBA;&amp;#xFF0C;&amp;#x5929;&amp;#x8D44;&amp;#x8FC7;&amp;#x4EBA;&amp;#x800C;&amp;#x53C8;&amp;#x662F;&amp;#x6280;&amp;#x672F;&amp;#x72C2;&amp;#x70ED;&amp;#x8005;&amp;#x540C;&amp;#x65F6;&amp;#x8FD8;&amp;#x62E5;&amp;#x6709;&amp;#x8FC7;">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link rel="stylesheet" href="/css/style.css" type="text/css"> 
  

</head>

<body>
  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			
		</a>
		
		<p class="header-subtitle">分享有助于提升</p>
		
        <nav class="header-menu">
            <ul>
                
                    <li><a href="/">主页</a></li>
                
                    <li><a href="/archives">所有文章</a></li>
                
                    <li><a href="/categories/移动开发">移动开发</a></li>
                
                    <li><a href="/about-me">关于我</a></li>
                
            </ul>
        </nav>
	</header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
	<div class="intrude-less">
		<header id="header" class="inner">
			<a href="/" class="profilepic">
                
			        <img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			    
			</a>
			<!-- <hgroup>
			  <h1 class="header-author">Simon.Chen</h1>
			</hgroup>-->
			
			<p class="header-subtitle">分享有助于提升</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
					<li><a href="/categories/移动开发">移动开发</a></li>
		        
					<li><a href="/about-me">关于我</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap"><article id="post-转-IT众生相" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/archives/转-IT众生相/" class="article-date">
<span class="datetime-published-tag"> 2014-09-10 </span>
</a>

    </div>
  
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      [转]IT众生相
    </h1>
  

      </header>
      
      <div class="article-info article-info-post">
        <!-- 
	<div class="article-category tagcloud">
	<a class="article-category-link" href="/categories/分享/">分享</a><a class="article-category-link" href="/categories/分享/转载/">转载</a>
	</div>

 -->
        
	<div class="article-tag tagcloud">
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/IT/">IT</a></li></ul>
	</div>

        <div class="clearfix"></div>
      </div>
      
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x7B2C;&#x4E00;&#x7EA7;&#xFF1A;&#x795E;&#x4EBA;&#xFF0C;&#x5929;&#x8D44;&#x8FC7;&#x4EBA;&#x800C;&#x53C8;&#x662F;&#x6280;&#x672F;&#x72C2;&#x70ED;&#x8005;&#x540C;&#x65F6;&#x8FD8;&#x62E5;&#x6709;&#x8FC7;&#x4EBA;&#x7684;&#x5546;&#x4E1A;&#x5934;&#x8111;&#xFF0C;&#x9AD8;&#x77BB;&#x8FDC;&#x77A9;&#xFF0C;&#x6280;&#x672F;&#x8FC7;&#x4EBA;&#xFF0C;&#x5927;&#x5668;&#x4E5F;&#x3002;&#x5982;&#x4E01;&#x78CA;&#xFF0C;&#x6C42;&#x4F2F;&#x541B;&#x3002;<br>&#x7B2C;&#x4E8C;&#x7EA7;&#xFF1A;&#x9AD8;&#x4EBA;&#xFF0C;&#x6709;&#x5929;&#x8D4B;&#xFF0C;&#x6280;&#x672F;&#x8FC7;&#x4EBA;&#x4F46;&#x6CA1;&#x6709;&#x8FC7;&#x4EBA;&#x7684;&#x5546;&#x4E1A;&#x5934;&#x8111;&#xFF0C;&#x901A;&#x5E38;&#x6B64;&#x7C7B;&#x4EBA;&#x4E0D;&#x662F;&#x9876;&#x5C16;&#x9ED1;&#x5BA2;&#x5C31;&#x662F;&#x6280;&#x672F;&#x603B;&#x76D1;&#x4E4B;&#x6D41;&#x3002;<br>&#x7B2C;&#x4E09;&#x7EA7;&#xFF1A;&#x725B;&#x4EBA;&#xFF0C;&#x6280;&#x672F;&#x7CBE;&#x6E5B;&#xFF0C;&#x719F;&#x6089;&#x884C;&#x4E1A;&#x77E5;&#x8BC6;&#xFF0C;&#x6562;&#x4E8E;&#x521B;&#x65B0;&#xFF0C;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x53F8;&#x548C;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x3002;<br>&#x7B2C;&#x56DB;&#x7EA7;&#xFF1A;&#x5DE5;&#x5934;&#xFF0C;&#x6280;&#x672F;&#x7CBE;&#x6E5B;&#xFF0C;&#x6709;&#x9886;&#x5BFC;&#x56E2;&#x961F;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6B64;&#x7C7B;&#x4EBA;&#x5927;&#x516C;&#x53F8;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x5C45;&#x591A;&#x3002;<br>&#x7B2C;&#x4E94;&#x7EA7;&#xFF1A;&#x6280;&#x672F;&#x5DE5;&#x4EBA;&#xFF0C;&#x6280;&#x672F;&#x7CBE;&#x6E5B;&#xFF0C;&#x719F;&#x6089;&#x884C;&#x4E1A;&#x77E5;&#x8BC6;&#x4F46;&#x9886;&#x5BFC;&#x80FD;&#x529B;&#x6B20;&#x52A0;&#xFF0C;&#x6B64;&#x7C7B;&#x4EBA;&#x5927;&#x591A;&#x4E3A;&#x7CFB;&#x5206;&#x4EBA;&#x5458;&#x6216;&#x8D44;&#x6DF1;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x6840;&#x9A9C;&#x4E0D;&#x900A;&#xFF0C;&#x81EA;&#x89C6;&#x6E05;&#x9AD8;&#xFF0C;&#x4E0D;&#x613F;&#x4E8E;&#x4E00;&#x822C;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x4E3A;&#x4F0D;&#xFF0C;&#x5728;&#x8BBA;&#x575B;&#x4E0A;&#x57FA;&#x672C;&#x4EE5;&#x9AD8;&#x624B;&#x9762;&#x76EE;&#x51FA;&#x73B0;&#x3002;<br>&#x7B2C;&#x516D;&#x7EA7;&#xFF1A;&#x719F;&#x7EC3;&#x5DE5;&#x4EBA;&#xFF0C;&#x6280;&#x672F;&#x6709;&#x5E7F;&#x5EA6;&#x65E0;&#x6DF1;&#x5EA6;&#xFF0C;&#x559C;&#x6B22;&#x94BB;&#x7814;&#x4F46;&#x6D45;&#x5C1D;&#x8F84;&#x6B62;&#x3002;&#x6B64;&#x7C7B;&#x4EBA;&#x5927;&#x591A;&#x4E3A;&#x8001;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x90E8;&#x5206;&#x559C;&#x6B22;&#x5229;&#x7528;&#x5DE5;&#x5177;&#x53BB;&#x67E5;&#x627E;&#x7F51;&#x4E0A;&#x6709;&#x6F0F;&#x6D1E;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5E72;&#x70B9;&#x574F;&#x4E8B;&#x4EE5;&#x83B7;&#x53D6;&#x6210;&#x7EE9;&#x611F;&#x3002;&#x5982;&#x679C;&#x5FC3;&#x60C5;&#x597D;&#xFF0C;&#x5728;&#x8BBA;&#x575B;&#x4E0A;&#x4ED6;&#x4EEC;&#x4F1A;&#x56DE;&#x7B54;&#x83DC;&#x9E1F;&#x7684;&#x5927;&#x90E8;&#x5206;&#x95EE;&#x9898;&#x3002;&#x6B64;&#x7EA7;&#x522B;&#x4E3A;&#x8F6F;&#x4EF6;&#x4E1A;&#x82E6;&#x529B;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;<br>&#x7B2C;&#x4E03;&#x7EA7;&#xFF1A;&#x5DE5;&#x4EBA;&#xFF0C;&#x67D0;&#x4E9B;&#x6280;&#x672F;&#x8F83;&#x719F;&#x7EC3;&#x4F46;&#x7F3A;&#x4E4F;&#x6DF1;&#x5EA6;&#x548C;&#x5E7F;&#x5EA6;&#xFF0C;&#x6B64;&#x7C7B;&#x4EBA;&#x5927;&#x591A;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#x7EA7;&#x522B;&#xFF0C;&#x7ECF;&#x5E38;&#x5728;&#x8BBA;&#x575B;&#x4E0A;&#x63D0;&#x95EE;&#x5076;&#x5C14;&#x4E5F;&#x56DE;&#x7B54;&#x83DC;&#x9E1F;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E3A;&#x8F6F;&#x4EF6;&#x4EA7;&#x4E1A;&#x82E6;&#x529B;&#x7684;&#x4E3B;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;<br>&#x7B2C;&#x516B;&#x7EA7;&#xFF1A;&#x83DC;&#x9E1F;&#xFF0C;&#x5165;&#x95E8;&#x65F6;&#x95F4;&#x4E0D;&#x957F;&#xFF0C;&#x5728;&#x8BBA;&#x575B;&#x4E0A;&#x4F1A;&#x53CD;&#x590D;&#x63D0;&#x95EE;&#x5F88;&#x521D;&#x7EA7;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x5510;&#x50E7;&#x7684;&#x7CBE;&#x795E;&#x3002;&#x867D;&#x7136;&#x62DB;&#x4EBA;&#x70E6;&#x4F46;&#x57FA;&#x672C;&#x5F88;&#x53EF;&#x7231;&#x3002;&#x53EA;&#x8981;&#x8BA4;&#x771F;&#x94BB;&#x7814;&#xFF0C;&#x4E00;&#x4E24;&#x5E74;&#x540E;&#x5C31;&#x80FD;&#x5347;&#x7EA7;&#x5230;&#x4E0A;&#x4E00;&#x5C42;&#x3002;<br>&#x7B2C;&#x4E5D;&#x7EA7;&#xFF1A;&#x5927;&#x5FFD;&#x60A0;&#xFF0C;&#x5229;&#x7528;&#x4E2D;&#x56FD;&#x6559;&#x80B2;&#x7684;&#x5F0A;&#x75C5;&#xFF0C;&#x9876;&#x7740;&#x4E00;&#x9876;&#x9AD8;&#x5B66;&#x5386;&#x7684;&#x5E3D;&#x5B50;&#xFF0C;&#x5728;&#x5C0F;&#x516C;&#x53F8;&#x91CC;&#x6DF7;&#x4E2A;&#x8F6F;&#x4EF6;&#x90E8;&#x7ECF;&#x7406;&#xFF0C;&#x8BBE;&#x8BA1;&#x4E0D;&#x884C;&#xFF0C;&#x4EE3;&#x7801;&#x4E0D;&#x884C;&#xFF0C;&#x53EA;&#x4F1A;&#x80E1;&#x4E71;&#x652F;&#x914D;&#x4E0B;&#x5C5E;&#xFF0C;&#x62CD;&#x9886;&#x5BFC;&#x9A6C;&#x5C41;&#xFF0C;&#x5728;&#x9886;&#x5BFC;&#x9762;&#x524D;&#x80E1;&#x5439;&#x6D77;&#x4F83;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x6253;&#x626E;&#x6210;&#x6280;&#x672F;&#x9AD8;&#x624B;&#x7684;&#x6A21;&#x6837;&#x3002;&#x628A;&#x52FE;&#x5FC3;&#x6597;&#x89D2;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x6587;&#x5316;&#x5F15;&#x5165;&#x6280;&#x672F;&#x90E8;&#x95E8;&#xFF0C;&#x5B9E;&#x5728;&#x9F8C;&#x9F8A;&#xFF01;<br>&#x7B2C;&#x5341;&#x7EA7;&#xFF1A;&#x9A74;&#x6216;&#x50BB;X&#xFF0C;&#x4F1A;&#x5199;SELECT&#x8BED;&#x53E5;&#x5C31;&#x8BF4;&#x81EA;&#x5DF1;&#x7CBE;&#x901A;ORALCE&#xFF0C;&#x8FDE;&#x5BC4;&#x5B58;&#x5668;&#x6709;&#x51E0;&#x79CD;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x5C31;&#x8BF4;&#x81EA;&#x5DF1;&#x61C2;&#x6C47;&#x7F16;&#xFF0C;&#x5EFA;&#x8BAE;&#x5168;&#x90E8;&#x9001;&#x5230;&#x65E5;&#x672C;&#x5F53;IT&#x4EA7;&#x4E1A;&#x5DE5;&#x4EBA;&#xFF0C;&#x6323;&#x4E86;&#x65E5;&#x672C;&#x4EBA;&#x7684;&#x94B1;&#x8FD8;&#x4E25;&#x91CD;&#x6253;&#x51FB;&#x65E5;&#x672C;&#x7684;&#x8F6F;&#x4EF6;&#x4E1A;&#xFF01;</p>

      
      
        <div class="post-copyright">
<p><a href="http://chensiming.me/archives/转-IT众生相/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年7月28日 16:07</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/archives/转-几行代码看程序员的水平——Android文件命名规范/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          [转]几行代码看程序员的水平——Android文件命名规范
        
      </div>
    </a>
  
  
    <a href="/archives/【转】网友整理的Android面试题集-附网友提供的参考答案/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">【转】网友整理的Android面试题集-附网友提供的参考答案</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2017
            
                 Simon.Chen
            
    	</div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {
		fancybox: false,
		mathjax: false,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: true,
     CDN_PATH: '' 
	}
</script>




    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/common.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>







  </div>
</body>
</html>
