<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>[转]别学东学西了，先建立自己的知识体系吧</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#00796b">
  <meta name="msapplication-TileColor" content="#4E8071"/>
  
  
  
  
  <link rel="stylesheet" href="/css/style.css" type="text/css"> 
</head>


<body>

  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
  <header id="header" class="inner">
    <a href="/" class="profilepic">
      <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	</a>
	<p class="header-subtitle">分享有助于提升</p>
    <nav class="header-menu">
      <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li>
      </ul>
    </nav>
  </header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  <div class="intrude-less">
    <header id="header" class="inner">
      <a href="/" class="profilepic">
        <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	  </a>
	  <p class="header-subtitle">分享有助于提升</p>
	  <nav class="header-menu">
	    <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li><div class="clearfix"></div>
		</ul>
	  </nav>
	</header>				
  </div>
</nav>

      <div class="body-wrap">
<article id="post-转-别学东学西了，先建立自己的知识体系吧" class="article article-type-post" itemscope itemprop="blogPost">

   
    
    <div class="article-meta">
      
<div class="article-date">
<span class="datetime-published-tag"> 2015-10-13 </span>
</div>


    </div>
    
    
  
  <div class="article-inner block-select">
  
    
    
      <header class="article-header">
        
           
  
    <h1 class="article-title" itemprop="name">
      [转]别学东学西了，先建立自己的知识体系吧
    </h1>
  

        
      </header>
      
      <div class="article-info article-info-post">
        
	<div class="article-tag tagcloud block-select">
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/知识管理/">知识管理</a></li></ul>
	</div>


        
             <div class="clearfix"></div>
        
      </div>
      
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <!-- toc -->
<ul>
<li><a href="#&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x4ECE;&#x4E3A;&#x4EC0;&#x4E48;&#x5F00;&#x59CB;">&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x4ECE;&#x4E3A;&#x4EC0;&#x4E48;&#x5F00;&#x59CB;</a><ul>
<li><a href="#&#xFF08;1&#xFF09;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x53BB;&#x5B66;&#x4E60;&#xFF1F;">&#xFF08;1&#xFF09;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x53BB;&#x5B66;&#x4E60;&#xFF1F;</a></li>
<li><a href="#&#xFF08;2&#xFF09;&#x6211;&#x8BE5;&#x600E;&#x4E48;&#x5B66;&#x4E60;&#xFF1F;">&#xFF08;2&#xFF09;&#x6211;&#x8BE5;&#x600E;&#x4E48;&#x5B66;&#x4E60;&#xFF1F;</a></li>
<li><a href="#&#xFF08;3&#xFF09;&#x6211;&#x8981;&#x5B66;&#x4EC0;&#x4E48;&#xFF1F;">&#xFF08;3&#xFF09;&#x6211;&#x8981;&#x5B66;&#x4EC0;&#x4E48;&#xFF1F;</a></li>
</ul>
</li>
<li><a href="#&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x83B7;&#x53D6;">&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x83B7;&#x53D6;</a></li>
<li><a href="#&#x7B2C;&#x4E09;&#x6B65;:&#x77E5;&#x8BC6;&#x7684;&#x6574;&#x7406;&#x548C;&#x4FDD;&#x5B58;">&#x7B2C;&#x4E09;&#x6B65;:&#x77E5;&#x8BC6;&#x7684;&#x6574;&#x7406;&#x548C;&#x4FDD;&#x5B58;</a></li>
<li><a href="#&#x7B2C;&#x56DB;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x5206;&#x4EAB;">&#x7B2C;&#x56DB;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x5206;&#x4EAB;</a></li>
<li><a href="#&#x7B2C;&#x4E94;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x5229;&#x7528;">&#x7B2C;&#x4E94;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x5229;&#x7528;</a></li>
<li><a href="#&#x7B2C;&#x516D;&#x6B65;&#xFF1A;&#x521B;&#x65B0;&#x81E3;&#x59BE;&#x505A;&#x4E0D;&#x5230;&#x554A;">&#x7B2C;&#x516D;&#x6B65;&#xFF1A;&#x521B;&#x65B0;&#x81E3;&#x59BE;&#x505A;&#x4E0D;&#x5230;&#x554A;</a></li>
<li><a href="#&#x7B2C;&#x4E03;&#x6B65;&#xFF1A;&#x56DE;&#x5230;&#x539F;&#x70B9;">&#x7B2C;&#x4E03;&#x6B65;&#xFF1A;&#x56DE;&#x5230;&#x539F;&#x70B9;</a></li>
<li><a href="#&#x603B;&#x7ED3;&#xFF1A;">&#x603B;&#x7ED3;&#xFF1A;</a></li>
</ul>
<!-- tocstop -->
<p>&#x6211;&#x4EEC;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x63A5;&#x53D7;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x6587;&#x7AE0;&#x8F70;&#x70B8;&#xFF0C;&#x6211;&#x4EEC;&#x70B9;&#x8D5E;&#x3001;&#x8F6C;&#x53D1;&#xFF0C;&#x751A;&#x81F3;&#x4FDD;&#x5B58;&#x3002;&#x7136;&#x540E;&#x5462;&#xFF0C;&#x6211;&#x4EEC;&#x4E3A;&#x4E86;&#x4EC0;&#x4E48;&#x5B66;&#x4E60;&#xFF1F;</p>
<p>&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x6709;&#x597D;&#x591A;&#x4E1C;&#x897F;&#x8981;&#x5B66;&#xFF0C;&#x4F46;&#x662F;&#x54EA;&#x4E9B;&#x5BF9;&#x6211;&#x4EEC;&#x6709;&#x4EF7;&#x503C;&#x5462;&#xFF1F;&#x54EA;&#x4E9B;&#x6295;&#x8D44;&#x56DE;&#x62A5;&#x7387;&#x4E0D;&#x9AD8;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x7684;&#x6807;&#x51C6;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x6211;&#x4EEC;&#x597D;&#x50CF;&#x61C2;&#x5F97;&#x4E86;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x662F;&#x522B;&#x4EBA;&#x4E00;&#x95EE;&#xFF0C;&#x6211;&#x4EEC;&#x5374;&#x8BB2;&#x4E0D;&#x51FA;&#x6765;&#xB7;&#xB7;&#xB7; &#xB7;&#xB7;&#xB7;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x804C;&#x573A;&#x6838;&#x5FC3;&#x7ADE;&#x4E89;&#x529B;&#x771F;&#x7684;&#x6709;&#x4E48;&#xFF1F;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x5EFA;&#x7ACB;&#x8D77;&#x6765;&#xFF1F;</p>
<p>&#x8EAB;&#x5904;&#x7684;&#x884C;&#x4E1A;&#x6216;&#x8005;&#x516C;&#x53F8;&#x5373;&#x4F7F;&#x6700;&#x5927;&#xFF0C;&#x4E5F;&#x968F;&#x65F6;&#x53EF;&#x80FD;&#x5012;&#x95ED;&#xFF0C;&#x5982;&#x679C;&#x7EC4;&#x7EC7;&#x9760;&#x4E0D;&#x4F4F;&#xFF0C;&#x4F60;&#x662F;&#x5426;&#x5177;&#x5907;&#x4E86;&#x4E0D;&#x4F9D;&#x8D56;&#x7684;&#x80FD;&#x529B;&#xFF1F;</p>
<p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x662F;&#x6211;&#x5BF9;&#x81EA;&#x5DF1;&#x8FD9;&#x6BB5;&#x65F6;&#x671F;&#x7684;&#x5B66;&#x4E60;&#x4F53;&#x4F1A;&#x505A;&#x7684;&#x4E00;&#x4E2A;&#x68B3;&#x7406;&#xFF0C;&#x4E5F;&#x8BD5;&#x56FE;&#x6765;&#x89E3;&#x7B54;&#x4EE5;&#x4E0A;&#x4F60;&#x53EF;&#x80FD;&#x4E5F;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<a id="more"></a>
<p><font size="4"><strong>&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x770B;&#x6587;&#x7AE0;&#x7684;&#xFF0C;&#x76F4;&#x63A5;&#x770B;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#xFF0C;&#x518D;&#x53BB;&#x770B;&#x7ED3;&#x5C3E;&#x7C97;&#x4F53;&#x5B57;&#xFF0C;&#x7136;&#x540E;&#x70B9;&#x8D5E;&#x6253;&#x8D4F;&#x5C31;&#x53EF;&#x4EE5;&#xFF0C;&#x4E48;&#x4E48;&#x54D2;ORZ&#xFF1A;</strong></font><br><br></p>
<center><img src="http://ww1.sinaimg.cn/large/62b0904dgw1ewziuyyocwj20yg1ijai2.jpg" alt=""></center>

<h2 id="&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x4ECE;&#x4E3A;&#x4EC0;&#x4E48;&#x5F00;&#x59CB;"><a href="#&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x4ECE;&#x4E3A;&#x4EC0;&#x4E48;&#x5F00;&#x59CB;" class="headerlink" title="&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x4ECE;&#x4E3A;&#x4EC0;&#x4E48;&#x5F00;&#x59CB;"></a>&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x4ECE;&#x4E3A;&#x4EC0;&#x4E48;&#x5F00;&#x59CB;</h2><p>&#x5EFA;&#x7ACB;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF0C;&#x5C31;&#x50CF;&#x4ECE;&#x4E00;&#x4E2A;&#x56DB;&#x6D77;&#x4E3A;&#x5BB6;&#x7684;&#x4EBA;&#x5230;&#x7ED9;&#x81EA;&#x5DF1;&#x5EFA;&#x4E00;&#x680B;&#x5B89;&#x5C45;&#x7684;&#x623F;&#x5B50;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5148;&#x95EE;&#x95EE;&#x81EA;&#x5DF1;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x6837;&#x505A;&#xFF1F;&#x6784;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x6838;&#x5FC3;&#x4EF7;&#x503C;&#x4E48;&#xFF1F;&#x8FD9;&#x53E5;&#x8BDD;&#x5728;&#x804C;&#x4E1A;&#x89C4;&#x5212;&#x4E2D;&#x8001;&#x751F;&#x5E38;&#x8C08;&#x4E86;&#xFF0C;&#x4F60;&#x6709;&#x4E48;&#xFF1F;</p>
<h3 id="&#xFF08;1&#xFF09;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x53BB;&#x5B66;&#x4E60;&#xFF1F;"><a href="#&#xFF08;1&#xFF09;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x53BB;&#x5B66;&#x4E60;&#xFF1F;" class="headerlink" title="&#xFF08;1&#xFF09;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x53BB;&#x5B66;&#x4E60;&#xFF1F;"></a>&#xFF08;1&#xFF09;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x53BB;&#x5B66;&#x4E60;&#xFF1F;</h3><p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x201C;&#x529F;&#x5229;&#x201D;&#x7684;&#x6210;&#x4EBA;&#x5B66;&#x4E60;&#x8005;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x77E5;&#x8BC6;&#x80FD;&#x5E26;&#x7ED9;&#x6211;&#x4EF7;&#x503C;&#xFF0C;&#x90A3;&#x4EF7;&#x503C;&#x4F53;&#x73B0;&#x53C8;&#x5728;&#x54EA;&#x91CC;&#x5462;&#xFF1F;&#x4F53;&#x73B0;&#x5728;&#x8D44;&#x6E90;&#x3001;&#x4EBA;&#x8109;&#x3001;&#x91D1;&#x94B1;&#x8FD8;&#x6709;&#x81EA;&#x4FE1;&#x3002;&#x7279;&#x522B;&#x662F;&#x6211;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4ECE;&#x5317;&#x6F02;&#x8F6C;&#x5230;&#x4E09;&#x7EBF;&#x5C0F;&#x57CE;&#x7684;&#x5B69;&#x7EB8;&#xFF0C;&#x6211;&#x4E0D;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x5C31;&#x53EA;&#x80FD;&#x62FF;&#x4E09;&#x7EBF;&#x57CE;&#x5E02;&#x7684;&#x5E73;&#x5747;&#x5DE5;&#x8D44;&#xB7;&#xB7;&#xB7; &#xB7;&#xB7;&#xB7;&#x62FF;&#x5230;IPO&#x51FA;&#x4EFB;CEO&#x8D62;&#x53D6;&#x767D;&#x5BCC;&#x7F8E;&#x8D70;&#x4E0A;&#x4EBA;&#x751F;&#x5DC5;&#x5CF0;&#x96BE;&#x9053;&#x53EA;&#x80FD;&#x5728;&#x65E9;&#x4E5D;&#x665A;&#x4E94;&#x5728;&#x683C;&#x5B50;&#x95F4;&#x91CC;&#x9760;&#x8FD0;&#x6C14;&#x4E48;&#xFF1F;<br><br></p>
<center><img src="http://ww1.sinaimg.cn/mw690/62b0904dgw1ewziy77us6j20d108pwg7.jpg" alt=""><br><br><strong><em><font size="1" color="#878787">&#x884C;&#x52A8;&#x4ECE;&#x4E3A;&#x4EC0;&#x4E48;&#x5F00;&#x59CB;&#x7684;&#x201C;&#x9EC4;&#x91D1;&#x5708;&#x6CD5;&#x5219;&#x201D;</font></em></strong><br>&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;-</center>

<h3 id="&#xFF08;2&#xFF09;&#x6211;&#x8BE5;&#x600E;&#x4E48;&#x5B66;&#x4E60;&#xFF1F;"><a href="#&#xFF08;2&#xFF09;&#x6211;&#x8BE5;&#x600E;&#x4E48;&#x5B66;&#x4E60;&#xFF1F;" class="headerlink" title="&#xFF08;2&#xFF09;&#x6211;&#x8BE5;&#x600E;&#x4E48;&#x5B66;&#x4E60;&#xFF1F;"></a>&#xFF08;2&#xFF09;&#x6211;&#x8BE5;&#x600E;&#x4E48;&#x5B66;&#x4E60;&#xFF1F;</h3><p><strong>&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x5B66;&#x4E60;&#xFF1A;</strong>&#x5DE5;&#x4F5C;&#x4E2D;&#x79EF;&#x7D2F;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x4EFB;&#x52A1;&#xFF0C;&#x4E0E;&#x4EBA;&#x6C9F;&#x901A;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x540C;&#x4E8B;&#x4E4B;&#x95F4;&#x7684;&#x4F18;&#x79C0;&#x7684;&#x505A;&#x4E8B;&#x6280;&#x5DE7;&#x548C;&#x65B9;&#x5F0F;&#x3002;&#x6211;&#x5BF9;&#x529E;&#x516C;&#x5BA4;&#x653F;&#x6CBB;&#x7684;&#x654F;&#x611F;&#x5EA6;&#x4E3A;&#x96F6;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x4E13;&#x6CE8;&#x4E8E;&#x5DE5;&#x4F5C;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x907F;&#x514D;&#x4EBA;&#x4E8B;&#x95F4;&#x7684;&#x6D88;&#x8017;&#x3002;&#x63A8;&#x8350;&#x9605;&#x8BFB;&#x300A;&#x66FE;&#x56FD;&#x85E9;&#x7684;&#x6B63;&#x9762;&#x548C;&#x4FA7;&#x9762;&#x300B;&#x3002;</p>
<p><strong>&#x5728;&#x5DE5;&#x4F5C;&#x5916;&#x5B66;&#x4E60;&#xFF1A;</strong>&#x5229;&#x7528;&#x65E9;&#x4E0A;&#x548C;&#x665A;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x5B66;&#x4E60;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x6CA1;&#x6709;&#x8FC7;&#x591A;&#x5E72;&#x6270;&#xFF0C;&#x5927;&#x5757;&#x7684;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4E13;&#x6CE8;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;&#x5176;&#x4ED6;&#x96F6;&#x788E;&#x7684;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x7528;&#x505A;&#x9002;&#x5408;&#x96F6;&#x788E;&#x770B;&#x7684;&#x5185;&#x5BB9;&#xFF1A;&#x82F1;&#x8BED;&#xFF0C;&#x65B0;&#x95FB;&#x7B49;&#x3002;</p>
<h3 id="&#xFF08;3&#xFF09;&#x6211;&#x8981;&#x5B66;&#x4EC0;&#x4E48;&#xFF1F;"><a href="#&#xFF08;3&#xFF09;&#x6211;&#x8981;&#x5B66;&#x4EC0;&#x4E48;&#xFF1F;" class="headerlink" title="&#xFF08;3&#xFF09;&#x6211;&#x8981;&#x5B66;&#x4EC0;&#x4E48;&#xFF1F;"></a>&#xFF08;3&#xFF09;&#x6211;&#x8981;&#x5B66;&#x4EC0;&#x4E48;&#xFF1F;</h3><p>&#x901A;&#x8FC7;&#x4E0B;&#x56FE;&#x7684;&#x91D1;&#x5B57;&#x5854;&#xFF0C;&#x6211;&#x4F1A;&#x53D1;&#x73B0;&#x6211;&#x81EA;&#x5DF1;&#x73B0;&#x5728;&#x6BCF;&#x5929;&#x6B63;&#x5728;&#x5B66;&#x4E60;&#x548C;&#x575A;&#x6301;&#x7684;&#x662F;&#x5728;&#x54EA;&#x4E2A;&#x533A;&#x95F4;&#x91CC;&#x9762;&#xFF1A;<br><br></p>
<center><img src="http://ww3.sinaimg.cn/large/62b0904dgw1ewzj09d03sj20sg0g0aah.jpg" alt=""><br><strong><em><font size="1" color="#878787">&#x4F60;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x4E00;&#x8D77;&#x73A9;&#x5BF9;&#x4E48;&#xFF1F;</font></em></strong><br>&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;-</center>

<blockquote>
<p>&#x5BF9;&#x4E8E;&#x6210;&#x5E74;&#x540E;&#x7684;&#x77E5;&#x8BC6;&#x5DE5;&#x4F5C;&#x8005;&#xFF0C;&#x5982;&#x4F55;&#x63D0;&#x9AD8;&#x91D1;&#x5B57;&#x5854;&#x7684;&#x9AD8;&#x5EA6;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5373;<strong>&#x77E5;&#x8BC6;&#x5B66;&#x4E60;&#x8981;&#x805A;&#x7126;&#xFF0C;&#x9009;&#x4E2D;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x8D70;&#x4E0B;&#x53BB;&#xFF0C;&#x6301;&#x4E4B;&#x4EE5;&#x6052;&#x3002;</strong>&#x5BF9;&#x4E8E;&#x81EA;&#x5DF1;&#x4E0D;&#x64C5;&#x957F;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x4F60;&#x5C31;&#x9700;&#x8981;&#x77E5;&#x9053;&#x8C01;&#x64C5;&#x957F;&#xFF0C;&#x4E89;&#x53D6;&#x5F97;&#x5230;&#x522B;&#x4EBA;&#x7684;&#x534F;&#x52A9;&#x3002;&#x56E0;&#x4E3A;&#x6C34;&#x5E73;&#x6700;&#x9AD8;&#x7684;&#x4EBA;&#x5E76;&#x975E;&#x6240;&#x6709;&#x65B9;&#x9762;&#x7684;&#x6C34;&#x5E73;&#x90FD;&#x6700;&#x9AD8;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x77E5;&#x9053;&#x81EA;&#x5DF1;<strong>&#x64C5;&#x957F;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x3001;&#x7F3A;&#x5C11;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;</strong>&#x5145;&#x5206;&#x53D1;&#x6325;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x7D27;&#x5BC6;&#x8DDF;&#x540C;&#x4F34;&#x534F;&#x4F5C;&#x3002;-&#x738B;&#x5FD7;&#x521A;&#x300A;&#x4F60;&#x7684;&#x77E5;&#x8BC6;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x300B;</p>
</blockquote>
<p><strong>&#x603B;&#x4E4B;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x5B66;&#x90A3;&#x4E9B;&#x8BA9;&#x81EA;&#x5DF1;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x4E13;&#x4E1A;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#x91D1;&#x5B57;&#x5854;&#x53D8;&#x5F97;&#x66F4;&#x9AD8;&#x3002;</strong></p>
<h2 id="&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x83B7;&#x53D6;"><a href="#&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x83B7;&#x53D6;" class="headerlink" title="&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x83B7;&#x53D6;"></a>&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x83B7;&#x53D6;</h2><p>&#x641E;&#x6E05;&#x695A;&#x4E86;&#x76EE;&#x7684;&#xFF0C;&#x4E5F;&#x77E5;&#x9053;&#x4E86;&#x8981;&#x5B66;&#x4EC0;&#x4E48;&#xFF0C;&#x600E;&#x4E48;&#x5B66;&#x4E4B;&#x540E;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x5C31;&#x8981;&#x7406;&#x6E05;&#x695A;&#x6211;&#x80FD;&#x4ECE;&#x54EA;&#x91CC;&#x83B7;&#x53D6;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x8BF4;&#x7684;&#x662F;&#x77E5;&#x8BC6;&#xFF0C;&#x4E0D;&#x662F;&#x4FE1;&#x606F;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x6570;&#x636E;&#x3002;<strong>&#x77E5;&#x8BC6;&#x662F;&#x6211;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x505A;&#x7528;&#x7684;&#xFF0C;&#x800C;&#x4FE1;&#x606F;&#x548C;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x3002;</strong>&#x4F18;&#x8863;&#x5E93;&#x7684;&#x89C6;&#x9891;&#x548C;&#x90ED;&#x7F8E;&#x7F8E;&#x88AB;&#x5224;&#x5211;&#x7684;&#x4FE1;&#x606F;&#x5BF9;&#x6211;&#x4E00;&#x70B9;&#x7528;&#x90FD;&#x6CA1;&#x6709;&#xFF1B;&#x4F46;&#x662F;&#x5C0F;&#x7C73;&#x7684;&#x9965;&#x997F;&#x8425;&#x9500;&#x5374;&#x53EF;&#x4EE5;&#x88AB;&#x6211;&#x5229;&#x7528;&#xFF0C;&#x6210;&#x4E3A;&#x6211;&#x7684;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x77E5;&#x8BC6;&#x7684;&#x83B7;&#x53D6;&#x8FC7;&#x7A0B;&#x5305;&#x542B;&#x4E86;&#x7B5B;&#x9009;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x90A3;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x4ECE;&#x54EA;&#x91CC;&#x6765;&#x5462;&#xFF1F;</p>
<p><strong>1.&#x4E66;&#x672C;&#xFF1A;</strong>&#x5FEB;&#x901F;&#x9605;&#x8BFB;&#x548C;&#x4E3B;&#x9898;&#x9605;&#x8BFB;&#x7684;&#x65B9;&#x5F0F;&#x80FD;&#x8BA9;&#x6211;&#x5FEB;&#x901F;&#x638C;&#x63E1;&#x67D0;&#x4E00;&#x9886;&#x57DF;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5BF9;&#x4E8E;&#x7545;&#x9500;&#x7C7B;&#x7684;&#x5546;&#x4E1A;&#x4E66;&#x7C4D;&#x5176;&#x5B9E;&#x4E5F;&#x6709;&#x5B83;&#x7684;&#x53EF;&#x53D6;&#x4E4B;&#x5904;&#xFF0C;&#x4F60;&#x81F3;&#x5C11;&#x77E5;&#x9053;&#x4E86;&#x5F53;&#x4E0B;&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x8C08;&#x8BBA;&#x4EC0;&#x4E48;&#x3002;</p>
<p><strong>2.&#x5FAE;&#x535A;&#xFF1A;</strong>&#x6211;&#x5173;&#x6CE8;&#x7684;&#x5FAE;&#x535A;&#x7684;&#x6280;&#x672F;&#x7C7B;&#x5927;V&#x4EEC;&#x90FD;&#x5F88;&#x5C11;&#x53D1;&#x751F;&#x6D3B;&#x7C7B;&#x4FE1;&#x606F;&#xFF0C;&#x4ED6;&#x4EEC;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5E72;&#x8D27;&#x6587;&#x7AE0;&#x7684;&#x5206;&#x4EAB;&#x3002;</p>
<p><strong>3.&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#xFF1A;</strong>&#x4F18;&#x8D28;&#x7684;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x91CC;&#x9762;&#x7684;&#x6587;&#x7AE0;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x5F88;&#x5C11;&#x9E21;&#x6C64;&#xFF0C;&#x5F88;&#x5E72;&#x8D27;&#xFF1B;</p>
<p><strong>4.&#x7F51;&#x7EDC;&#x4E91;&#x8BFE;&#x5802;&#xFF1A;</strong>&#x600E;&#x4E48;&#x6837;&#x65E2;&#x80FD;&#x5B66;&#x5230;&#x4E1C;&#x897F;&#x53C8;&#x4E0D;&#x7528;&#x8DD1;&#x4E0A;&#x6D77;&#x5317;&#x4EAC;&#x5462;&#xFF0C;&#x90A3;&#x5C31;&#x53BB;&#x4E0A;&#x7F51;&#x7EDC;&#x4E91;&#x8BFE;&#x7A0B;&#x5427;&#x3002;</p>
<h2 id="&#x7B2C;&#x4E09;&#x6B65;:&#x77E5;&#x8BC6;&#x7684;&#x6574;&#x7406;&#x548C;&#x4FDD;&#x5B58;"><a href="#&#x7B2C;&#x4E09;&#x6B65;-&#x77E5;&#x8BC6;&#x7684;&#x6574;&#x7406;&#x548C;&#x4FDD;&#x5B58;" class="headerlink" title="&#x7B2C;&#x4E09;&#x6B65;:&#x77E5;&#x8BC6;&#x7684;&#x6574;&#x7406;&#x548C;&#x4FDD;&#x5B58;"></a>&#x7B2C;&#x4E09;&#x6B65;:&#x77E5;&#x8BC6;&#x7684;&#x6574;&#x7406;&#x548C;&#x4FDD;&#x5B58;</h2><p>&#x77E5;&#x8BC6;&#x7684;&#x6DD8;&#x6C70;&#x66F4;&#x65B0;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x77E5;&#x8BC6;&#x5DE5;&#x4F5C;&#x8005;&#xFF0C;&#x4E0D;&#x662F;&#x5386;&#x53F2;&#x5B66;&#x5BB6;&#xFF0C;&#x5F88;&#x591A;&#x4FE1;&#x606F;&#x751A;&#x81F3;&#x5728;&#x6211;&#x4EEC;&#x6536;&#x96C6;&#x5230;&#x624B;&#x4E4B;&#x540E;&#x5C31;&#x5DF2;&#x7ECF;&#x8FC7;&#x671F;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x679C;&#x65AD;&#x629B;&#x5F03;&#x6211;&#x4EEC;&#x5F53;&#x4E0B;&#x7528;&#x4E0D;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x7528;&#x65AD;&#x820D;&#x79BB;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x63D0;&#x9192;&#x6211;&#x4E0D;&#x8981;&#x56E4;&#x79EF;&#x201C;&#x80FD;&#x7528;&#x201D;&#x4F46;&#x662F;&#x5F53;&#x4E0B;&#x5BF9;&#x6211;&#x6CA1;&#x7528;&#x7684;&#x77E5;&#x8BC6;&#x5783;&#x573E;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6536;&#x96C6;&#x7684;&#x7D20;&#x6750;&#x548C;&#x8D44;&#x6599;&#xFF0C;&#x6211;&#x4F1A;&#x4FDD;&#x5B58;&#x5728;&#x4E24;&#x4E2A;&#x5730;&#x65B9;&#xFF1A;</p>
<p><strong>&#x7B2C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x662F;&#x7535;&#x8111;&#xFF0C;</strong>&#x901A;&#x8FC7;SVN&#x548C;VPN&#x6211;&#x8BA9;&#x5BB6;&#x4E2D;&#x7684;&#x7535;&#x8111;&#x548C;&#x516C;&#x53F8;&#x7535;&#x8111;&#x91CC;&#x7684;&#x6587;&#x4EF6;&#x4FDD;&#x6301;&#x540C;&#x6B65;&#x66F4;&#x65B0;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x6765;&#x56DE;&#x62F7;&#x8D1D;&#x7684;&#x9EBB;&#x70E6;&#x3002;<br><br></p>
<center><br><img src="http://ww4.sinaimg.cn/large/62b0904dgw1ewzjipt3v4j20nn0gf780.jpg" alt=""><br><strong><em><font size="1" color="#878787">SVN&#x80FD;&#x4FDD;&#x5B58;&#x6211;&#x7684;&#x6587;&#x6863;&#x6240;&#x6709;&#x7684;&#x5386;&#x53F2;&#x7248;&#x672C;</font></em></strong><br>&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;-</center>

<p><strong>&#x7B2C;&#x4E8C;&#x4E2A;&#x4F4D;&#x7F6E;&#x662F;&#x7F51;&#x7EDC;&#x7B14;&#x8BB0;&#xFF0C;</strong>&#x901A;&#x8FC7;&#x5370;&#x8C61;&#x7B14;&#x8BB0;&#x6211;&#x628A;&#x968F;&#x65F6;&#x968F;&#x5730;&#x91C7;&#x96C6;&#x7684;&#x4FE1;&#x606F;(&#x7167;&#x7247;&#xFF0C;&#x60F3;&#x6CD5;)&#x7B49;&#x901A;&#x8FC7;&#x624B;&#x673A;&#x4FDD;&#x5B58;&#xFF0C;&#x540C;&#x65F6;&#x8FD9;&#x4E9B;&#x8D44;&#x6599;&#x4F1A;&#x540C;&#x6B65;&#x5230;&#x6211;&#x7684;PC&#x7AEF;&#x53BB;&#x3002;<br><br></p>
<center><br><img src="http://ww4.sinaimg.cn/large/62b0904dgw1ewzjk8vg50j20rq0dh7b4.jpg" alt=""><br><strong><em><font size="1" color="#878787">&#x7F51;&#x7EDC;&#x7B14;&#x8BB0;&#x672C;&#x80FD;&#x968F;&#x65F6;&#x968F;&#x5730;&#x8BB0;&#x5F55;&#x60F3;&#x6CD5;&#x548C;&#x7D20;&#x6750;</font></em></strong><br>&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;-</center>

<h2 id="&#x7B2C;&#x56DB;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x5206;&#x4EAB;"><a href="#&#x7B2C;&#x56DB;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x5206;&#x4EAB;" class="headerlink" title="&#x7B2C;&#x56DB;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x5206;&#x4EAB;"></a>&#x7B2C;&#x56DB;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x5206;&#x4EAB;</h2><p><strong>&#x6559;&#x662F;&#x6700;&#x597D;&#x7684;&#x5B66;&#x4E60;&#xFF0C;</strong>&#x5B9E;&#x73B0;90%&#x7684;&#x77E5;&#x8BC6;&#x8F6C;&#x5316;&#xFF0C;&#x5206;&#x4EAB;&#x662F;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p><img src="http://ww2.sinaimg.cn/large/62b0904dgw1ewzjlch57pj20j60d63zg.jpg" alt=""></p>
<p>&#x90A3;&#x6709;&#x5C0F;&#x4F19;&#x4F34;&#x4F1A;&#x8BF4;&#xFF0C;&#x54CE;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x90FD;&#x6CA1;&#x5B66;&#x597D;&#xFF0C;&#x54EA;&#x6562;&#x63D0;&#x4EC0;&#x4E48;&#x5206;&#x4EAB;&#x5440;&#x3002;&#x4F60;&#x4E00;&#x5B9A;&#x8981;&#x7B49;&#x5230;&#x81EA;&#x5DF1;&#x5B66;&#x5BCC;&#x4E94;&#x8F66;&#xFF0C;&#x9971;&#x8179;&#x7ECF;&#x7EB6;&#x4E4B;&#x540E;&#x4F60;&#x624D;&#x6709;&#x52C7;&#x6C14;&#x505A;&#x5206;&#x4EAB;&#x5417;&#xFF1F;&#x6211;&#x5728;&#x7B80;&#x4E66;&#x4E0A;&#x5206;&#x4EAB;&#x4E86;40&#x51E0;&#x7BC7;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#xFF0C;&#x6BCF;&#x4E00;&#x7BC7;&#x90FD;&#x5ED6;&#x6709;&#x4EBA;&#x95EE;&#x6D25;&#xFF0C;&#x70B9;&#x4E2A;&#x8D5E;&#x7684;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x8FD9;&#x6837;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5206;&#x4EAB;&#x554A;&#xFF0C;&#x5206;&#x4EAB;&#x7684;&#x8FC7;&#x7A0B;&#x6211;&#x4EEC;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#x8F93;&#x51FA;&#xFF0C;&#x4F60;&#x53EA;&#x8981;&#x80FD;&#x627E;&#x5230;&#x8F93;&#x51FA;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5C31;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x4EBA;&#x56DE;&#x5E94;&#x4F60;&#x7684;&#x3002;</p>
<p>&#x516C;&#x53F8;&#x5185;&#x90E8;&#x57F9;&#x8BAD;&#xFF0C;&#x90E8;&#x95E8;&#x5185;&#x90E8;&#x5206;&#x4EAB;&#xFF0C;&#x7F51;&#x7EDC;&#x5206;&#x4EAB;&#xFF0C;&#x6587;&#x7AE0;&#x5206;&#x4EAB;&#xFF0C;&#x77E5;&#x4E4E;&#x95EE;&#x7B54;&#xFF0C;&#x767E;&#x5EA6;&#x77E5;&#x9053;&#xFF0C;&#x80FD;&#x5206;&#x4EAB;&#x7684;&#x5730;&#x65B9;&#x592A;&#x591A;&#x4E86;&#x3002;&#x5BF9;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x68C0;&#x9A8C;&#x4F60;&#x5230;&#x5E95;&#x61C2;&#x4E0D;&#x61C2;&#x7684;&#x771F;&#x6B63;&#x6218;&#x573A;&#x3002;<br><br></p>
<center><br><img src="http://ww2.sinaimg.cn/large/62b0904dgw1ewzjlywh8kj20go0b2ab3.jpg" alt=""><br><strong><em><font size="1" color="#878787">&#x60F3;&#x5C3D;&#x529E;&#x6CD5;&#x8BA9;&#x522B;&#x4EBA;&#x77E5;&#x9053;&#x4F60;&#x77E5;&#x9053;</font></em></strong><br>&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;-</center>

<h2 id="&#x7B2C;&#x4E94;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x5229;&#x7528;"><a href="#&#x7B2C;&#x4E94;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x5229;&#x7528;" class="headerlink" title="&#x7B2C;&#x4E94;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x5229;&#x7528;"></a>&#x7B2C;&#x4E94;&#x6B65;&#xFF1A;&#x77E5;&#x8BC6;&#x7684;&#x5229;&#x7528;</h2><p>&#x4EFB;&#x4F55;&#x77E5;&#x8BC6;&#x5982;&#x679C;&#x5BF9;&#x4F60;&#x65E0;&#x7528;&#xFF0C;&#x5C31;&#x662F;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x6536;&#x96C6;&#xFF0C;&#x6574;&#x7406;&#x548C;&#x5206;&#x4EAB;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x5C06;&#x9690;&#x6027;&#x77E5;&#x8BC6;&#x8F6C;&#x5316;&#x4E3A;&#x663E;&#x6027;&#x7684;&#x77E5;&#x8BC6;&#x4E86;&#xFF0C;&#x4E0D;&#x5149;&#x4F60;&#x7684;&#x5927;&#x8111;&#x91CC;&#x6709;&#xFF0C;&#x4F60;&#x8FD8;&#x80FD;SHOW&#x51FA;&#x6765;&#xFF0C;&#x5DE5;&#x4F5C;&#x5F53;&#x4E2D;&#x4E0D;&#x6B63;&#x9700;&#x8981;&#x4F60;&#x8FD9;&#x6837;&#x7684;&#x4F19;&#x4F34;&#x4E48;&#xFF1F;</p>
<p>&#x6211;&#x4E5F;&#x7ECF;&#x5E38;&#x628A;&#x5B66;&#x5230;&#x7684;&#x5DE5;&#x4F5C;&#x6280;&#x80FD;&#x7528;&#x5230;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;&#x6709;&#x4E00;&#x5929;&#x65E9;&#x4E0A;&#x770B;&#x300A;&#x89C6;&#x89C9;&#x5316;&#x4F60;&#x7684;&#x4F1A;&#x8BAE;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x53D1;&#x73B0;&#x786E;&#x5B9E;&#x5982;&#x679C;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x7528;&#x753B;&#x7B14;&#xFF0C;&#x7528;&#x8D34;&#x4FBF;&#x7B7E;&#x8BA8;&#x8BBA;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6548;&#x679C;&#x5E94;&#x8BE5;&#x4F1A;&#x4E0D;&#x9519;&#x3002;&#x4E8E;&#x662F;&#x4E0B;&#x5348;&#x7684;&#x4F1A;&#x8BAE;&#x6211;&#x4EEC;&#x5C31;&#x5C1D;&#x8BD5;&#x4E86;&#x4E00;&#x628A;&#xFF1A;</p>
<p><img src="http://ww3.sinaimg.cn/large/62b0904dgw1ewzjnhsxanj20ni0db414.jpg" alt=""></p>
<p>&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x5229;&#x7528;&#x4F60;&#x6240;&#x5B66;&#x5230;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x65E2;&#x80FD;&#x8BA9;&#x9A8C;&#x8BC1;&#x6240;&#x5B66;&#xFF0C;&#x8FD8;&#x80FD;&#x63D0;&#x9AD8;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#xFF0C;&#x4F55;&#x4E50;&#x800C;&#x4E0D;&#x4E3A;&#x5462;&#x3002;&#x4E0D;&#x8981;&#x5FD8;&#x54AF;&#xFF0C;&#x6211;&#x4EEC;&#x6210;&#x4EBA;&#x5B66;&#x7684;&#x6700;&#x7EC8;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x5DE5;&#x4F5C;&#x561B;&#x3002;&#xFF08;&#x4E3A;&#x4E86;&#x8BD7;&#x548C;&#x8FDC;&#x65B9;&#x4E48;&#xFF0C;&#x6EDA;&#x728A;&#x5B50;~&#xFF01;&#xFF09;</p>
<h2 id="&#x7B2C;&#x516D;&#x6B65;&#xFF1A;&#x521B;&#x65B0;&#x81E3;&#x59BE;&#x505A;&#x4E0D;&#x5230;&#x554A;"><a href="#&#x7B2C;&#x516D;&#x6B65;&#xFF1A;&#x521B;&#x65B0;&#x81E3;&#x59BE;&#x505A;&#x4E0D;&#x5230;&#x554A;" class="headerlink" title="&#x7B2C;&#x516D;&#x6B65;&#xFF1A;&#x521B;&#x65B0;&#x81E3;&#x59BE;&#x505A;&#x4E0D;&#x5230;&#x554A;"></a>&#x7B2C;&#x516D;&#x6B65;&#xFF1A;&#x521B;&#x65B0;&#x81E3;&#x59BE;&#x505A;&#x4E0D;&#x5230;&#x554A;</h2><p>&#x521B;&#x65B0;&#x5176;&#x5B9E;&#x6CA1;&#x6709;&#x6211;&#x4EEC;&#x60F3;&#x8C61;&#x7684;&#x90A3;&#x4E48;&#x96BE;&#xFF0C;&#x4F46;&#x4E5F;&#x6CA1;&#x6709;&#x6211;&#x4EEC;&#x60F3;&#x8C61;&#x7684;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x3002;&#x4F60;&#x770B;&#x4E00;&#x5806;&#x521B;&#x65B0;&#x7C7B;&#x7684;&#x4E66;&#x7C4D;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5B9E;&#x73B0;&#x521B;&#x65B0;&#x7684;&#xFF0C;&#x5C31;&#x50CF;&#x4F60;&#x770B;&#x5B8C;&#x5916;&#x79D1;&#x624B;&#x672F;&#x7684;&#x6559;&#x5B66;&#x89C6;&#x9891;&#xFF0C;&#x4F60;&#x8FD8;&#x662F;&#x4E0D;&#x4F1A;&#x52A8;&#x624B;&#x672F;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x51FA;&#x4E86;&#x5C5E;&#x4E8E;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF0C;&#x521B;&#x65B0;&#x5C31;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x7EDF;&#x7684;&#x5404;&#x4E2A;&#x6A21;&#x5757;&#x524D;&#x7684;&#x8DE8;&#x754C;&#x7EC4;&#x5408;&#x3002;I ONLY SEE WHAT I SEE&#xFF1B;&#x6211;&#x4EEC;&#x7684;&#x521B;&#x65B0;&#x6E90;&#x4E8E;&#x6211;&#x4EEC;&#x5DF2;&#x77E5;&#x7684;&#x4E16;&#x754C;&#x3002;&#x4F60;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x8D8A;&#x5065;&#x58EE;&#x3001;&#x8D8A;&#x4E30;&#x6EE1;&#x3001;&#x8D8A;&#x7ECF;&#x5E38;&#x66F4;&#x65B0;&#xFF0C;&#x521B;&#x65B0;&#x5C31;&#x4F1A;&#x662F;&#x4E00;&#x4EF6;&#x5C0F;&#x4E8B;&#x3002;</p>
<h2 id="&#x7B2C;&#x4E03;&#x6B65;&#xFF1A;&#x56DE;&#x5230;&#x539F;&#x70B9;"><a href="#&#x7B2C;&#x4E03;&#x6B65;&#xFF1A;&#x56DE;&#x5230;&#x539F;&#x70B9;" class="headerlink" title="&#x7B2C;&#x4E03;&#x6B65;&#xFF1A;&#x56DE;&#x5230;&#x539F;&#x70B9;"></a>&#x7B2C;&#x4E03;&#x6B65;&#xFF1A;&#x56DE;&#x5230;&#x539F;&#x70B9;</h2><p>&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x5230;&#x6700;&#x521D;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x9EC4;&#x91D1;&#x5708;&#x6CD5;&#x5219;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x524D;&#x9762;&#x7684;&#x516D;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x6211;&#x60F3;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x81EA;&#x5DF1;&#x6B63;&#x5728;&#x5B66;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x60F3;&#x8981;&#x5B66;&#x7684;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x5B9A;&#x4F4D;&#x4E86;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x4E0B;&#x56FE;&#x6211;&#x81EA;&#x5DF1;&#x6574;&#x7406;&#x81EA;&#x5DF1;&#x7684;&#xFF1A;<br><br></p>
<center><br><img src="http://ww2.sinaimg.cn/large/62b0904dgw1ewzjoi2augj20yo0ouwht.jpg" alt=""><br><strong><em><font size="1" color="#878787">&#x5EFA;&#x7ACB;&#x4E2A;&#x4EBA;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF0C;&#x5BF9;&#x5728;&#x5B66;&#x4E60;&#x7684;&#x548C;&#x8981;&#x5B66;&#x4E60;&#x7684;&#x8FDB;&#x884C;&#x6574;&#x7406;</font></em></strong><br>&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;-</center>

<p>&#x5C31;&#x50CF;&#x4E00;&#x680B;&#x5927;&#x697C;&#x7684;&#x5EFA;&#x8BBE;&#x4E00;&#x6837;&#xFF0C;&#x5148;&#x6709;&#x9AA8;&#x67B6;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x6709;&#x5927;&#x53A6;&#xFF1A;</p>
<p><strong>&#x4E3A;&#x4EC0;&#x4E48;&#x9636;&#x6BB5;:</strong> &#x6211;&#x7740;&#x91CD;&#x953B;&#x70BC;&#x7684;&#x63D0;&#x95EE;&#x80FD;&#x529B;&#x548C;&#x903B;&#x8F91;&#x601D;&#x8003;&#x80FD;&#x529B;&#xFF1B;</p>
<p><strong>&#x83B7;&#x53D6;&#x9636;&#x6BB5;&#xFF1A;</strong>&#x6211;&#x7EC3;&#x4E60;&#x5FEB;&#x901F;&#x9605;&#x8BFB;&#x548C;&#x4E3B;&#x9898;&#x9605;&#x8BFB;&#xFF0C;&#x5B66;&#x4E60;&#x5927;V&#x4EEC;&#x7684;&#x8BFB;&#x4E66;&#x65B9;&#x6CD5;&#xFF1B;</p>
<p><strong>&#x6574;&#x7406;&#x9636;&#x6BB5;&#xFF1A;</strong>&#x5B66;&#x4E60;&#x65F6;&#x95F4;&#x7BA1;&#x7406;&#x3001;&#x7CBE;&#x529B;&#x7BA1;&#x7406;&#xFF0C;&#x65AD;&#x820D;&#x79BB;&#xFF0C;&#x5982;&#x4F55;&#x505A;&#x753B;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#xFF0C;&#x5982;&#x4F55;&#x505A;&#x7B14;&#x8BB0;&#x8BB0;&#x5F55;&#xFF1B;</p>
<p><strong>&#x5206;&#x4EAB;&#x9636;&#x6BB5;&#xFF1A;</strong>&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5199;&#x51FA;&#x5438;&#x5F15;&#x4EBA;&#x7684;&#x6587;&#x6848;&#xFF0C;&#x5982;&#x4F55;&#x505A;&#x597D;PPT&#x6765;&#x5C55;&#x793A;&#xFF0C;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x884C;&#x52A8;&#x5B66;&#x4E60;&#x548C;NLP&#x6765;&#x8BA9;&#x5206;&#x4EAB;&#x8FC7;&#x7A0B;&#x66F4;&#x52A0;&#x6709;&#x6D3B;&#x529B;&#xFF1B;</p>
<p><strong>&#x5229;&#x7528;&#x9636;&#x6BB5;&#xFF1A;</strong>&#x4E3B;&#x8981;&#x662F;&#x5728;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x4E2D;&#x5B9E;&#x8DF5;&#xFF0C;&#x5E76;&#x5B66;&#x4E60;&#x7ED3;&#x6784;&#x601D;&#x8003;&#x80FD;&#x529B;&#xFF0C;&#x5728;&#x6C47;&#x62A5;&#x3001;&#x6C9F;&#x901A;&#x4E2D;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF1B;</p>
<p><strong>&#x521B;&#x65B0;&#x9636;&#x6BB5;&#xFF1A;</strong>&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5EFA;&#x7ACB;&#x4E2A;&#x4EBA;&#x54C1;&#x724C;&#xFF0C;&#x5B66;&#x4E60;&#x60F3;&#x5230;&#x4E00;&#x4E2A;&#x70B9;&#x5B50;&#x4E4B;&#x540E;&#xFF0C;&#x5982;&#x4F55;&#x5FEB;&#x901F;&#x6210;&#x578B;&#xFF0C;&#x5982;&#x4F55;&#x53BB;&#x8BD5;&#x9519;&#xFF1B;&#x8FD9;&#x4E9B;&#x70B9;&#x5B50;&#x6709;&#x5982;&#x4F55;&#x80FD;&#x5E94;&#x7528;&#x5728;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x2014;&#x2014;&#x5176;&#x5B9E;&#xFF0C;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x521B;&#x4E1A;&#x3002;</p>
<blockquote>
<p>&#x5EFA;&#x7ACB;&#x4E2A;&#x4EBA;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x4E4B;&#x540E;&#xFF0C;&#x5927;&#x53A6;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x5EFA;&#x6210;&#x4E86;</p>
</blockquote>
<p>&#x901A;&#x8FC7;&#x4EE5;&#x4E0A;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x76EE;&#x524D;&#x6211;&#x521D;&#x6B65;&#x5EFA;&#x7ACB;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F53;&#x7CFB;&#x80FD;&#x4FDD;&#x8BC1;&#x6211;&#x5728;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x8BE5;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x6280;&#x80FD;&#xFF0C;&#x8BE5;&#x63D0;&#x9AD8;&#x4EC0;&#x4E48;&#xFF1B;&#x4E5F;&#x4FDD;&#x8BC1;&#x4E86;&#x6211;&#x5B9E;&#x73B0;&#x201C;&#x4E24;&#x5C0F;&#x65F6;&#x9AD8;&#x94C1;&#x751F;&#x6D3B;&#x5708;&#x201D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x81EA;&#x5E26;&#x7CFB;&#x7EDF;&#x968F;&#x65F6;&#x548C;&#x5927;&#x57CE;&#x5E02;&#x7684;&#x4EBA;&#x7FA4;&#x3001;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x94FE;&#x63A5;&#xFF0C;&#x968F;&#x5904;&#x63D2;&#x62D4;&#x3002;&#x800C;&#x5728;&#x8FD9;&#x4E9B;&#x4E0E;&#x5DE5;&#x4F5C;&#x4E0E;&#x751F;&#x6D3B;&#x7684;&#x94FE;&#x63A5;&#x4E2D;&#xFF0C;&#x6211;&#x53C8;&#x5728;&#x4E0D;&#x65AD;&#x66F4;&#x65B0;&#x6211;&#x7684;U&#x76D8;&#x7CFB;&#x7EDF;&#xFF0C;&#x4FDD;&#x8BC1;&#x81EA;&#x5DF1;&#x4E0D;&#x88AB;&#x6DD8;&#x6C70;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;&#xFF1A;"><a href="#&#x603B;&#x7ED3;&#xFF1A;" class="headerlink" title="&#x603B;&#x7ED3;&#xFF1A;"></a>&#x603B;&#x7ED3;&#xFF1A;</h2><p><strong>&#x4E92;&#x8054;&#x7F51;&#x601D;&#x7EF4;&#x4E0D;&#x662F;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x662F;&#x4E16;&#x754C;&#x89C2;&#x3002;</strong>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x6784;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x4E86;&#x3002;</p>
<p>&#x613F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x50CF;&#x4E00;&#x4E2A;U&#x76D8;&#x4E00;&#x6837;&#xFF0C;&#x81EA;&#x5E26;&#x7CFB;&#x7EDF;&#x968F;&#x5904;&#x63D2;&#x62D4;&#x3002;</p>
<p>&#x613F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x548C;&#x522B;&#x4EBA;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p>
<blockquote>
<p>&#x539F;&#x6587;&#x5730;&#x5740;: <a href="http://www.jianshu.com/p/6f56ab9597f5" target="_blank" rel="external">http://www.jianshu.com/p/6f56ab9597f5</a> &#x7248;&#x6743;&#x5F52;&#x539F;&#x6587;&#x4F5C;&#x8005;&#x6240;&#x6709;</p>
</blockquote>

      
      
      
        <div class="post-copyright">
<p><a href="http://www.ithome.me/archives/转-别学东学西了，先建立自己的知识体系吧/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年10月13日 15:10</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav" class="block-select">
  
    <a href="/archives/copy-Android开发必知Tip/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          [copy]Android开发必知Tip
        
      </div>
    </a>
  
  
    <a href="/archives/RecyclerView基础教程/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">RecyclerView 基础教程</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer" class="block-select">
  <div class="outer">
    <div id="footer-info">
      <div class="footer-left">&copy; 2015-2018
        Simon.Chen
      </div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {fancybox: false,mathjax: false,animate: false,isHome: false,isPost: true,isArchive: false,isTag: false,isCategory: false,open_in_new: true, CDN_PATH: '' }
</script>


    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/base.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>





  </div>
</body>
</html>
