<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>广东移动携全球首创技术“护航”手机安全 | IT驿站</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#4f6b79">
  <meta name="msapplication-TileColor" content="#4f6b79"/>
  
  
  <meta name="description" content="&amp;#x4E2D;&amp;#x56FD;&amp;#x7ECF;&amp;#x6D4E;&amp;#x7F51;8&amp;#x6708;26&amp;#x65E5;&amp;#x8BAF; (&amp;#x8BB0;&amp;#x8005; &amp;#x5E9E;&amp;#x5F69;&amp;#x971E;) &amp;#x8BB0;&amp;#x8005;&amp;#x83B7;&amp;#x6089;&amp;#xFF0C;&amp;#x4E2D;&amp;#x56FD;&amp;#x79FB;&amp;#x52A8;&amp;#x5E7F;&amp;#x4E1C;">
<meta property="og:type" content="article">
<meta property="og:title" content="广东移动携全球首创技术“护航”手机安全">
<meta property="og:url" content="http://www.ithome.me/archives/广东移动携全球首创技术“护航”手机安全/index.html">
<meta property="og:site_name" content="IT驿站">
<meta property="og:description" content="&amp;#x4E2D;&amp;#x56FD;&amp;#x7ECF;&amp;#x6D4E;&amp;#x7F51;8&amp;#x6708;26&amp;#x65E5;&amp;#x8BAF; (&amp;#x8BB0;&amp;#x8005; &amp;#x5E9E;&amp;#x5F69;&amp;#x971E;) &amp;#x8BB0;&amp;#x8005;&amp;#x83B7;&amp;#x6089;&amp;#xFF0C;&amp;#x4E2D;&amp;#x56FD;&amp;#x79FB;&amp;#x52A8;&amp;#x5E7F;&amp;#x4E1C;">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2015-07-28T08:33:49.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="广东移动携全球首创技术“护航”手机安全">
<meta name="twitter:description" content="&amp;#x4E2D;&amp;#x56FD;&amp;#x7ECF;&amp;#x6D4E;&amp;#x7F51;8&amp;#x6708;26&amp;#x65E5;&amp;#x8BAF; (&amp;#x8BB0;&amp;#x8005; &amp;#x5E9E;&amp;#x5F69;&amp;#x971E;) &amp;#x8BB0;&amp;#x8005;&amp;#x83B7;&amp;#x6089;&amp;#xFF0C;&amp;#x4E2D;&amp;#x56FD;&amp;#x79FB;&amp;#x52A8;&amp;#x5E7F;&amp;#x4E1C;">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link rel="stylesheet" href="/css/style.css" type="text/css"> 
  

</head>

<body>
  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			
		</a>
		
		<p class="header-subtitle">分享有助于提升</p>
		
        <nav class="header-menu">
            <ul>
                
                    <li><a href="/">主页</a></li>
                
                    <li><a href="/archives">所有文章</a></li>
                
                    <li><a href="/categories/移动开发">移动开发</a></li>
                
                    <li><a href="/about-me">关于我</a></li>
                
            </ul>
        </nav>
	</header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
	<div class="intrude-less">
		<header id="header" class="inner">
			<a href="/" class="profilepic">
                
			        <img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			    
			</a>
			<!-- <hgroup>
			  <h1 class="header-author">Simon.Chen</h1>
			</hgroup>-->
			
			<p class="header-subtitle">分享有助于提升</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
					<li><a href="/categories/移动开发">移动开发</a></li>
		        
					<li><a href="/about-me">关于我</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap"><article id="post-广东移动携全球首创技术“护航”手机安全" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/archives/广东移动携全球首创技术“护航”手机安全/" class="article-date">
<span class="datetime-published-tag"> 2013-03-20 </span>
</a>

    </div>
  
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      广东移动携全球首创技术“护航”手机安全
    </h1>
  

      </header>
      
      <div class="article-info article-info-post">
        <!-- 
	<div class="article-category tagcloud">
	<a class="article-category-link" href="/categories/杂谈/">杂谈</a>
	</div>

 -->
        
        <div class="clearfix"></div>
      </div>
      
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x4E2D;&#x56FD;&#x7ECF;&#x6D4E;&#x7F51;8&#x6708;26&#x65E5;&#x8BAF; (&#x8BB0;&#x8005; &#x5E9E;&#x5F69;&#x971E;) &#x8BB0;&#x8005;&#x83B7;&#x6089;&#xFF0C;&#x4E2D;&#x56FD;&#x79FB;&#x52A8;&#x5E7F;&#x4E1C;&#x516C;&#x53F8;(&#x4EE5;&#x4E0B;&#x7B80;&#x79F0;&#x201C;&#x5E7F;&#x4E1C;&#x79FB;&#x52A8;&#x201D;)&#x7EC4;&#x7EC7;&#x6280;&#x672F;&#x529B;&#x91CF;&#x8FDB;&#x884C;&#x653B;&#x5173;&#xFF0C;&#x6210;&#x529F;&#x7814;&#x5236;&#x51FA;&#x5168;&#x7403;&#x9996;&#x521B;&#x7684;&#x624B;&#x673A;&#x75C5;&#x6BD2;&#x4FA6;&#x6D4B;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x4EE5;&#x6B64;&#x4E3A;&#x57FA;&#x7840;&#x6784;&#x5EFA;&#x65B0;&#x4E00;&#x4EE3;&#x7684;&#x624B;&#x673A;&#x75C5;&#x6BD2;&#x9632;&#x6CBB;&#x4F53;&#x7CFB;&#xFF0C;&#x5728;&#x7F51;&#x7EDC;&#x4FA7;&#x5B9E;&#x73B0;&#x5BF9;&#x624B;&#x673A;&#x75C5;&#x6BD2;&#x7684;&#x4E3B;&#x52A8;&#x4FA6;&#x6D4B;&#xFF0C;&#x5E76;&#x5728;&#x7EC8;&#x7AEF;&#x4FA7;&#x8FDB;&#x884C;&#x67E5;&#x6740;&#xFF0C;&#x4E3A;&#x7528;&#x6237;&#x6253;&#x9020;&#x7EFF;&#x8272;&#x5B89;&#x5168;&#x7684;&#x624B;&#x673A;&#x4F7F;&#x7528;&#x73AF;&#x5883;&#x3002;</p>
<p>&#x4E2D;&#x56FD;&#x7ECF;&#x6D4E;&#x7F51;&#x8BB0;&#x8005;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x5E7F;&#x4E1C;&#x79FB;&#x52A8;&#x6784;&#x7B51;&#x7684;&#x624B;&#x673A;&#x75C5;&#x6BD2;&#x9632;&#x6CBB;&#x4F53;&#x7CFB;&#x5305;&#x62EC;&#x201C;&#x624B;&#x673A;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x591A;&#x7EF4;&#x5EA6;&#x4FA6;&#x6D4B;&#x7CFB;&#x7EDF;&#x201D;&#x548C;&#x7EC8;&#x7AEF;&#x4FA7;&#x4E91;&#x67E5;&#x6740;&#x8F6F;&#x4EF6;&#x201C;&#x6740;&#x6BD2;&#x5148;&#x950B;&#x201D;&#x3002;&#x5176;&#x4E2D;&#xFF0C;&#x201C;&#x624B;&#x673A;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x591A;&#x7EF4;&#x5EA6;&#x4FA6;&#x6D4B;&#x7CFB;&#x7EDF;&#x201D;&#x91C7;&#x7528;&#x5168;&#x7403;&#x9996;&#x521B;&#x7684;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x884C;&#x4E3A;&#x591A;&#x7EF4;&#x5EA6;&#x5206;&#x6790;&#x7B97;&#x6CD5;&#x53CA;&#x53CC;&#x5F15;&#x64CE;&#x4FA6;&#x6D4B;&#x6280;&#x672F;(&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5F15;&#x64CE;+&#x75C5;&#x6BD2;&#x4F53;&#x626B;&#x63CF;&#x5F15;&#x64CE;)&#xFF0C;&#x4E0D;&#x4EC5;&#x80FD;&#x4FA6;&#x6D4B;&#x75C5;&#x6BD2;&#x5E93;&#x4E2D;&#x5DF2;&#x6709;&#x7684;&#x75C5;&#x6BD2;&#x548C;&#x6728;&#x9A6C;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x4FA6;&#x6D4B;&#x75C5;&#x6BD2;&#x5E93;&#x4E2D;&#x6CA1;&#x6709;&#x7684;&#x7591;&#x4F3C;&#x65B0;&#x75C5;&#x6BD2;&#x3001;&#x65B0;&#x6728;&#x9A6C;&#x548C;&#x624B;&#x673A;&#x5185;&#x7F6E;&#x540E;&#x95E8;&#x7B49;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5C01;&#x5835;&#xFF0C;&#x6709;&#x6548;&#x904F;&#x5236;&#x624B;&#x673A;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x7684;&#x5927;&#x89C4;&#x6A21;&#x8513;&#x5EF6;&#x3002;&#x4E0E;&#x4E1A;&#x754C;&#x4EA7;&#x54C1;&#x6BD4;&#x8F83;&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x5728;&#x4FA6;&#x6D4B;&#x65B9;&#x9762;&#x5177;&#x6709;&#x624B;&#x6BB5;&#x5168;&#x3001;&#x8303;&#x56F4;&#x5E7F;&#x3001;&#x80FD;&#x529B;&#x5F3A;&#x3001;&#x6548;&#x7387;&#x9AD8;&#x56DB;&#x5927;&#x4F18;&#x52BF;&#x3002;&#x622A;&#x81F3;2011&#x5E74;8&#x6708;&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x5171;&#x53D1;&#x73B0;&#x6D41;&#x884C;&#x7684;&#x6D3B;&#x8DC3;&#x624B;&#x673A;&#x6076;&#x610F;&#x8F6F;&#x4EF6;537&#x4E2A;&#xFF0C;&#x5176;&#x4E2D;&#x5148;&#x4E8E;&#x4E1A;&#x754C;&#x53D1;&#x73B0;&#x7684;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x5360;59%&#x3002;&#x8BE5;&#x7CFB;&#x7EDF;&#x5DF2;&#x901A;&#x8FC7;&#x76F8;&#x5173;&#x673A;&#x6784;&#x7EC4;&#x7EC7;&#x7684;&#x6280;&#x672F;&#x6210;&#x679C;&#x9274;&#x5B9A;&#xFF0C;&#x9274;&#x5B9A;&#x7ED3;&#x8BBA;&#x4E3A;&#x201C;&#x56FD;&#x9645;&#x9996;&#x521B;&#x201D;&#x3002;&#x7531;&#x4E8E;&#x5E94;&#x7528;&#x6548;&#x679C;&#x663E;&#x8457;&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x8FD8;&#x83B7;&#x5F97;&#x4E86;2010&#x5E74;&#x5EA6;&#x4E2D;&#x56FD;&#x901A;&#x4FE1;&#x5B66;&#x4F1A;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x5E94;&#x7528;&#x5956;&#x7B49;&#x8BF8;&#x591A;&#x5956;&#x9879;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x5E7F;&#x4E1C;&#x79FB;&#x52A8;&#x624B;&#x673A;&#x75C5;&#x6BD2;&#x9632;&#x6CBB;&#x4F53;&#x7CFB;&#x7684;&#x53E6;&#x4E00;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x7EC8;&#x7AEF;&#x4FA7;&#x4E91;&#x67E5;&#x6740;&#x8F6F;&#x4EF6;&#x201C;&#x6740;&#x6BD2;&#x5148;&#x950B;&#x201D;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x6E05;&#x9664;&#x7EC8;&#x7AEF;&#x4FA7;&#x7684;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#xFF0C;&#x5F00;&#x521B;&#x4E86;&#x4EE5;&#x79FB;&#x52A8;&#x8FD0;&#x8425;&#x5546;&#x4E3A;&#x4E3B;&#x5BFC;&#x7684;&#x624B;&#x673A;&#x6740;&#x6BD2;&#x65B0;&#x6A21;&#x5F0F;&#x3002;&#x636E;&#x6089;&#xFF0C;&#x201C;&#x6740;&#x6BD2;&#x5148;&#x950B;&#x201D;&#x53EF;&#x901A;&#x8FC7;&#x4E0E;&#x4E91;&#x7AEF;&#x670D;&#x52A1;&#x7ED3;&#x5408;&#xFF0C;&#x5728;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x5E76;&#x4E3B;&#x52A8;&#x53D1;&#x73B0;&#x624B;&#x673A;&#x4E2D;&#x6BD2;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x5728;&#x7EC8;&#x7AEF;&#x4FA7;&#x5BF9;&#x75C5;&#x6BD2;&#x8FDB;&#x884C;&#x7CBE;&#x51C6;&#x67E5;&#x6740;&#xFF0C;&#x5F62;&#x6210;&#x4E86;&#x5B8C;&#x5584;&#x7684;&#x201C;&#x7F51;&#x7EDC;&#x67E5;&#x6BD2;&#xFF0C;&#x7EC8;&#x7AEF;&#x6740;&#x6BD2;&#x201D;&#x7684;&#x75C5;&#x6BD2;&#x9632;&#x6CBB;&#x4F53;&#x7CFB;&#x3002;</p>
<p>&#x65E5;&#x524D;&#xFF0C;&#x8FD9;&#x4E24;&#x5927;&#x81EA;&#x4E3B;&#x7814;&#x53D1;&#x4EA7;&#x54C1;&#x5DF2;&#x901A;&#x8FC7;&#x4E86;&#x56FD;&#x5BB6;&#x8BA1;&#x7B97;&#x673A;&#x75C5;&#x6BD2;&#x9632;&#x6CBB;&#x4EA7;&#x54C1;&#x68C0;&#x9A8C;&#x4E2D;&#x5FC3;&#x7684;&#x68C0;&#x6D4B;&#xFF0C;&#x5E76;&#x53D6;&#x5F97;&#x4E86;&#x624B;&#x673A;&#x75C5;&#x6BD2;&#x9632;&#x6CBB;&#x4EA7;&#x54C1;&#x68C0;&#x9A8C;&#x5408;&#x683C;&#x8BC1;&#x3002;&#x5E7F;&#x4E1C;&#x79FB;&#x52A8;&#x6210;&#x4E3A;&#x5168;&#x56FD;&#x7B2C;&#x4E00;&#x5BB6;&#x4E5F;&#x662F;&#x76EE;&#x524D;&#x552F;&#x4E00;&#x4E00;&#x5BB6;&#x540C;&#x65F6;&#x53D6;&#x5F97;&#x7F51;&#x7EDC;&#x4FA7;&#x548C;&#x7EC8;&#x7AEF;&#x4FA7;&#x624B;&#x673A;&#x75C5;&#x6BD2;&#x9632;&#x6CBB;&#x4EA7;&#x54C1;&#x5408;&#x683C;&#x8BC1;&#x7684;&#x4F01;&#x4E1A;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8BE5;&#x516C;&#x53F8;&#x5DF2;&#x53D6;&#x5F97;&#x4E86;&#x7531;&#x516C;&#x5B89;&#x90E8;&#x6388;&#x4E88;&#x7684;&#x201C;&#x6740;&#x6BD2;&#x5148;&#x950B;&#x201D;&#x8F6F;&#x4EF6;&#x7684;&#x201C;&#x5B89;&#x5168;&#x4E13;&#x7528;&#x4EA7;&#x54C1;&#x9500;&#x552E;&#x8BB8;&#x53EF;&#x8BC1;&#x201D;&#xFF0C;&#x4ECE;&#x800C;&#x5177;&#x5907;&#x4E86;&#x9500;&#x552E;&#x8BE5;&#x6740;&#x6BD2;&#x4EA7;&#x54C1;&#x53CA;&#x5F00;&#x5C55;&#x624B;&#x673A;&#x75C5;&#x6BD2;&#x7814;&#x5224;&#x3001;&#x9884;&#x8B66;&#x7B49;&#x76F8;&#x5173;&#x5B89;&#x5168;&#x670D;&#x52A1;&#x7684;&#x8D44;&#x8D28;&#xFF0C;&#x6210;&#x4E3A;&#x56FD;&#x5185;&#x7B2C;&#x4E00;&#x5BB6;&#x4E5F;&#x662F;&#x76EE;&#x524D;&#x552F;&#x4E00;&#x4E00;&#x5BB6;&#x5177;&#x5907;&#x4EE5;&#x4E0A;&#x8D44;&#x8D28;&#x7684;&#x8FD0;&#x8425;&#x5546;&#x3002;</p>
<p>&#x5E7F;&#x4E1C;&#x79FB;&#x52A8;&#x76F8;&#x5173;&#x8D1F;&#x8D23;&#x4EBA;&#x8868;&#x793A;&#xFF0C;&#x516C;&#x53F8;&#x8FD1;&#x671F;&#x5C06;&#x5F00;&#x5C55;&#x201C;&#x6740;&#x6BD2;&#x5148;&#x950B;&#x201D;&#x4EA7;&#x54C1;&#x7684;&#x8BD5;&#x5546;&#x7528;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EE5;&#x5151;&#x73B0;&#x201C;&#x514D;&#x8D39;&#x4E3A;&#x5BA2;&#x6237;&#x63D0;&#x4F9B;&#x4E00;&#x6B3E;&#x624B;&#x673A;&#x6740;&#x6BD2;&#x8F6F;&#x4EF6;&#x201D;&#x7684;&#x627F;&#x8BFA;&#xFF0C;&#x4E3A;&#x7528;&#x6237;&#x7684;&#x624B;&#x673A;&#x5B89;&#x5168;&#x53CA;&#x6253;&#x9020;&#x201C;&#x7EFF;&#x8272;&#x7F51;&#x7EDC;&#x201D;&#x4FDD;&#x9A7E;&#x62A4;&#x822A;&#x3002;</p>

      
      
        <div class="post-copyright">
<p><a href="http://www.ithome.me/archives/广东移动携全球首创技术“护航”手机安全/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年7月28日 16:07</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/archives/android中odex文件的合并和生成/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          android中odex文件的合并和生成
        
      </div>
    </a>
  
  
    <a href="/archives/郁闷的时候看一看/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">郁闷的时候看一看</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2018
            
                 Simon.Chen
            
    	</div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {
		fancybox: false,
		mathjax: false,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: true,
     CDN_PATH: '' 
	}
</script>




    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/common.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>







  </div>
</body>
</html>
