<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>程序员应如何更好的与非程序员一起工作</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#00796b">
  <meta name="msapplication-TileColor" content="#4E8071"/>
  
  
  
  
  <link rel="stylesheet" href="/css/style.css" type="text/css"> 
</head>


<body>

  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
  <header id="header" class="inner">
    <a href="/" class="profilepic">
      <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	</a>
	<p class="header-subtitle">分享有助于提升</p>
    <nav class="header-menu">
      <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li>
      </ul>
    </nav>
  </header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  <div class="intrude-less">
    <header id="header" class="inner">
      <a href="/" class="profilepic">
        <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	  </a>
	  <p class="header-subtitle">分享有助于提升</p>
	  <nav class="header-menu">
	    <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li><div class="clearfix"></div>
		</ul>
	  </nav>
	</header>				
  </div>
</nav>

      <div class="body-wrap">
<article id="post-程序员应如何更好的与非程序员一起工作" class="article article-type-post" itemscope itemprop="blogPost">

   
    
    <div class="article-meta">
      
<div class="article-date">
<span class="datetime-published-tag"> 2013-03-20 </span>
</div>


    </div>
    
    
  
  <div class="article-inner block-select">
  
    
    
      <header class="article-header">
        
           
  
    <h1 class="article-title" itemprop="name">
      程序员应如何更好的与非程序员一起工作
    </h1>
  

        
      </header>
      
      <div class="article-info article-info-post">
        

        
             <div class="clearfix"></div>
        
      </div>
      
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x3010;51CTO&#x5916;&#x7535;&#x5934;&#x6761;&#x3011;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x4ECA;&#x5929;&#x7684;&#x79D1;&#x6280;&#x4E16;&#x754C;&#x4E2D;&#x8981;&#x60F3;&#x6210;&#x529F;&#xFF0C;&#x4EC5;&#x6709;&#x7F16;&#x7801;&#x6280;&#x80FD;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x5BF9;&#x8BDD;&#x4E2D;&#xFF0C;Google&#x6280;&#x672F;&#x9886;&#x5BFC;&#x548C;&#x7ECF;&#x7406;Ben<br>Collins-Sissman(@sussman)&#x4E0E;Google&#x5DE5;&#x7A0B;&#x7ECF;&#x7406;Brian<br>Fitzpatrick(@therealfitz)&#x4E00;&#x8D77;&#xFF0C;&#x8BA8;&#x8BBA;&#x4E86;&#x4E0E;&#x975E;&#x7A0B;&#x5E8F;&#x5458;&#x540C;&#x4E8B;&#x5171;&#x4E8B;&#xFF0C;&#x7EF4;&#x62A4;&#x5173;&#x7CFB;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;</p>
<p>Ben&#x548C;Brian&#x8BF4;&#x8C26;&#x865A;&#x3001;&#x5C0A;&#x91CD;&#x548C;&#x4FE1;&#x4EFB;&#x662F;&#x57F9;&#x517B;&#x4E00;&#x4E2A;&#x6109;&#x5FEB;&#x7684;&#xFF0C;&#x5BCC;&#x6709;&#x6210;&#x6548;&#x7684;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x7684;&#x91CD;&#x8981;&#x539F;&#x5219;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E8C;&#x4EBA;&#x5C06;&#x5728;&#x4E0B;&#x5468;&#x4E3E;&#x884C;&#x7684;OSCON&#x5927;&#x4F1A;&#x4E0A;&#x5206;&#x4EAB;&#x7A0B;&#x5E8F;&#x5458;&#x5982;&#x4F55;&#x5F88;&#x597D;&#x5730;&#x4E0E;&#x5176;&#x4ED6;&#x540C;&#x4E8B;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>OSCON&#x4F1A;&#x8BAE;&#x63CF;&#x8FF0;&#x4E2D;&#x63D0;&#x5230;&#x201C;&#x5927;&#x89C4;&#x6A21;&#x7EC4;&#x7EC7;&#x64CD;&#x7EB5;&#x7684;&#x827A;&#x672F;&#x201D;&#xFF0C;&#x90A3;&#x662F;&#x4EC0;&#x4E48;?</p>
<p>Brian Fitzpatrick:&#x6211;&#x8BA4;&#x4E3A;&#x201C;&#x7EC4;&#x7EC7;&#x64CD;&#x7EB5;&#x201D;&#x5E94;&#x6709;&#x4E00;&#x4E2A;&#x5EA6;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x5BF9;Google&#x662F;&#x5982;&#x4F55;&#x8FD0;&#x4F5C;&#x7684;&#x6709;&#x8F83;&#x597D;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x5F15;&#x5BFC;&#x516C;&#x53F8;&#x671D;&#x597D;&#x7684;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#x3002;</p>
<p>Ben<br>Collins-Sussman:&#x6211;&#x6000;&#x7591;Fitz&#x8BF4;&#x7684;&#x662F;&#x5426;&#x5C5E;&#x5B9E;&#xFF0C;&#x516C;&#x53F8;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x6709;&#x4E00;&#x79CD;&#x6743;&#x529B;&#x7ED3;&#x6784;&#x4E0E;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x56FE;&#x5339;&#x914D;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x771F;&#x6B63;&#x7684;&#x8C03;&#x67E5;&#xFF0C;&#x53D1;&#x73B0;&#x771F;&#x6B63;&#x7684;&#x6743;&#x529B;&#x5173;&#x7CFB;&#x6240;&#x5728;&#x3002;</p>
<p>Brian Fitzpatrick:&#x636E;&#x6211;&#x6240;&#x77E5;&#xFF0C;&#x6CA1;&#x6709;&#x516C;&#x53F8;&#x80FD;&#x505A;&#x5230;&#x6743;&#x529B;&#x7ED3;&#x6784;&#x548C;&#x5B83;&#x4EEC;&#x7684;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x56FE;&#x5B8C;&#x5168;&#x5339;&#x914D;&#xFF0C;&#x9664;&#x975E;&#x4ED6;&#x4EEC;&#x5C11;&#x4E8E;&#x4E24;&#x4E2A;&#x4EBA;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x5458;&#x5982;&#x4F55;&#x4E0E;&#x975E;&#x7A0B;&#x5E8F;&#x5458;&#x540C;&#x4E8B;&#x6C9F;&#x901A;?</p>
<p>Ben Collins-Sussman:&#x9996;&#x5148;&#xFF0C;&#x8981;&#x770B;&#x4ED6;&#x4EEC;&#x7684;&#x773C;&#x775B;&#x800C;&#x4E0D;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x978B;&#x5B50;&#xFF0C;&#x5176;&#x6B21;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4E0D;&#x4F1A;&#x5C31;&#x7EAF;&#x7CB9;&#x7684;&#x903B;&#x8F91;&#x558B;&#x558B;&#x4E0D;&#x4F11;&#x3002;</p>
<p>&#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x60C5;&#x7EEA;&#x7684;&#x654F;&#x611F;&#x6027;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x8BA8;&#x8BBA;&#x65F6;&#x53D1;&#x751F;&#x4E00;&#x4E9B;&#x4E89;&#x6267;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x975E;&#x5DE5;&#x7A0B;&#x5E08;&#x4E0D;&#x4F1A;&#x9886;&#x60C5;&#x539F;&#x59CB;&#x7684;&#x771F;&#x76F8;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x559C;&#x6B22;&#x7EAF;&#x7CB9;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5F80;&#x5F80;&#x671F;&#x671B;&#x5341;&#x8DB3;&#x7684;&#x53CD;&#x9988; -<br>&#x4EE3;&#x7801;&#x5BA1;&#x67E5;&#xFF0C;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#x7B49;&#xFF0C;&#x5F53;&#x4F60;&#x4E0E;&#x975E;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x6C9F;&#x901A;&#x65F6;&#xFF0C;&#x4EC5;&#x4EC5;&#x9648;&#x8FF0;&#x4E8B;&#x5B9E;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x5C06;&#x4E8B;&#x5B9E;&#x5305;&#x88C5;&#x8D77;&#x6765;&#xFF0C;&#x8BA9;&#x5B83;&#x4EEC;&#x66F4;&#x6613;&#x4E8E;&#x4ED6;&#x4EBA;&#x5438;&#x6536;&#x3002;&#x4E0D;&#x8981;&#x5728;&#x4F60;&#x7684;&#x53CD;&#x9988;&#x4E2D;&#x7ED5;&#x5708;&#x5B50;&#xFF0C;&#x786E;&#x4FDD;&#x5BF9;&#x65B9;&#x4E0D;&#x9700;&#x8981;&#x9010;&#x5B57;&#x5206;&#x6790;&#x4F60;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x6BD4;&#x7A0B;&#x5E8F;&#x5458;&#x66F4;&#x654F;&#x611F;&#x3002;</p>
<p>Brian<br>Fitzpatrick:&#x5C0A;&#x91CD;&#x975E;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x80FD;&#x529B;&#x662F;&#x5173;&#x952E;&#xFF0C;&#x4F60;&#x516C;&#x53F8;&#x91CC;&#x505A;&#x5E02;&#x573A;&#x8425;&#x9500;&#xFF0C;&#x9500;&#x552E;&#x6216;&#x516C;&#x5173;&#x7684;&#x540C;&#x4E8B;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4ED6;&#x4EEC;&#x5C31;&#x662F;&#x767D;&#x75F4;&#xFF0C;&#x4ED6;&#x4EEC;&#x6709;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F60;&#x6709;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x9664;&#x4E86;&#x5DE5;&#x7A0B;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x5927;&#x91CF;&#x7684;&#x6280;&#x80FD;&#x9700;&#x8981;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x548C;&#x975E;&#x5DE5;&#x7A0B;&#x5E08;&#x540C;&#x4E8B;&#x76F8;&#x4E92;&#x5E2E;&#x52A9;&#xFF0C;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#xFF0C;&#x5171;&#x540C;&#x63D0;&#x9AD8;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x4E0E;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x5458;&#x534F;&#x4F5C;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x5EFA;&#x8BAE;?</p>
<p>Brian<br>Fitzpatrick:&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5E7F;&#x6CDB;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x65B0;&#x4E66;&#x5C06;&#x4F1A;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x63D0;&#x51FA;&#x5EFA;&#x8BAE;&#x3002;&#x6211;&#x4EEC;&#x4E3B;&#x5F20;&#x91C7;&#x53D6;&#x4E09;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x539F;&#x5219;:&#x8C26;&#x865A;&#x3001;&#x5C0A;&#x91CD;&#x548C;&#x4FE1;&#x4EFB;(&#x7B80;&#x79F0;HRT)&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8868;&#x73B0;&#x5F97;&#x5F88;&#x8C26;&#x865A;&#xFF0C;&#x5E76;&#x5C0A;&#x91CD;&#x4F60;&#x7684;&#x540C;&#x4E8B;&#xFF0C;&#x5E76;&#x4FE1;&#x4EFB;&#x4ED6;&#x4EEC;&#x80FD;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#xFF0C;&#x4F60;&#x548C;&#x5B83;&#x4EEC;&#x5EFA;&#x7ACB;&#x6109;&#x5FEB;&#x7684;&#xFF0C;&#x5BCC;&#x6709;&#x6210;&#x6548;&#x7684;&#x5DE5;&#x4F5C;&#x5173;&#x7CFB;&#x7684;&#x673A;&#x4F1A;&#x5C06;&#x66F4;&#x5927;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x7684;&#x540C;&#x4E8B;&#x9700;&#x8981;&#x83B7;&#x5F97;&#x4F60;&#x7684;&#x5C0A;&#x91CD;&#x548C;&#x4FE1;&#x4EFB;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x8981;&#x4FE1;&#x4EFB;&#x67D0;&#x4EBA;&#x9996;&#x5148;&#x5C31;&#x5F97;&#x6000;&#x7591;&#x4ED6;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x4E0D;&#x53EF;&#x4FE1;&#x4EFB;&#x6216;&#x4E0D;&#x503C;&#x5F97;&#x4F60;&#x5C0A;&#x91CD;&#xFF0C;&#x4F60;&#x4F1A;&#x5F88;&#x5FEB;&#x5F04;&#x660E;&#x767D;&#x3002;</p>
<p>Ben<br>Collins-Sussman:&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#x4E0D;&#x4EC5;&#x9002;&#x7528;&#x4E8E;&#x81EA;&#x5DF1;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5F3A;&#x5927;&#x56E2;&#x961F;&#x7684;&#x6587;&#x5316;&#x57FA;&#x7840;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x8BF4;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x662F;&#x4E00;&#x9879;&#x56E2;&#x961F;&#x8FD0;&#x52A8;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E2A;&#x4EBA;&#x8FD0;&#x52A8;&#xFF0C;&#x56F4;&#x7ED5;HRT&#x57F9;&#x517B;&#x56E2;&#x961F;&#x6587;&#x5316;&#x662F;&#x63D0;&#x9AD8;&#x751F;&#x4EA7;&#x529B;&#xFF0C;&#x957F;&#x671F;&#x4FDD;&#x6301;&#x6210;&#x529F;&#x7684;&#x5173;&#x952E;&#x3002;</p>
<p>&#x9879;&#x76EE;&#x53D1;&#x751F;&#x5206;&#x6B67;&#x65F6;&#x8BE5;&#x5982;&#x4F55;&#x5904;&#x7406;?</p>
<p>Ben<br>Collins-Sussman:&#x6211;&#x8BA4;&#x4E3A;&#x6700;&#x597D;&#x7684;&#x7B56;&#x7565;&#x662F;&#x8BA8;&#x8BBA;&#xFF0C;&#x5E76;&#x5FEB;&#x901F;&#x8FBE;&#x6210;&#x65B9;&#x5411;&#x4E00;&#x81F4;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x6709;&#x65F6;&#x53CC;&#x65B9;&#x9700;&#x8981;&#x76F8;&#x4E92;&#x505A;&#x51FA;&#x4E00;&#x4E9B;&#x8BA9;&#x6B65;&#xFF0C;&#x5173;&#x952E;&#x662F;&#x6709;&#x4E00;&#x5957;&#x5355;&#x4E00;&#x7684;&#x6807;&#x51C6;&#x548C;&#x60EF;&#x4F8B;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6BD4;&#x7F16;&#x7801;&#x98CE;&#x683C;&#xFF0C;&#x7EC4;&#x7EC7;&#x60EF;&#x4F8B;&#x6216;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x4E0D;&#x4E00;&#x81F4;&#x66F4;&#x5FEB;&#x8BA9;&#x9879;&#x76EE;&#x53D8;&#x5F97;&#x6DF7;&#x4E71;&#x4E0D;&#x582A;&#xFF0C;&#x56E0;&#x6B64;&#x4FDD;&#x6301;&#x9879;&#x76EE;&#x4E00;&#x81F4;&#x6027;&#x5F88;&#x5173;&#x952E;&#x3002;</p>
<p>Brian<br>Fitzpatrick::&#x8FD9;&#x65F6;&#x5E94;&#x8BE5;&#x8BA9;&#x4FE1;&#x4EFB;&#x548C;&#x5C0A;&#x91CD;&#x7684;&#x56E2;&#x961F;&#x6587;&#x5316;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#xFF0C;&#x6B64;&#x5916;&#xFF0C;&#x5728;&#x5F00;&#x59CB;&#x7F16;&#x7801;&#x4E4B;&#x524D;&#xFF0C;&#x4E3A;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x5EFA;&#x7ACB;&#x4E00;&#x5957;&#x7F16;&#x7A0B;&#x4E60;&#x60EF;&#xFF0C;&#x5750;&#x4E0B;&#x6765;&#x8BBE;&#x8BA1;&#x4F60;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x5F04;&#x6E05;&#x4F60;&#x7A76;&#x7ADF;&#x8981;&#x505A;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4EE5;&#x53CA;&#x4F60;&#x60F3;&#x600E;&#x4E48;&#x53BB;&#x505A;&#x3002;</p>
<p>&#x539F;&#x6587;&#x51FA;&#x5904;:<a href="http://answers.oreilly.com/topic/2801-software-engineering-is-a-team-sport-how-programmers-can-deal-with-colleagues-and-non-programmers/" target="_blank" rel="external">http://answers.oreilly.com/topic/2801-software-engineering-is-a-team-sport-how-programmers-can-deal-with-colleagues-and-non-programmers/</a><br>&#x539F;&#x6587;&#x540D;:Software engineering is a team sport: How programmers can<br>deal with colleagues and non-programmers</p>

      
      
      
        <div class="post-copyright">
<p><a href="http://www.ithome.me/archives/程序员应如何更好的与非程序员一起工作/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年7月28日 16:07</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav" class="block-select">
  
    <a href="/archives/转-eclipse快速加入android全部源码/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          [转]eclipse快速加入android全部源码
        
      </div>
    </a>
  
  
    <a href="/archives/ubuntu下QQ解决方案/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">ubuntu下QQ解决方案</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer" class="block-select">
  <div class="outer">
    <div id="footer-info">
      <div class="footer-left">&copy; 2015-2018
        Simon.Chen
      </div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {fancybox: false,mathjax: false,animate: false,isHome: false,isPost: true,isArchive: false,isTag: false,isCategory: false,open_in_new: true, CDN_PATH: '' }
</script>


    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/base.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>





  </div>
</body>
</html>
