<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>温州动车追尾事故——网上流传的版本 | IT驿站</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#4f6b79">
  <meta name="msapplication-TileColor" content="#4f6b79"/>
  
  
  <meta name="description" content="25&amp;#x53F7;&amp;#xFF0C;&amp;#x9020;&amp;#x6210;&amp;#x4E24;&amp;#x767E;&amp;#x591A;&amp;#x4EBA;&amp;#x6B7B;&amp;#x4F24;&amp;#x7684;&amp;#xFF02;&amp;#x6E29;&amp;#x5DDE;&amp;#x52A8;&amp;#x8F66;&amp;#x8FFD;&amp;#x5C3E;&amp;#x4E8B;&amp;#x6545;&amp;#x2033;&amp;#x8FC7;&amp;#x53BB;&amp;#x8FD8;&amp;#x4E0">
<meta property="og:type" content="article">
<meta property="og:title" content="温州动车追尾事故——网上流传的版本">
<meta property="og:url" content="http://chensiming.me/archives/温州动车追尾事故——网上流传的版本/index.html">
<meta property="og:site_name" content="IT驿站">
<meta property="og:description" content="25&amp;#x53F7;&amp;#xFF0C;&amp;#x9020;&amp;#x6210;&amp;#x4E24;&amp;#x767E;&amp;#x591A;&amp;#x4EBA;&amp;#x6B7B;&amp;#x4F24;&amp;#x7684;&amp;#xFF02;&amp;#x6E29;&amp;#x5DDE;&amp;#x52A8;&amp;#x8F66;&amp;#x8FFD;&amp;#x5C3E;&amp;#x4E8B;&amp;#x6545;&amp;#x2033;&amp;#x8FC7;&amp;#x53BB;&amp;#x8FD8;&amp;#x4E0">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2015-07-28T08:33:49.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="温州动车追尾事故——网上流传的版本">
<meta name="twitter:description" content="25&amp;#x53F7;&amp;#xFF0C;&amp;#x9020;&amp;#x6210;&amp;#x4E24;&amp;#x767E;&amp;#x591A;&amp;#x4EBA;&amp;#x6B7B;&amp;#x4F24;&amp;#x7684;&amp;#xFF02;&amp;#x6E29;&amp;#x5DDE;&amp;#x52A8;&amp;#x8F66;&amp;#x8FFD;&amp;#x5C3E;&amp;#x4E8B;&amp;#x6545;&amp;#x2033;&amp;#x8FC7;&amp;#x53BB;&amp;#x8FD8;&amp;#x4E0">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link rel="stylesheet" href="/css/style.css" type="text/css"> 
  

</head>

<body>
  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			
		</a>
		
		<p class="header-subtitle">分享有助于提升</p>
		
        <nav class="header-menu">
            <ul>
                
                    <li><a href="/">主页</a></li>
                
                    <li><a href="/archives">所有文章</a></li>
                
                    <li><a href="/categories/移动开发">移动开发</a></li>
                
                    <li><a href="/about-me">关于我</a></li>
                
            </ul>
        </nav>
	</header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
	<div class="intrude-less">
		<header id="header" class="inner">
			<a href="/" class="profilepic">
                
			        <img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			    
			</a>
			<!-- <hgroup>
			  <h1 class="header-author">Simon.Chen</h1>
			</hgroup>-->
			
			<p class="header-subtitle">分享有助于提升</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
					<li><a href="/categories/移动开发">移动开发</a></li>
		        
					<li><a href="/about-me">关于我</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap"><article id="post-温州动车追尾事故——网上流传的版本" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/archives/温州动车追尾事故——网上流传的版本/" class="article-date">
<span class="datetime-published-tag"> 2013-03-19 </span>
</a>

    </div>
  
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      温州动车追尾事故——网上流传的版本
    </h1>
  

      </header>
      
      <div class="article-info article-info-post">
        <!-- 
	<div class="article-category tagcloud">
	<a class="article-category-link" href="/categories/杂谈/">杂谈</a>
	</div>

 -->
        
        <div class="clearfix"></div>
      </div>
      
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>25&#x53F7;&#xFF0C;&#x9020;&#x6210;&#x4E24;&#x767E;&#x591A;&#x4EBA;&#x6B7B;&#x4F24;&#x7684;&#xFF02;&#x6E29;&#x5DDE;&#x52A8;&#x8F66;&#x8FFD;&#x5C3E;&#x4E8B;&#x6545;&#x2033;&#x8FC7;&#x53BB;&#x8FD8;&#x4E0D;&#x5230;38&#x5C0F;&#x65F6;&#xFF0C;&#x5728;&#x539F;&#x56E0;&#x8FD8;&#x6CA1;&#x6709;&#x67E5;&#x6E05;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x94C1;&#x9053;&#x90E8;&#x5C06;&#x7834;&#x635F;&#x8F66;&#x4F53;&#x78BE;&#x788E;&#xFF0C;&#x63A9;&#x57CB;&#xFF0C;&#x5F15;&#x53D1;&#x6C11;&#x4F17;&#x548C;&#x5A92;&#x4F53;&#x7684;&#x8D28;&#x7591;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x51FA;&#x4E8B;&#x8DEF;&#x6BB5;&#x5DF2;&#x7ECF;&#x6062;&#x590D;&#x901A;&#x8F66;&#x3002; 7&#x6708;24&#x65E5; 23:15&#xFF0C;&#x94C1;&#x9053;&#x90E8;&#x53D1;&#x8A00;&#x4EBA;&#x738B;&#x52C7;&#x5E73;&#x5728;&#x6E29;&#x5DDE;&#x6C34;&#x5FC3;&#x996D;&#x5E97;&#x4E3A;&#x201C;7?23&#x201D;&#x752C;&#x6E29;&#x7EBF;&#x7279;&#x522B;&#x91CD;&#x5927;&#x94C1;&#x8DEF;&#x4EA4;&#x901A;&#x4E8B;&#x6545;&#x4E3E;&#x884C;&#x65B0;&#x95FB;&#x53D1;&#x5E03;&#x4F1A;&#x3002;&#x6709;&#x8BB0;&#x8005;&#x95EE;&#xFF1A;&#x201C;&#x5728;&#x4F60;&#x4EEC;&#x5BA3;&#x5E03;&#x6CA1;&#x751F;&#x547D;&#x4F53;&#x5F81;&#x3001;&#x5F00;&#x59CB;&#x62C6;&#x89E3;&#x8F66;&#x53A2;&#x65F6;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x53C8;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x6D3B;&#x7740;&#x7684;&#x5973;&#x5B69;&#xFF1F;&#x201D;&#x94C1;&#x9053;&#x90E8;&#x53D1;&#x8A00;&#x4EBA;&#x79F0;&#xFF1A;&#x201C;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5947;&#x8FF9;&#x3002;&#x201D;&#x8BB0;&#x8005;&#xFF1A;&#x201C;&#x90A3;&#x4F60;&#x4EEC;&#x505A;&#x7684;&#x51B3;&#x7B56;&#x662F;&#x4E0D;&#x662F;&#x9519;&#x4E86;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x8BF4;&#x6CA1;&#x4EBA;&#x6D3B;&#x7740;&#x53C8;&#x53D1;&#x73B0;&#x5462;&#xFF1F;&#x201D;&#x53D1;&#x8A00;&#x4EBA;&#xFF1A;&#x201C;&#x6211;&#x53EA;&#x80FD;&#x8BF4;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x53D1;&#x751F;&#x4E86;&#x3002;&#x201D; 7&#x6708;25&#x65E5; 8:30&#xFF0C;&#x300A;&#x4E1C;&#x65B9;&#x536B;&#x89C6;&#x300B;24&#x65E5;7&#x70B9;11&#x5206;&#x7684;&#x65B0;&#x95FB;&#x8FDE;&#x7EBF;&#xFF0C;&#x636E;&#x73B0;&#x573A;&#x8BB0;&#x8005;&#x4E01;&#x6843;&#x4ECB;&#x7ECD;&#xFF1A;&#x201C;&#x622A;&#x81F3;&#x5F53;&#x65F6;&#x4F24;&#x4EA1;&#x4EBA;&#x6570;203&#x4EBA;&#xFF0C;&#x6B7B;&#x4EA1;&#x4EBA;&#x6570;63&#x4EBA;&#x2026;&#x201D;&#x5B57;&#x5E55;&#x5374;&#x663E;&#x793A;32&#x4EBA;&#x6B7B;&#x4EA1;&#x3002;&#x76F4;&#x5230;24&#x65E5;&#x665A;22&#x70B9;&#xFF0C;&#x94C1;&#x9053;&#x90E8;&#x53D1;&#x8A00;&#x4EBA;&#x738B;&#x52C7;&#x5E73;&#x901A;&#x62A5;7?23&#x4E8B;&#x6545;&#x6B7B;&#x4EA1;&#x4EBA;&#x6570;&#x4E3A;35&#x4EBA; 7&#x6708;25&#x65E5; 9:30&#xFF0C;&#x201C;35&#x201D;&#x4E00;&#x4E2A;&#x795E;&#x5947;&#x7684;&#x6570;&#x5B57;&#x3002;&#x52A8;&#x8F66;&#x76F8;&#x649E;35&#x4EBA;&#x6B7B;&#x4EA1;&#xFF0C;&#x6CB3;&#x5357;&#x5E73;&#x9876;&#x5C71;&#x77FF;&#x96BE;35&#x4EBA;&#x6B7B;&#x4EA1;&#xFF1B;&#x91CD;&#x5E86;&#x66B4;&#x96E8;&#x9020;&#x6210;35&#x4EBA;&#x6B7B;&#x4EA1;&#xFF1B;&#x4E91;&#x5357;&#x906D;&#x5927;&#x96E8;&#x88AD;&#x51FB;&#x5168;&#x7701;35&#x4EBA;&#x6B7B;&#x4EA1;&#x3002;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x6B7B;&#x4EA1;&#x4EBA;&#x6570;&#x63A7;&#x5236;&#x5728;36&#x4EBA;&#x4EE5;&#x5185;&#x5417;&#xFF1F;&#x8D85;&#x8FC7;36&#x4EBA;&#xFF0C;&#x5E02;&#x59D4;&#x4E66;&#x8BB0;&#x8FD9;&#x4E2A;&#x7EA7;&#x522B;&#x7684;&#x8981;&#x64A4;&#x804C;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x5F00;&#x59CB;&#x53D1;&#x751F;&#xFF0C;&#x5C31;&#x6CE8;&#x5B9A;&#x4E86;&#x6B7B;&#x4EA1;&#x4EBA;&#x6570;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;36 7&#x6708;25&#x65E5; 9:50&#xFF0C;&#x4E00;&#x4E2A;&#x5728;&#x533B;&#x9662;&#x4E0A;&#x73ED;&#x7684;&#x54E5;&#x8BF4;&#xFF0C;&#x5176;&#x5B9E;&#x5230;&#x4ECA;&#x5929;&#x65E9;&#x4E0A;&#x51CC;&#x6668;&#x5C31;&#x5DF2;&#x7ECF;&#x6B7B;&#x4E86;100&#x591A;&#x4E86;&#xFF0C;&#x62AC;&#x51FA;&#x6765;&#x7684;&#x90FD;&#x662F;&#x6B7B;&#x4EBA;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;&#x5230;&#x533B;&#x9662;&#x8D70;&#x4E86;&#x4E00;&#x906D;&#xFF0C;&#x7B97;&#x62A2;&#x6551;&#x65E0;&#x6548;&#xFF0C;&#x4E0D;&#x7B97;&#x7ACB;&#x5373;&#x6B7B;&#x4EA1;&#x3002;&#x5A92;&#x4F53;&#x88AB;&#x8981;&#x6C42;&#x9690;&#x7792;&#x4E86;&#x6570;&#x636E;&#x53EA;&#x8BF4;30&#x591A;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x771F;&#x662F;&#x7528;&#x5FC3;&#x826F;&#x82E6;&#x3002;&#x3002;&#x3002; 7&#x6708;25&#x65E5; 15:45&#xFF0C;&#x51CC;&#x6668;4&#x70B9;&#x5BA3;&#x5E03;&#x5DF2;&#x65E0;&#x751F;&#x547D;&#x8FF9;&#x8C61;&#xFF0C;14&#x4E2A;&#x5C0F;&#x65F6;&#x540E;&#x53C8;&#x6551;&#x51FA;&#x5C0F;&#x5B69;&#x513F;&#xFF0C;&#x5176;&#x95F4;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x6709;&#xFF1A;&#x78BE;&#x788E;&#x6389;&#x843D;&#x7684;&#x8F66;&#x53A2;&#xFF0C;&#x5185;&#x90E8;&#x534F;&#x8C03;&#xFF0C;&#x62DF;&#x4E8E; &#x4E0B;&#x5348;6&#x70B9;&#x901A;&#x8F66;&#x2026;&#x2026;&#x6211;&#x76F8;&#x4FE1;&#x4E86;&#xFF1A;&#x4ED6;&#x4EEC;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x5C3D;&#x529B;&#x6551;&#x4EBA;&#x3002; 7&#x6708;25&#x65E5; 17:40&#xFF0C;&#x5230;&#x5E95;&#x4F24;&#x4EA1;&#x591A;&#x5C11;&#x4EBA;&#xFF1A;&#x770B;&#x4E0B;&#x9999;&#x6E2F;&#x515A;&#x62A5;&#x62A5;&#x5BFC;&#x5427;&#xFF01; &#x5171;6&#x8282;&#x8F66;&#x53A2;&#x6EE1;&#x5458;600&#x4EBA;&#x6389;&#x5230;30&#x7C73;&#x9AD8;&#x6865;&#x5E95;&#x4E0B;&#x3002;&#x6865;&#x4E0A;&#x8F66;&#x53A2;&#x91CC;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x4F24;&#x4EA1;&#x5148;&#x4E0D;&#x7B97;&#xFF0C;&#x6865;&#x4E0B;&#x5DF2;&#x77E5;&#x6D3B;&#x7740;&#x7684;&#x4E3A;210&#x591A;&#x4EBA;&#xFF0C;&#x800C;&#x65B0;&#x534E;&#x793E;&#x62A5;&#x7684; &#x4EA1;&#x8005; &#x4E3A;35&#x4EBA;&#x3002;&#x7167;&#x65B0;&#x534E;&#x793E;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;600&#xFF08;&#x603B;&#xFF09;-210&#xFF08;&#x4F24;&#xFF09;-35&#xFF08;&#x4EA1;&#xFF09;=355&#x4EBA;&#xFF0C;&#x8FD9;355&#x4EBA; &#x53BB; &#x54EA;&#x4E86;&#xFF1F; 7&#x6708;25&#x65E5; 21:27&#xFF0C;@&#x7F16;&#x5267;&#x5468;&#x529B;&#x519B;&#x65B0;&#x6D6A;&#x8BA4;&#x8BC1;&#xFF1A;&#x8BF7;&#x5927;&#x5BB6;&#x8BB0;&#x4F4F;&#x8FD9;&#x4E9B;&#x56FE;&#xFF0C;&#x8BB0;&#x4F4F;&#x8FD9;&#x5F20;&#x8138;&#x3002;&#x5148;&#x662F;&#x94C1;&#x4E09;&#x5C40;&#x8BF4;&#x6CA1;&#x6709;&#x63A9;&#x57CB;&#x5217;&#x8F66;&#xFF0C;&#x6316;&#x5751;&#x662F;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x4F5C;&#x4E1A;&#x3002;&#x540E;&#x6765;&#x8FD9;&#x4F4D;&#x53D1;&#x8A00;&#x4EBA;&#x7B11;&#x563B;&#x563B;&#x5730;&#x8BF4;&#xFF0C;&#x786E;&#x5B9E;&#x63A9;&#x57CB;&#x4E86;&#x673A;&#x8F66;&#xFF0C;&#x4F46;&#x90A3;&#x662F;&#x4E3A;&#x4E86;&#x57AB;&#x811A;&#xFF01;MD&#xFF01;&#x4F60;&#x5BB6;&#x8FD9;&#x662F;&#x76D6;&#x623F;&#x5B50;&#x6316;&#x5730;&#x57FA;&#x5440;&#xFF01;&#x628A;&#x8F66;&#x4F53;&#x3001;&#x5C38;&#x4F53;&#x3001;&#x4E2A;&#x4EBA;&#x7269;&#x54C1;&#x3001;&#x8BC1;&#x4EF6;&#x3001;&#x94B1;&#x8D22;&#xFF0C;&#x8FD8;&#x6709;&#x8840;&#x90FD;&#x5F53;&#x57FA;&#x6869;&#x6253;&#x4E0B;&#x53BB;&#x5440;&#xFF01;&#x4EE5;&#x4E3A;&#x8FD9;&#x6837;&#x4F60;&#x4EEC;&#x5C31;&#x7A33;&#x5F53;&#x4E86;&#x5417;&#xFF1F;&#xFF01;&#x6211;&#x672C;&#x4E0D;&#x5584;&#x7C97;&#x53E3;&#xFF0C;&#x4F46;&#x771F;&#x662F;&#x5FCD;&#x4E0D;&#x4F4F;&#xFF01;MMD! 7&#x6708;25&#x65E5; 21:39&#xFF0C;&#x6768;&#x5CF0;&#x5728;&#x73B0;&#x573A;&#x900F;&#x9732;&#x4E86;&#x591A;&#x4E2A;&#x7EC6;&#x8282;&#xFF1A;24&#x53F7;&#x51CC;&#x6668;&#x4ED6;&#x4E00;&#x70B9;&#x5C31;&#x5230;&#x8FBE;&#x4E86;&#x6E29;&#x5DDE;&#x5357;&#x7AD9;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x79CD;&#x79CD;&#x963B;&#x9976;&#xFF0C;2&#x70B9;&#x534A;&#x624D;&#x5230;&#x8FBE;&#x51FA;&#x4E8B;&#x8F66;&#x53A2;&#xFF0C;&#x5F53;&#x65F6;&#x73B0;&#x573A;&#x5DF2;&#x7ECF;&#x505C;&#x6B62;&#x6551;&#x63F4;&#xFF0C;&#x5DE5;&#x4F5C;&#x4EBA;&#x5458;&#x8868;&#x793A;&#x6CA1;&#x6709;&#x751F;&#x547D;&#x8FF9;&#x8C61;&#x3002;&#x4ED6;&#x7684;&#x59BB;&#x5B50;&#x548C;&#x6BCD;&#x4EB2;&#x662F;24&#x53F7;&#x4E0B;&#x5348;&#x624D;&#x88AB;&#x6316;&#x571F;&#x673A;&#x6316;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x59BB;&#x5B50;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x4E86;&#x8138;&#x90E8;&#xFF0C;&#x4ED6;&#x6D41;&#x7740;&#x6CEA;&#x95EE;&#xFF1A;&#x8FD9;&#x662F;&#x52A8;&#x8F66;&#x649E;&#x7684;&#x8FD8;&#x662F;&#x88AB;&#x6316;&#x7684;&#xFF1F; 7&#x6708;25&#x65E5; 22:18&#xFF0C;&#x6E29;&#x5DDE;&#x5FAE;&#x65B0;&#x95FB;&#xFF1A;#&#x9ED8;&#x54C0;&#x73B0;&#x573A;&#x76F4;&#x64AD;#&#x52A8;&#x8F66;&#x4E8B;&#x6545;&#x6700;&#x65B0;&#x7206;&#x6599;&#xFF01;&#xFF01;&#x5F53;&#x665A;&#x653F;&#x5E9C;&#x53BB;&#x8425;&#x6551;&#x7684;&#x90FD;&#x662F;D301&#x7684;&#x3002;D3115&#x7684;16&#x8282;&#x8F66;&#x53A2;&#x8FD1;&#x767E;&#x4EBA;&#x51E0;&#x4E4E;&#x5168;&#x90FD;&#x6B7B;&#x5149;&#xFF01;&#xFF01;&#xFF01;&#x6CA1;&#x6709;&#x4EBA;&#x53BB;&#x6551;&#x4ED6;&#x4EEC;&#xFF01;&#xFF01;&#xFF01;&#x76F4;&#x5230;&#x7B2C;&#x4E8C;&#x5929;&#x4E0B;&#x5348;&#x7528;&#x94F2;&#x8F66;&#x8F66;&#x76F4;&#x63A5;&#x53BB;&#x94F2;&#x7684;&#xFF01;&#xFF01;&#xFF01;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x56FD;&#x5BB6;&#x5BF9;&#x5F85;&#x751F;&#x547D;&#x7684;&#x65B9;&#x5F0F;&#x5417;&#xFF1F;&#x653F;&#x5E9C;&#x4EBA;&#x5458;&#x5230;&#x73B0;&#x5728;&#x90FD;&#x4E0D;&#x9732;&#x9762;&#xFF01;&#x73B0;&#x573A;&#x4EBA;&#x8D8A;&#x805A;&#x8D8A;&#x591A;&#x4E86;&#xFF01; 7&#x6708;25&#x65E5; 22:50&#xFF0C;@&#x65B0;&#x6C11;&#x5468;&#x520A;&#x6768;&#x6C5F;&#xFF1A;&#x6768;&#x5148;&#x751F;&#x6B64;&#x6B21;&#x4E8B;&#x6545;&#x5931;&#x53BB;&#x56DB;&#x540D;&#x4EB2;&#x4EBA;&#xFF1A;&#x59BB;&#x5B50;&#xFF0C;&#x5CB3;&#x6BCD;&#xFF0C;&#x5927;&#x59E8;&#x5B50;&#x53CA;&#x4E09;&#x5C81;&#x5916;&#x7525;&#x5973;&#xFF0C;&#x5176;&#x59BB;&#x6000;&#x5B55;&#x4E03;&#x4E2A;&#x6708;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;&#x5931;&#x53BB;&#x4E86;&#x4E94;&#x4E2A;&#x4EB2;&#x4EBA;&#xFF01;&#x4ED6;&#x8EAB;&#x7A7F;&#x5B5D;&#x8863;&#x9080;&#x94C1;&#x9053;&#x90E8;&#x5B98;&#x5458;&#x4E00;&#x8D77;&#x53C2;&#x89C2;&#x4ED6;&#x56E0;&#x91CE;&#x86EE;&#x94F2;&#x8F66;&#x5BFC;&#x81F4;&#x5C38;&#x4F53;&#x6B8B;&#x7F3A;&#xFF0C;&#x5934;&#x90E8;&#x4E0D;&#x9F50;&#x7684;&#x4EB2;&#x4EBA;&#x9057;&#x4F53;&#xFF0C;&#x8BE5;&#x5B98;&#x5458;&#x8FDE;&#x8FDE;&#x540E;&#x9000;&#xFF1A;&#x6211;&#x7ED9;&#x4F60;&#x97A0;&#x8EAC;&#xFF0C;&#x5BF9;&#x4E0D;&#x8D77;&#xFF01; 7&#x6708;25&#x65E5; 22:53&#xFF0C;@&#x516C;&#x6C11;&#x5FAE;&#x62A5;&#xFF1A;&#x6C42;&#x771F;&#x76F8;&#x518D;&#x6B21;&#x53D1;&#xFF01;&#x636E;&#x62A5;&#xFF1A;&#x4FDD;&#x9669;&#x516C;&#x53F8;&#x6536;&#x5230;&#x533B;&#x9662;&#x7684;&#x6B7B;&#x4EA1;&#x4EBA;&#x6570;&#x662F;179&#x4E2A;&#xFF0C;&#x65B0;&#x95FB;&#x62A5;&#x9053;&#x6B7B;&#x4EA1;&#x4EBA;&#x6570;&#x4E0D;&#x5230;40&#x4EBA;&#x3002; 7&#x6708;25&#x65E5; 22:55&#xFF0C;&#x7F51;&#x6613;&#x5FAE;&#x535A;@&#x9F9A;&#x4F1F;&#x6770;&#xFF1A;&#x4FDD;&#x9669;&#x516C;&#x53F8;&#x670B;&#x53CB;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x73B0;&#x5728;&#x6838;&#x5B9E;&#x6B7B;&#x4EA1;216&#x4EBA; &#x8FD8;&#x6CA1;&#x6709;&#x6838;&#x5B9E;&#x7684;&#x3002; 7&#x6708;26&#x65E5; 8:30&#xFF0C; @truth_cn&#x8FD9;&#x6837;&#x90FD;&#x88AB;&#x5172;&#x671D;&#x72D7;&#x5B98;&#x60F3;&#x5F97;&#x51FA;: &#x4E2D;&#x65B0;&#x6D59;&#x6C5F;&#x7F51;7&#x6708;25&#x65E5;&#x7535;&#xFF08;&#x8BB0;&#x8005; &#x8D75;&#x6654;&#x5A07;&#xFF09;&#x6709;&#x6D88;&#x606F;&#x79F0;&#xFF0C;&#x201C;&#x6E29;&#x5DDE;&#x4E8B;&#x6545;&#x539F;&#x56E0;&#x6709;&#x65B0;&#x8FDB;&#x5C55;&#xFF1A;&#x94C1;&#x8DEF;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x5458;&#x51FA;&#x73B0;BUG&#xFF08;&#x6545;&#x969C;&#xFF09;&#x662F;&#x672C;&#x6B21;&#x4E8B;&#x6545;&#x7684;&#x6839;&#x672C;&#x539F;&#x56E0;&#xFF0C;&#x8B66;&#x65B9;&#x5DF2;&#x7ECF;&#x62D8;&#x7559;&#x4E86;&#x4E24;&#x540D;&#x65E0;&#x8BC1;&#x7A0B;&#x5E8F;&#x5458;&#x3002;&#x4E0A;&#x6D77;&#x5927;&#x706B;&#x662F;&#x65E0;&#x8BC1;&#x7535;&#x710A;&#x5DE5;&#xFF0C;&#x8FD9;&#x6B21;&#x662F;&#x65E0;&#x8BC1;&#x7A0B;&#x5E8F;&#x5458;&#x3002; 7&#x6708;26&#x65E5; 8:37&#xFF0C;&#x4E2D;&#x592E;&#x4EBA;&#x6C11;&#x5E7F;&#x64AD;&#x7535;&#x53F0;&#x7FD4;&#x5B87;&#xFF1A;&#x94C1;&#x9053;&#x90E8;&#x53D1;&#x8A00;&#x4EBA;&#x738B;&#x52C7;&#x5E73;&#x8BF4;&#xFF1A;&#x201C;&#x96F7;&#x51FB;&#x9020;&#x6210;&#x8BBE;&#x5907;&#x6545;&#x969C;&#x3002;&#x201D;&#x800C;&#x5168;&#x56FD;&#x96F7;&#x7535;&#x9632;&#x62A4;&#x6807;&#x51C6;&#x5316;&#x6280;&#x672F;&#x59D4;&#x5458;&#x4F1A;&#x59D4;&#x5458;&#x5173;&#x50CF;&#x77F3;&#x5374;&#x8BF4;&#xFF1A;&#x201C;&#x6211;&#x53EA;&#x6709;&#x4E24;&#x53E5;&#x8BDD;&#x597D;&#x8BF4;&#xFF01;&#x7B2C;&#x4E00;&#x53E5;&#xFF0C;&#x6B64;&#x6B21;&#x4E8B;&#x6545;&#x7EDD;&#x5BF9;&#x662F;&#x4EBA;&#x7978;&#xFF01;&#x7B2C;&#x4E8C;&#x53E5;&#xFF0C;&#x6211;&#x5BF9;&#x653F;&#x5E9C;&#x7684;&#x5584;&#x540E;&#x5DE5;&#x4F5C;&#x5F88;&#x5931;&#x671B;&#xFF01;&#x201D; 7&#x6708;26&#x65E5; 14:04&#xFF0C;&#x5BB6;&#x5C5E;&#x770B;&#x5230;&#x9886;&#x5BFC;&#x6765;&#x4E86;&#xFF0C;&#x975E;&#x5E38;&#x6C14;&#x6124;&#xFF0C;&#x8D77;&#x51B2;&#x7A81;&#x4E86;&#xFF0C;&#x7838;&#x4E86;&#x6C34;&#x74F6;&#x3002; 7&#x6708;26&#x65E5; 14:21&#xFF0C;&#x8BB0;&#x8005;&#x4E0D;&#x8BA9;&#x4ED6;&#x4EEC;&#x8D70;&#xFF0C;&#x5BB6;&#x5C5E;&#x5728;&#x8D28;&#x95EE;&#xFF0C;&#x5BB6;&#x5C5E;&#x548C;&#x9886;&#x5BFC;&#x53D1;&#x751F;&#x6FC0;&#x70C8;&#x51B2;&#x7A81;&#x3002;&#x201C;&#x6211;&#x59B9;&#x59B9;&#x8FD8;&#x6709;&#x534A;&#x4E2A;&#x5934;&#x5728;&#x91CC;&#x9762;&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#x201D;&#x6C64;&#x5148;&#x751F;&#x58F0;&#x65AF;&#x529B;&#x6377;&#x7684;&#x558A;&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#xFF01; 7&#x6708;26&#x65E5;14:36&#xFF0C;&#x6C64;&#x5148;&#x751F;&#x7ED9;&#x4E13;&#x5BB6;&#x8DEA;&#x4E0B;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x52A8;&#x7528;&#x8B66;&#x529B;&#x628A;&#x8BB0;&#x8005;&#x5F3A;&#x884C;&#x62C9;&#x4F4F;&#x3002;&#x6C64;&#x5148;&#x751F;&#x5DF2;&#x7ECF;&#x54ED;&#x7684;&#x4E0D;&#x884C;&#x4E86;&#xFF0C;&#x592E;&#x89C6;&#x7684;&#x8BB0;&#x8005;&#x5927;&#x9A82;&#x94C1;&#x9053;&#x90E8;&#x7684;&#x4EBA;&#x662F;&#x72D7;&#xFF01;&#xFF01;&#xFF01; 7&#x6708;26&#x65E5; 14:44&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x4E13;&#x5BB6;&#xFF0C;&#x5750;&#x5728;&#x90A3;&#x91CC;&#x4E00;&#x8A00;&#x4E0D;&#x53D1;&#xFF0C;&#x6211;&#x4E0E;&#x4ED6;&#x4EEC;&#x4E00;&#x540C;&#x8EAB;&#x4E3A;&#x4EBA;&#x7C7B;&#x611F;&#x5230;&#x53EF;&#x803B;&#x3002; 7&#x6708;26&#x65E5; 15:10&#xFF0C;&#x4E00;&#x542C;&#x5230;&#x662F;&#x7701;&#x5185;&#x67D0;&#x57CE;&#x5E02;&#x7684;&#x8BB0;&#x8005;&#x6765;&#x91C7;&#x8BBF;&#xFF0C;&#x5BB6;&#x5C5E;&#x76F4;&#x63A5;&#x62D2;&#x7EDD;&#x56DE;&#x7B54;&#xFF0C;&#x201C;&#x8DDF;&#x4F60;&#x4EEC;&#x8BF4;&#x4ED6;&#x5988;&#x5C41;&#x7528;&#xFF0C;&#x53C8;&#x4E0D;&#x80FD;&#x64AD;&#x201D;&#x3002; 7&#x6708;26&#x65E5; 15:37&#xFF0C;&#x5BB6;&#x5C5E;&#x4E0D;&#x77E5;&#x53C8;&#x88AB;&#x5E26;&#x5F80;&#x4F55;&#x5904;&#xFF0C;&#x521A;&#x624D;&#x6709;&#x4EBA;&#x5411;&#x4ED6;&#x4EEC;&#x4FDD;&#x8BC1;&#x5207;&#x5272;&#x524D;&#x4F1A;&#x901A;&#x77E5;&#x4ED6;&#x4EEC;&#xFF0C;&#x4F60;&#x4EEC;&#x4FE1;&#x5417;&#xFF1F; 7&#x6708;26&#x65E5; 16:02&#xFF0C;&#x9047;&#x96BE;&#x8005;&#x5BB6;&#x5C5E;&#x9648;&#x5CF0;&#x5728;&#x4E8B;&#x6545;&#x4E2D;&#x5931;&#x53BB;&#x4E86;&#x4E94;&#x4F4D;&#x4EB2;&#x4EBA;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x4ED6;&#x6000;&#x5B55;7&#x4E2A;&#x6708;&#x7684;&#x59BB;&#x5B50;&#x3002;&#x9762;&#x5BF9;&#x955C;&#x5934;&#xFF0C;&#x4ED6;&#x5BF9;&#x6551;&#x63F4;&#x5DE5;&#x4F5C;&#x63D0;&#x51FA;&#x8D28;&#x7591; 7&#x6708;26&#x65E5; 15:01&#xFF0C;&#x6D59;&#x6C5F;&#x7701;&#x59D4;&#x4E66;&#x8BB0;&#x5927;&#x4EBA;&#x5B9E;&#x5728;&#x5F88;&#x5FD9;&#xFF01;&#xFF01;&#x5F53;&#x5E74;&#x676D;&#x5DDE;&#x5730;&#x94C1;&#x584C;&#x9677;&#xFF0C;&#x4ED6;&#x5728;&#x6D77;&#x5916;&#x8BBF;&#x95EE;&#xFF1B;&#x524D;&#x4E24;&#x5929;&#x4E09;&#x6865;&#x57AE;&#x584C;&#xFF0C;&#x4ED6;&#x5728;&#x6D77;&#x5916;&#x8BBF;&#x95EE;&#xFF1B;&#x6E29;&#x5DDE;&#x52A8;&#x8F66;&#x8FFD;&#x5C3E;&#xFF0C;&#x4ED6;&#x4E5F;&#x5728;&#x6D77;&#x5916;&#x8BBF;&#x95EE;&#x3002; 7&#x6708;26&#x65E5; 15:30&#xFF0C;&#x4E00;&#x4E2A;&#x5F3A;&#x76DB;&#x7684;&#x56FD;&#x5BB6;&#xFF0C;&#x5F00;&#x653E;&#x67AA;&#x652F;&#x90FD;&#x4E0D;&#x4F1A;&#x88AB;&#x98A0;&#x8986;&#xFF1B;&#x4E00;&#x4E2A;&#x865A;&#x5F31;&#x7684;&#x653F;&#x4F53;&#xFF0C;&#x4E70;&#x83DC;&#x5200;&#x90FD;&#x9700;&#x8981;&#x5B9E;&#x540D;&#xFF1B;&#x4E00;&#x4E2A;&#x4EBA;&#x6027;&#x7684;&#x56FD;&#x5BB6;&#xFF0C;&#x603B;&#x7EDF;&#x4F1A;&#x9010;&#x4E00;&#x5FF5;&#x51FA;&#x9047;&#x96BE;&#x8005;&#x7684;&#x540D;&#x5B57;&#x81F4;&#x4EE5;&#x54C0;&#x60BC;&#xFF0C;&#x4E00;&#x4E2A;&#x51B0;&#x51B7;&#x7684;&#x653F;&#x5E9C;&#xFF0C;&#x9047;&#x96BE;&#x4EBA;&#x6570;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x9AD8;&#x5EA6;&#x673A;&#x5BC6;&#x8981;&#x88AB;&#x9690;&#x7792;&#xFF1B;&#x4E00;&#x4E2A;&#x81EA;&#x7531;&#x7684;&#x56FD;&#x5BB6;&#xFF0C;&#x8BB0;&#x8005;&#x53EF;&#x4EE5;&#x5C06;&#x5185;&#x9601;&#x5927;&#x81E3;&#x8FFD;&#x95EE;&#x5230;&#x6EE1;&#x5934;&#x5927;&#x6C57;&#xFF0C;&#x4E00;&#x4E2A;&#x7981;&#x9522;&#x7684;&#x4F53;&#x5236;&#xFF0C;&#x5B98;&#x5458;&#x5219;&#x544A;&#x8BC9;&#x8BB0;&#x8005;&#xFF0C;&#x4F60;&#x7231;&#x4FE1;&#x4E0D;&#x4FE1;&#xFF0C;&#x53CD;&#x6B63;&#x6211;&#x4FE1;&#x3002; 7&#x6708;26&#x65E5; 15:30&#xFF0C;&#x4E0A;&#x6D77;&#x94C1;&#x8DEF;&#x5C40;&#x5C40;&#x957F;&#x3001;&#x515A;&#x59D4;&#x4E66;&#x8BB0;&#x3001;&#x526F;&#x5C40;&#x957F;&#x4E09;&#x4EBA;&#x5C31;&#x5730;&#x514D;&#x804C;&#x4E4B;&#x540E;&#xFF0C;&#x94C1;&#x9053;&#x90E8;&#x603B;&#x8C03;&#x5EA6;&#x957F;&#x5B89;&#x8DEF;&#x751F;&#x8C03;&#x4EFB;&#x4E0A;&#x6D77;&#x94C1;&#x8DEF;&#x5C40;&#x5C40;&#x957F;&#x3002;&#x5B89;&#x8DEF;&#x751F;&#xFF0C;2006&#x5E74;&#x4EFB;&#x603B;&#x8C03;&#x5EA6;&#x957F;&#xFF0C;2008&#x5E74;&#x56E0;&#x80F6;&#x6D4E;&#x94C1;&#x8DEF;4&#xFF0E;28&#x91CD;&#x5927;&#x4E8B;&#x6545;&#x514D;&#x804C;&#xFF0C;&#x4E4B;&#x540E;&#x51FA;&#x4EFB;&#x6210;&#x90FD;&#x94C1;&#x8DEF;&#x5C40;&#x5C40;&#x957F;&#xFF0C;2009&#x5E74;&#x8C03;&#x4EFB;&#x4E0A;&#x6D77;&#x94C1;&#x8DEF;&#x5C40;&#x5C40;&#x957F;&#xFF0C;2010&#x5E74;&#x91CD;&#x65B0;&#x51FA;&#x4EFB;&#x94C1;&#x9053;&#x90E8;&#x603B;&#x8C03;&#x5EA6;&#x957F;&#x3002;&#x8FD9;&#x7B97;&#x4EC0;&#x4E48;&#xFF1F;&#xFF1F;&#xFF1F; 7&#x6708;26&#x65E5; 12:25&#xFF0C;&#x4ECA;&#x5929;&#x300A;&#x4EBA;&#x6C11;&#x65E5;&#x62A5;&#x300B;&#x5934;&#x7248;&#xFF1A;&#x201C;&#x515A;&#x7684;&#x6069;&#x60C5;&#x6BD4;&#x5929;&#x9AD8;&#x201D;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x8F6C;&#x53D1;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x8F6C;&#x53D1;&#xFF0C;&#x51ED;&#x4F60;&#x826F;&#x5FC3; &#x94C1;&#x9053;&#x90E8;&#x53D1;&#x8A00;&#x4EBA;&#x738B;&#x52C7;&#x5E73;&#x5148;&#x751F;&#x4F60;&#x597D;&#xFF0C;&#x60A8;&#x7684;&#x5927;&#x5973;&#x513F;&#x738B;&#x6653;&#x82F1;&#x662F;&#x94C1;&#x9053;&#x90E8;&#x8D22;&#x52A1;&#x5C40;&#x4E3B;&#x4EFB;&#xFF0C;&#x5927;&#x5973;&#x5A7F;&#x674E;&#x9601;&#x594E;&#x662F;&#x5317;&#x4EAC;&#x5E02;&#x4EA4;&#x901A;&#x5C40;&#x526F;&#x5C40;&#x957F;&#xFF0C;&#x4E8C;&#x5973;&#x513F;&#x738B;&#x6653;&#x971E;&#x662F;&#x5317;&#x4EAC;&#x5E02;&#x8BA1;&#x751F;&#x5C40;&#x5904;&#x957F;&#xFF0C;&#x4E8C;&#x5973;&#x5A7F;&#x90ED;&#x4EAE;&#x662F;&#x5317;&#x4EAC;&#x5E02;&#x4E2D;&#x5FC3;&#x533B;&#x9662;&#x526F;&#x9662;&#x957F;&#xFF0C;&#x5C0F;&#x513F;&#x5B50;&#x738B;&#x6653;&#x98DE;&#x662F;&#x94C1;&#x9053;&#x90E8;&#x8D28;&#x68C0;&#x79D1;&#x79D1;&#x957F;&#xFF0C;&#x513F;&#x5AB3;&#x5F20;&#x5B81;&#x662F;&#x5E02;&#x5987;&#x8054;&#x4E3B;&#x4EFB;&#xFF0C;&#x5B59;&#x5B50;&#x5317;&#x4EAC;&#x5E02;&#x5B9E;&#x9A8C;&#x5C0F;&#x5B66;&#x526F;&#x73ED;&#x957F;&#x738B;&#x5C0F;&#x5E05;&#xFF0C;&#x6211;&#x6240;&#x4E86;&#x89E3;&#x7684;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x90FD;&#x6CA1;&#x9519;&#x5427;&#xFF1F; &#x6211;&#x51C6;&#x5907;&#x8F6C;&#x53D1;10&#x4E2A;&#x7FA4;&#xFF0C;&#x4F60;&#x8F6C;&#x4E0D;&#x8F6C;&#x6211;&#x4E0D;&#x7BA1;&#xFF0C;&#x53CD;&#x6B63;&#x6211;&#x662F;&#x8F6C;&#x4E86;</p>

      
      
        <div class="post-copyright">
<p><a href="http://chensiming.me/archives/温州动车追尾事故——网上流传的版本/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年7月28日 16:07</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/archives/关于java主方法的理解/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          关于java主方法的理解
        
      </div>
    </a>
  
  
    <a href="/archives/string-listfilenamefilter-filter/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">String[] list(FilenameFilter filter)</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2017
            
                 Simon.Chen
            
    	</div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {
		fancybox: false,
		mathjax: false,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: true,
     CDN_PATH: '' 
	}
</script>




    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/common.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>







  </div>
</body>
</html>
