<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>新顶级域名将放开 .COM或不敌.GAY</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#00796b">
  <meta name="msapplication-TileColor" content="#4E8071"/>
  
  
  
  
  <link rel="stylesheet" href="/css/style.css" type="text/css"> 
</head>


<body>

  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
  <header id="header" class="inner">
    <a href="/" class="profilepic">
      <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	</a>
	<p class="header-subtitle">分享有助于提升</p>
    <nav class="header-menu">
      <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li>
      </ul>
    </nav>
  </header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  <div class="intrude-less">
    <header id="header" class="inner">
      <a href="/" class="profilepic">
        <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	  </a>
	  <p class="header-subtitle">分享有助于提升</p>
	  <nav class="header-menu">
	    <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li><div class="clearfix"></div>
		</ul>
	  </nav>
	</header>				
  </div>
</nav>

      <div class="body-wrap">
<article id="post-新顶级域名将放开-COM或不敌-GAY" class="article article-type-post" itemscope itemprop="blogPost">

   
    
    <div class="article-meta">
      
<div class="article-date">
<span class="datetime-published-tag"> 2013-03-20 </span>
</div>


    </div>
    
    
  
  <div class="article-inner block-select">
  
    
    
      <header class="article-header">
        
           
  
    <h1 class="article-title" itemprop="name">
      新顶级域名将放开 .COM或不敌.GAY
    </h1>
  

        
      </header>
      
      <div class="article-info article-info-post">
        

        
             <div class="clearfix"></div>
        
      </div>
      
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x636E;.Tel&#x516C;&#x53F8;CEO&#x738B;&#x6653;&#x83C1;&#x5FAE;&#x535A;&#x900F;&#x9732;&#xFF0C;&#x5373;&#x5C06;&#x5728;&#x7F8E;&#x56FD;&#x53EC;&#x5F00;&#x7684;ICANN&#x5E74;&#x4F1A;&#x4E0A;&#xFF0C;IPV6&#x3001;&#x65B0;&#x9876;&#x7EA7;&#x57DF;&#x540D;&#x6CE8;&#x518C;&#x7B49;&#x91CD;&#x5927;&#x8BAE;&#x9898;&#x5C06;&#x6709;&#x671B;&#x843D;&#x542C;&#x3002;&#x738B;&#x6653;&#x83C1;&#x8BA4;&#x4E3A;&#xFF0C;&#x201C;2011&#xFF0C;&#x6216;&#x5C06;&#x51B3;&#x5B9A;&#x672A;&#x6765;&#x7F51;&#x7EDC;&#x53D1;&#x5C55;20&#x5E74;&#x3002;&#x201D;&#x636E;&#x6089;&#xFF0C;IPV6&#x7684;&#x6210;&#x529F;&#x90E8;&#x7F72;&#x5C06;&#x7ED9;&#x672A;&#x6765;&#x6BCF;&#x90E8;&#x624B;&#x673A;&#xFF0C;&#x751A;&#x81F3;&#x6BCF;&#x4E00;&#x90E8;&#x5BB6;&#x7535;&#x90FD;&#x5206;&#x914D;&#x4E00;&#x4E2A;IP&#x5730;&#x5740;&#xFF0C;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x3001;&#x7269;&#x8054;&#x7F51;&#x7684;&#x6301;&#x7EED;&#x53D1;&#x5C55;&#x63D0;&#x4F9B;&#x4FDD;&#x969C;&#x3002;</p>
<p>&#x5728;&#x57DF;&#x540D;&#x6CE8;&#x518C;&#x65B9;&#x9762;&#xFF0C;&#x65B0;&#x9876;&#x7EA7;&#x57DF;&#x540D;&#x7684;&#x5F7B;&#x5E95;&#x653E;&#x5F00;&#x610F;&#x5473;&#x7740;&#x57DF;&#x540D;&#x5730;&#x5740;&#x7684;&#x6781;&#x5927;&#x4E30;&#x5BCC;&#x548C;&#x4E2A;&#x6027;&#x5316;&#xFF0C;&#x4F8B;&#x5982;&#x4F73;&#x80FD;&#x516C;&#x53F8;&#x5C31;&#x6B63;&#x5728;&#x7533;&#x8BF7;.canon&#x57DF;&#x540D;&#x3002;&#x57DF;&#x540D;&#x7684;&#x591A;&#x6837;&#x5316;&#x5C06;&#x7ED9;&#x672A;&#x6765;&#x5E26;&#x6765;&#x4EC0;&#x4E48;?&#x738B;&#x6653;&#x83C1;&#x5BF9;&#x6B64;&#x7B11;&#x8A00;&#xFF0C;&#x201C;.gay&#x6216;&#x8BB8;&#x4F1A;&#x6BD4;.<strong>com</strong>&#x66F4;&#x706B;&#x7206;&#x3002;&#x201D;</p>
<p>ICANN(The Internet Corporation for A<strong>s</strong>signed Name<strong>s</strong> and Number<strong>s</strong>)&#x4E92;&#x8054;&#x7F51;&#x540D;&#x79F0;&#x4E0E;&#x6570;&#x5B57;&#x5730;&#x5740;&#x5206;&#x914D;&#x673A;&#x6784;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x8425;&#x5229;&#x6027;&#x7684;&#x56FD;&#x9645;&#x7EC4;&#x7EC7;&#xFF0C;&#x6210;&#x7ACB;&#x4E8E;1998&#x5E74;10&#x6708;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#x4E86;&#x5168;&#x7403;&#x7F51;&#x7EDC;&#x754C;&#x5546;&#x4E1A;&#x3001;&#x6280;&#x672F;&#x53CA;&#x5B66;&#x672F;&#x5404;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x7684; &#x975E;&#x8425;&#x5229;&#x6027;&#x56FD;&#x9645;&#x7EC4;&#x7EC7;&#xFF0C;&#x8D1F;&#x8D23;&#x4E92;&#x8054;&#x7F51;&#x534F;&#x8BAE;(IP)&#x5730;&#x5740;&#x7684;&#x7A7A;&#x95F4;&#x5206;&#x914D;&#x3001;&#x534F;&#x8BAE;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x6307;&#x6D3E;&#x3001;&#x901A;&#x7528;&#x9876;&#x7EA7;&#x57DF;&#x540D;(gTLD)&#x4EE5;&#x53CA;&#x56FD;&#x5BB6;&#x548C;&#x5730;&#x533A;&#x9876;&#x7EA7;&#x57DF;&#x540D;(ccTLD)&#x7CFB;&#x7EDF;&#x7684;&#x7BA1; &#x7406;&#x3001;&#x4EE5;&#x53CA;&#x6839;&#x670D;&#x52A1;&#x5668;&#x7CFB;&#x7EDF;&#x7684;&#x7BA1;&#x7406;&#x3002;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x6700;&#x521D;&#x662F;&#x5728;&#x7F8E;&#x56FD;&#x653F;&#x5E9C;&#x5408;&#x540C;&#x4E0B;&#x7531;&#x4E92;&#x8054;&#x7F51;&#x53F7;&#x7801;&#x5206;&#x914D;&#x5F53;&#x5C40;(Internet A<strong>s</strong>signed Number<strong>s</strong> Authority&#xFF0C;IANA)&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x4E00;&#x4E9B;&#x7EC4;&#x7EC7;&#x63D0;&#x4F9B;&#x3002;&#x73B0;&#x5728;&#xFF0C;ICANN&#x884C;&#x4F7F;IANA&#x7684;&#x804C;&#x80FD;&#x3002;</p>
<p><img src="http://images.51cto.com/files/uploadimg/20110314/1447530.png" alt="" title="1"></p>
<p>&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x59A8;&#x6765;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;ICANN&#x65B0;&#x901A;&#x7528;&#x9876;&#x7EA7;&#x57DF;&#x540D;&#x7684;&#x5546;&#x673A;&#x3002;</p>
<p>ICANN&#x6B63;&#x5728;&#x63A8;&#x8FDB;&#x65B0;&#x901A;&#x7528;&#x9876;&#x7EA7;&#x57DF;&#x540D;(gTLD)&#x63A8;&#x5E7F;&#x8BA1;&#x5212;&#xFF0C;&#x5728;2010&#x5E74;&#x7B2C;&#x4E00;&#x5B63;&#x5EA6;&#x5F00;&#x653E;&#x7533;&#x8BF7;&#x3002;ICANN&#x5C06;&#x4FEE;&#x6539;&#x4E92;&#x8054;&#x7F51;&#x901A;&#x7528;&#x9876;&#x7EA7;&#x57DF;&#x540D;&#x7684;&#x7533;&#x8BF7;&#x89C4;&#x5219;&#xFF0C;&#x5C06;&#x4E4B;&#x524D;&#x4E25;&#x683C;&#x9650;&#x5236;&#x7684;&#x65B0;&#x901A;&#x7528;&#x9876;&#x7EA7;&#x57DF;&#x540D;&#x7684;&#x89C4;&#x5219;&#x6539;&#x4E3A;&#x51E1;&#x7B26;&#x5408;&#x65B0;&#x7533;&#x8BF7;&#x6761;&#x4EF6;&#x7684;&#x516C;&#x53F8;&#x3001;&#x6CE8;&#x518C;&#x673A;&#x6784;&#x3001;&#x7EC4;&#x7EC7;&#x90FD;&#x53EF;&#x4EE5;&#x63D0;&#x4EA4;&#x7533;&#x8BF7;&#xFF0C;&#x5E76;&#x6210;&#x4E3A;&#x8BE5;&#x65B0;&#x901A;&#x7528;&#x9876;&#x7EA7;&#x57DF;&#x540D;&#x6CE8;&#x518C;&#x5C40;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x8BA1;&#x5212;&#x4E00;&#x65E6;&#x987A;&#x5229;&#x6267;&#x884C;&#xFF0C;&#x5C06;&#x50AC;&#x751F;&#x5F88;&#x591A;&#x65B0;&#x7684;&#x901A;&#x7528;&#x9876;&#x7EA7;&#x57DF;&#x540D;&#xFF0C;&#x5F80;&#x5E02;&#x573A;&#x7EC6;&#x5206;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#x53BB;&#x60F3;&#xFF0C;&#x6709;&#x4E9B;&#x65B0;&#x7684;&#x901A;&#x7528;&#x9876;&#x7EA7;&#x57DF;&#x540D;&#x662F;&#x5177;&#x6709;&#x5E02;&#x573A;&#x9700;&#x6C42;&#x548C;&#x5546;&#x4E1A;&#x4EF7;&#x503C;&#x7684;&#x3002;</p>
<p><strong>&#x4E00;&#x3001;&#x9762;&#x5411;&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;&#x57DF;&#x540D;.blog</strong></p>
<p>&#x73B0;&#x4ECA;&#x535A;&#x5BA2;&#x7FA4;&#x4F53;&#x7684;&#x89C4;&#x6A21;&#x662F;&#x5DE8;&#x5927;&#x7684;&#x3002;&#x6839;&#x636E;&#x4E2D;&#x56FD;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x4FE1;&#x606F;&#x4E2D;&#x5FC3;(CNNIC)&#x7684;&#x8C03;&#x67E5;&#xFF0C;&#x622A;&#x81F3;2009&#x5E74;6&#x6708;&#x5E95;&#xFF0C;&#x6211;&#x56FD;&#x7F51;&#x6C11;&#x89C4;&#x6A21;&#x8FBE;3.38&#x4EBF;&#xFF0C;&#x4E2D;&#x56FD;&#x62E5;&#x6709;&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;/&#x4E2A;&#x4EBA;&#x7A7A;&#x95F4;&#x7684;&#x7F51;&#x6C11;&#x7528;&#x6237;&#x89C4;&#x6A21;&#x5DF2;&#x7ECF;&#x8FBE;&#x5230;1.82&#x4EBF;&#x4EBA;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x535A;&#x5BA2;&#x57DF;&#x540D;&#x7684;&#x9500;&#x552E;&#x662F;&#x5B58;&#x5728;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x597D;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5F88;&#x96BE;&#x8BF4;&#x670D;&#x5E7F;&#x5927;&#x535A;&#x5BA2;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6CE8;&#x518C;&#x8D2D;&#x4E70;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x57DF;&#x540D;&#xFF0C;&#x56E0;&#x4E3A;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x7684;&#x535A;&#x5BA2;&#x90FD;&#x662F;&#x5728;&#x4F7F;&#x7528;&#x95E8;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x7B80;&#x54F2;&#x7684;&#x770B;&#x6CD5;:&#x4E0E;&#x95E8;&#x6237;&#x5408;&#x4F5C;&#xFF0C;&#x4E00;&#x822C;&#x56FD;&#x5185;&#x95E8;&#x6237;&#x4E0D;&#x4F1A;&#x4E3B;&#x52A8;&#x505A;&#x8FD9;&#x79CD;&#x9500;&#x552E;&#x57DF;&#x540D;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6545;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x7531;&#x4E00;&#x95F4;&#x57DF;&#x540D;&#x6CE8;&#x518C;&#x5546;&#x6765;&#x7275;&#x5934;&#x505A;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x8BA9;&#x95E8;&#x6237;(&#x65B0;&#x6D6A;&#x3001;&#x641C;&#x72D0;&#x3001;&#x817E;&#x8BAF;&#x3001;&#x7F51;&#x6613;&#x7B49;)&#x53C2;&#x4E0E;&#x5408;&#x4F5C;&#xFF0C;&#x6210;&#x4E3A;&#x535A;&#x5BA2;&#x57DF;&#x540D;&#x7684;&#x5206;&#x9500;&#x5546;&#xFF0C;&#x8BA9;&#x95E8;&#x6237;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x7684;&#x535A;&#x5BA2;&#x3001;&#x90AE;&#x7BB1;&#x7ED1;&#x5B9A;&#x72EC;&#x7ACB;&#x57DF;&#x540D;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x628A;&#x901A;&#x8DEF;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x4FBF;&#x80FD;&#x628A;&#x4E2A;&#x4EBA;&#x57DF;&#x540D;&#x9500;&#x552E;&#x51FA;&#x53BB;&#x3002;</p>
<p>&#x7406;&#x8BBA;&#x4EF7;&#x503C;:3.38&#x4EBF;&#x4EBA;&#xFF0C;&#x6309;&#x6BCF;&#x4EBA;&#x6BCF;&#x6708;&#x7684;&#x670D;&#x52A1;&#x6536;&#x8D39;10&#x5143;&#x8BA1;&#xFF0C;&#x7406;&#x8BBA;&#x503C;&#x4E3A;&#x6BCF;&#x5E74;&#x4E09;&#x767E;&#x591A;&#x4EBF;&#x5143;&#x7684;&#x89C4;&#x6A21;;&#x6309;&#x5E74;&#x6CE8;&#x518C;&#x8D39;50&#x5143;&#x8BA1;&#xFF0C;&#x7406;&#x8BBA;&#x503C;&#x4E3A;&#x6BCF;&#x5E74;&#x4E00;&#x767E;&#x591A;&#x4EBF;&#x5143;&#x7684;&#x89C4;&#x6A21;&#x3002;</p>
<p><strong>&#x4E8C;&#x3001;&#x9762;&#x5411;&#x4E13;&#x4E1A;&#x4EBA;&#x58EB;&#x7684;&#x57DF;&#x540D;</strong></p>
<p>&#x9488;&#x5BF9;&#x533B;&#x751F;&#x3001;&#x5F8B;&#x5E08;&#x3001;&#x4F1A;&#x8BA1;&#x5E08;&#x3001;&#x5DE5;&#x7A0B;&#x5E08;&#x8FD9;&#x4E9B;&#x4E13;&#x4E1A;&#x4EBA;&#x58EB;&#xFF0C;&#x63A8;&#x51FA;&#x4E13;&#x7528;&#x7684;&#x9876;&#x7EA7;&#x57DF;&#x540D;&#xFF0C;&#x5B58;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x5E02;&#x573A;&#x9700;&#x6C42;&#x3002;&#x8FD8;&#x6709;&#x804C;&#x4E1A;&#x7ECF;&#x7406;&#x4EBA;&#x7684;&#x4E13;&#x7528;&#x57DF;&#x540D;&#xFF0C;&#x5982;.ceo&#x3001;.cfo&#x3001;.cmo&#x3001;.coo&#x7B49;&#xFF0C;&#x4E5F;&#x662F;&#x5177;&#x6709;&#x5E02;&#x573A;&#x9700;&#x6C42;&#x7684;&#x3002;</p>
<p><strong>&#x4E09;&#x3001;&#x884C;&#x4E1A;&#x57DF;&#x540D;</strong></p>
<p>&#x50CF;&#x4E4B;&#x524D;&#x7684;.<strong>com</strong>&#x662F;&#x9002;&#x7528;&#x4E8E;&#x5546;&#x4E1A;&#x516C;&#x53F8;&#xFF0C;.net&#x57DF;&#x540D;&#x662F;&#x9002;&#x7528;&#x4E8E;&#x7F51;&#x7EDC;&#x884C;&#x4E1A;&#xFF0C;.org&#x57DF;&#x540D;&#x662F;&#x9002;&#x7528;&#x4E8E;&#x975E;&#x76C8;&#x5229;&#x7EC4;&#x7EC7;&#xFF0C;.edu&#x662F;&#x9762;&#x5411;&#x6559;&#x80B2;&#x79D1;&#x7814;&#x673A;&#x6784;&#xFF0C;&#x53EF;&#x89C1;&#x5F53;&#x521D;&#x7684;&#x57DF;&#x540D;&#x8BBE;&#x8BA1;&#x5C31;&#x662F;&#x9488;&#x5BF9;&#x5E02;&#x573A;&#x7EC6;&#x5206;&#x6765;&#x8BBE;&#x8BA1;&#x7684;&#x3002;</p>
<p>&#x7531;&#x6B64;&#x53EF;&#x4EE5;&#x63A8;&#x65AD;&#xFF0C;&#x884C;&#x4E1A;&#x57DF;&#x540D;&#x4F1A;&#x662F;&#x4E3B;&#x6D41;&#x7684;&#x65B0;&#x901A;&#x7528;&#x9876;&#x7EA7;&#x57DF;&#x540D;&#x3002;</p>
<p><strong>&#x56DB;&#x3001;&#x5176;&#x5B83;&#xFF0C;&#x624B;&#x673A;&#x8FD0;&#x8425;&#x5546;&#x57DF;&#x540D;</strong></p>
<p>&#x79FB;&#x52A8;&#x3001;&#x8054;&#x901A;&#x3001;&#x7535;&#x4FE1;&#x7684;&#x624B;&#x673A;&#x57DF;&#x540D;&#x3002;</p>
<p>&#x5982;&#x679C;&#x662F;&#x4ECE;&#x77ED;&#x671F;&#x6765;&#x770B;&#xFF0C;&#x5F88;&#x96BE;&#x770B;&#x5230;&#x624B;&#x673A;&#x57DF;&#x540D;&#x5177;&#x6709;&#x4EC0;&#x4E48;&#x5DE8;&#x5927;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x4F46;&#x662F;&#x4ECE;&#x957F;&#x8FDC;&#x6765;&#x770B;&#xFF0C;&#x624B;&#x673A;&#x57DF;&#x540D;&#x5C31;&#x5177;&#x6709;&#x53D1;&#x5C55;&#x4EF7;&#x503C;&#x3002;&#x5F53;&#x624B;&#x673A;&#x6210;&#x4E3A;&#x901A;&#x884C;&#x7684;&#x4E2A;&#x4EBA;&#x8EAB;&#x4EFD;&#x6807;&#x7B7E;&#x548C;&#x652F;&#x4ED8;&#x5E73;&#x53F0;&#x65F6;&#xFF0C;&#x624B;&#x673A;&#x57DF;&#x540D;&#x5C31;&#x5177;&#x6709;&#x5546;&#x4E1A;&#x4EF7;&#x503C;&#x4E86;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#x8054;&#x901A;&#x7684;&#x6C83;(WO)&#x54C1;&#x724C;&#xFF0C;&#x8BA9;&#x4F01;&#x4E1A;&#x4F7F;&#x7528;.wo&#x624B;&#x673A;&#x57DF;&#x540D;&#x5728;&#x65E0;&#x7EBF;&#x7F51;&#x7EDC;&#x62D3;&#x5C55;&#x5E02;&#x573A;&#xFF0C;&#x8FD9;&#x6837;.wo&#x624B;&#x673A;&#x57DF;&#x540D;&#x4FBF;&#x5177;&#x6709;&#x4E86;&#x5546;&#x4E1A;&#x4EF7;&#x503C;&#x3002;</p>

      
      
      
        <div class="post-copyright">
<p><a href="http://www.ithome.me/archives/新顶级域名将放开-COM或不敌-GAY/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年7月28日 16:07</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav" class="block-select">
  
    <a href="/archives/当Web设计师遭遇HTML5/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          当Web设计师遭遇HTML5
        
      </div>
    </a>
  
  
    <a href="/archives/转-创业三十六条军规/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">[转]创业三十六条军规</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer" class="block-select">
  <div class="outer">
    <div id="footer-info">
      <div class="footer-left">&copy; 2015-2018
        Simon.Chen
      </div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {fancybox: false,mathjax: false,animate: false,isHome: false,isPost: true,isArchive: false,isTag: false,isCategory: false,open_in_new: true, CDN_PATH: '' }
</script>


    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/base.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>





  </div>
</body>
</html>
