<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>中国网速为何总是这么慢？ | IT驿站</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#4f6b79">
  <meta name="msapplication-TileColor" content="#4f6b79"/>
  
  
  <meta name="description" content="&amp;#x4E16;&amp;#x754C;&amp;#x4E0A;&amp;#x6709;&amp;#x5F88;&amp;#x591A;&amp;#x4E0D;&amp;#x5BB9;&amp;#x6613;&amp;#x9002;&amp;#x5E94;&amp;#x7684;&amp;#x60C5;&amp;#x51B5;&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;&amp;#x4ECE;&amp;#x4F4D;&amp;#x4E8E;&amp;#x70ED;&amp;#x5E26;&amp;#x7684;&amp;#x65B0;&amp;#x52A0;">
<meta name="keywords" content="网速">
<meta property="og:type" content="article">
<meta property="og:title" content="中国网速为何总是这么慢？">
<meta property="og:url" content="http://www.ithome.me/archives/中国网速为何总是这么慢？/index.html">
<meta property="og:site_name" content="IT驿站">
<meta property="og:description" content="&amp;#x4E16;&amp;#x754C;&amp;#x4E0A;&amp;#x6709;&amp;#x5F88;&amp;#x591A;&amp;#x4E0D;&amp;#x5BB9;&amp;#x6613;&amp;#x9002;&amp;#x5E94;&amp;#x7684;&amp;#x60C5;&amp;#x51B5;&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;&amp;#x4ECE;&amp;#x4F4D;&amp;#x4E8E;&amp;#x70ED;&amp;#x5E26;&amp;#x7684;&amp;#x65B0;&amp;#x52A0;">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2015-07-28T08:33:49.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="中国网速为何总是这么慢？">
<meta name="twitter:description" content="&amp;#x4E16;&amp;#x754C;&amp;#x4E0A;&amp;#x6709;&amp;#x5F88;&amp;#x591A;&amp;#x4E0D;&amp;#x5BB9;&amp;#x6613;&amp;#x9002;&amp;#x5E94;&amp;#x7684;&amp;#x60C5;&amp;#x51B5;&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;&amp;#x4ECE;&amp;#x4F4D;&amp;#x4E8E;&amp;#x70ED;&amp;#x5E26;&amp;#x7684;&amp;#x65B0;&amp;#x52A0;">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link rel="stylesheet" href="/css/style.css" type="text/css"> 
  

</head>

<body>
  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			
		</a>
		
		<p class="header-subtitle">分享有助于提升</p>
		
        <nav class="header-menu">
            <ul>
                
                    <li><a href="/">主页</a></li>
                
                    <li><a href="/archives">所有文章</a></li>
                
                    <li><a href="/categories/移动开发">移动开发</a></li>
                
                    <li><a href="/about-me">关于我</a></li>
                
            </ul>
        </nav>
	</header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
	<div class="intrude-less">
		<header id="header" class="inner">
			<a href="/" class="profilepic">
                
			        <img lazy-src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="js-avatar">
			    
			</a>
			<!-- <hgroup>
			  <h1 class="header-author">Simon.Chen</h1>
			</hgroup>-->
			
			<p class="header-subtitle">分享有助于提升</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
					<li><a href="/categories/移动开发">移动开发</a></li>
		        
					<li><a href="/about-me">关于我</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap"><article id="post-中国网速为何总是这么慢？" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/archives/中国网速为何总是这么慢？/" class="article-date">
<span class="datetime-published-tag"> 2013-03-19 </span>
</a>

    </div>
  
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      中国网速为何总是这么慢？
    </h1>
  

      </header>
      
      <div class="article-info article-info-post">
        <!-- 
	<div class="article-category tagcloud">
	<a class="article-category-link" href="/categories/分享/">分享</a>
	</div>

 -->
        
	<div class="article-tag tagcloud">
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/网速/">网速</a></li></ul>
	</div>

        <div class="clearfix"></div>
      </div>
      
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x4E16;&#x754C;&#x4E0A;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x5BB9;&#x6613;&#x9002;&#x5E94;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6BD4;&#x5982;&#x4ECE;&#x4F4D;&#x4E8E;&#x70ED;&#x5E26;&#x7684;&#x65B0;&#x52A0;&#x5761;&#x79FB;&#x6C11;&#x5230;&#x51B0;&#x5C9B;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x7F51;&#x901F;&#x6700;&#x5FEB;&#x7684;&#x97E9;&#x56FD;&#x6765;&#x5230;&#x7F51;&#x901F;&#x201C;&#x8F83;&#x201D;&#x6162;&#x7684;&#x4E2D;&#x56FD;&#x3002;&#x5BF9;&#x4E8E;&#x524D;&#x8005;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x559C;&#x6B22;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4F30;&#x8BA1;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x6765;&#x8BF4;&#x90FD;&#x96BE;&#x4EE5;&#x9002;&#x5E94;&#x3002;</p>
<p>&#x4ECA;&#x5E74;1&#x6708;23&#x65E5;&#xFF0C;&#x300A;&#x8D22;&#x5BCC;&#x300B;&#x6742;&#x5FD7;&#x63F4;&#x5F15;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x516C;&#x53F8;Akamai&#x7684;&#x8C03;&#x67E5;&#x7ED3;&#x679C;&#x62A5;&#x9053;&#xFF0C;&#x97E9;&#x56FD;&#x4EE5;14Mbps&#x4F4D;&#x5C45;&#x699C;&#x9996;&#xFF0C;&#x6BD4;&#x5168;&#x7403;&#x5E73;&#x5747;&#x7F51;&#x901F;1.9Mbps&#x5FEB;&#x4E86;7&#x500D;&#x591A;&#xFF0C;&#x5176;&#x540E;&#x662F;&#x4E2D;&#x56FD;&#x9999;&#x6E2F;&#xFF08;9.2Mbps&#xFF09;&#xFF0C;&#x65E5;&#x672C;&#xFF08;8.5Mbps&#xFF09;&#xFF0C;&#x7F8E;&#x56FD;&#x4EE5;5Mbps&#x7684;&#x901F;&#x5EA6;&#x6392;&#x540D;&#x7B2C;12&#x3002;</p>
<p>&#x90A3;&#x4E2D;&#x56FD;&#x5462;&#xFF1F;&#x636E;&#x4ECA;&#x5E74;1&#x6708;19&#x65E5;&#x300A;<a href="http://down.51cto.com/data/223306" target="_blank" rel="external">&#x7B2C;27&#x6B21;&#x4E2D;&#x56FD;&#x4E92;&#x8054;&#x7F51;&#x7EDC;&#x53D1;&#x5C55;&#x72B6;&#x51B5;&#x7EDF;&#x8BA1;&#x62A5;&#x544A;</a>&#x300B;&#xFF0C;<strong>&#x622A;&#x81F3;2010&#x5E74;12&#x6708;&#x5E95;&#xFF0C;&#x4E2D;&#x56FD;&#x5E73;&#x5747;&#x4E92;&#x8054;&#x7F51;&#x5E73;&#x5747;&#x8FDE;&#x63A5;&#x901F;&#x5EA6;&#x4E3A;100.9KB/s&#xFF0C;&#x4E5F;&#x5C31;&#x662F;0.81Mbps&#xFF0C;&#x8FDC;&#x4F4E;&#x4E8E;&#x5168;&#x7403;&#x5E73;&#x5747;&#x8FDE;&#x63A5;&#x901F;&#x5EA6;230.4KB/s&#xFF08;1.84Mbps&#xFF09;</strong>&#x3002;&#x867D;&#x7136;&#x4E2D;&#x56FD;<a href="http://network.51cto.com/art/201008/222459.htm" target="_blank" rel="external">&#x7F51;&#x901F;</a>&#x8FD9;&#x4E48;&#x6162;&#xFF0C;&#x4F46;&#x4E2D;&#x56FD;&#x7F51;&#x6C11;&#x89C4;&#x6A21;&#x5374;&#x5DF2;&#x7ECF;&#x8FBE;&#x5230;4.57&#x4EBF;&#xFF0C;&#x8F83;2009&#x5E74;&#x5E95;&#x589E;&#x52A0;7330&#x4E07;&#x4EBA;&#x3002;&#x5982;&#x6B64;&#x5E9E;&#x5927;&#x7684;&#x4E2D;&#x56FD;&#x7F51;&#x6C11;&#xFF0C;&#x56E0;&#x7F51;&#x901F;&#x6162;&#x800C;&#x4ED8;&#x51FA;&#x4E86;&#x591A;&#x4E48;&#x5927;&#x7684;&#x4EE3;&#x4EF7;&#xFF1F;</p>
<p><a href="http://network.51cto.com/art/201008/220194.htm" target="_blank" rel="external">&#x97E9;&#x56FD;&#x7F51;&#x901F;</a>&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x5FEB;&#xFF1F;&#x97E9;&#x56FD;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x9769;&#x547D;&#x662F;&#x5728;1999&#x5E74;&#x56E0;HANARO&#x901A;&#x8BAF;&#x800C;&#x5F00;&#x59CB;&#x7684;&#x3002;&#x7531;&#x4E8E;&#x56FD;&#x6709;&#x4F01;&#x4E1A;&#x97E9;&#x56FD;&#x901A;&#x4FE1;&#x7262;&#x7262;&#x638C;&#x63E1;&#x4E86;&#x56FA;&#x5B9A;&#x7535;&#x8BDD;&#x5E02;&#x573A;&#x548C;ISDN&#x5784;&#x65AD;&#x7F51;&#x7EDC;&#x63A5;&#x5165;&#x3002;&#x867D;&#x7136;&#x65E0;&#x8BBA;&#x97E9;&#x56FD;&#x653F;&#x5E9C;&#x8FD8;&#x662F;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x97E9;&#x56FD;&#x901A;&#x4FE1;&#x90FD;&#x8BA4;&#x4E3A;ADSL&#x6280;&#x672F;&#x4E0D;&#x6210;&#x719F;&#x800C;&#x65E0;&#x6CD5;&#x5546;&#x7528;&#x5316;&#xFF0C;&#x4F46;&#x662F;1999&#x5E74;4&#x6708;HANARO&#x5728;&#x5168;&#x7403;&#x9996;&#x6B21;&#x63A8;&#x51FA;&#x7684;ADSL&#x901F;&#x5EA6;&#x9AD8;&#x8FBE;1Mbps&#xFF0C;&#x9065;&#x9065;&#x9886;&#x5148;&#x4E8E;&#x5F53;&#x65F6;&#x97E9;&#x56FD;&#x901A;&#x4FE1;&#x7684;ISDN&#x65B9;&#x5F0F;&#x63A5;&#x5165;&#x901F;&#x5EA6;128Kbps&#x3002;&#x968F;&#x540E;&#xFF0C;HANARO&#x63A8;&#x51FA;&#x5305;&#x6708;2.8&#x4E07;&#x97E9;&#x5143;&#xFF08;&#x6298;&#x5408;&#x4EBA;&#x6C11;&#x5E01;170&#x5143;&#xFF09;&#x4F4E;&#x4EF7;&#x653F;&#x7B56;&#x8FDB;&#x800C;&#x8F70;&#x52A8;&#x4E86;&#x6574;&#x4E2A;&#x97E9;&#x56FD;&#xFF0C;&#x4E5F;&#x4FC3;&#x4F7F;&#x97E9;&#x56FD;&#x901A;&#x4FE1;&#x653E;&#x5F03;ISDN&#x800C;&#x63A8;&#x51FA;&#x4E86;ADSL&#x670D;&#x52A1;&#x3002;&#x97E9;&#x56FD;&#x4E92;&#x8054;&#x7F51;&#x9769;&#x547D;&#x4ECE;&#x6B64;&#x62C9;&#x5F00;&#x4E86;&#x771F;&#x6B63;&#x7684;&#x5E37;&#x5E55;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E86;&#x97E9;&#x56FD;&#x8FDB;&#x5165;IT&#x5F3A;&#x56FD;&#x7684;&#x57FA;&#x77F3;&#x3002;</p>
<p>&#x5341;&#x5E74;&#x4EE5;&#x6765;&#xFF0C;&#x97E9;&#x56FD;&#x4E92;&#x8054;&#x7F51;&#x63A5;&#x5165;&#x901F;&#x5EA6;&#x6301;&#x7EED;&#x52A0;&#x901F;&#xFF0C;&#x81F3;&#x4ECA;100Mbps&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x822C;&#x5BB6;&#x5EAD;&#x7684;&#x6807;&#x51C6;&#x3002;&#x867D;&#x7136;&#x901F;&#x5EA6;&#x662F;&#x4EE5;&#x524D;&#x7684;100&#x500D;&#xFF0C;&#x4F46;&#x5305;&#x6708;&#x4EF7;&#x683C;&#x8FD8;&#x662F;&#x76F8;&#x8FD1;&#x4E8E;&#x8D77;&#x521D;&#x4EF7;&#x683C;&#xFF0C;&#x5373;2.75&#x4E07;&#x97E9;&#x5143;&#xFF08;&#x6298;&#x5408;&#x4EBA;&#x6C11;&#x5E01;167&#x5143;&#xFF09;&#x3002;&#x4ECA;&#x5E74;6&#x6708;&#x5E95;&#xFF0C;&#x97E9;&#x56FD;&#x653E;&#x9001;&#x901A;&#x4FE1;&#x59D4;&#x5458;&#x4F1A;&#x53D1;&#x5E03;&#x300A;&#x672A;&#x6765;&#x4E92;&#x8054;&#x7F51;&#x53D1;&#x5C55;&#x8BA1;&#x5212;&#x300B;&#x79F0;&#xFF0C;&#x4EE5;2010&#x5E74;&#x7684;100Mbps&#x6807;&#x51C6;&#xFF0C;&#x5230;2012&#x5E74;&#x4E92;&#x8054;&#x7F51;&#x63A5;&#x5165;&#x901F;&#x5EA6;&#x62DF;&#x4E0A;&#x5347;&#x81F3;1Gbps&#xFF0C;&#x5230;2020&#x5E74;&#x4E0A;&#x5347;&#x81F3;10Gbps&#xFF0C;&#x4E5F;&#x5C31;&#x662F;10&#x5E74;&#x5185;&#x52A0;&#x901F;100&#x500D;&#x3002;</p>
<p>&#x5BF9;&#x6BD4;&#x97E9;&#x56FD;&#x7535;&#x4FE1;&#x4E1A;&#x7684;&#x7ADE;&#x4E89;&#xFF0C;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;<strong>&#x4E2D;&#x56FD;&#x7F51;&#x901F;&#x6162;&#x7684;&#x6700;&#x5927;&#x539F;&#x56E0;&#x662F;&#x7F3A;&#x4E4F;&#x6709;&#x6548;&#x7ADE;&#x4E89;</strong>&#x3002;&#x4E2D;&#x56FD;&#x4E92;&#x8054;&#x7F51;&#x63A5;&#x5165;&#x5E02;&#x573A;&#x4ECD;&#x662F;&#x51E0;&#x4E4E;&#x88AB;&#x4E2D;&#x56FD;&#x7535;&#x4FE1;&#x548C;&#x4E2D;&#x56FD;&#x8054;&#x901A;&#x74DC;&#x5206;&#x7684;&#xFF0C;&#x4E24;&#x8005;&#x5206;&#x522B;&#x5728;&#x5357;&#x65B9;&#x548C;&#x5317;&#x65B9;&#x4EAB;&#x53D7;&#x5730;&#x57DF;&#x5784;&#x65AD;&#x4F18;&#x52BF;&#xFF0C;&#x4E2D;&#x56FD;&#x5BBD;&#x5E26;&#x4EA7;&#x4E1A;&#x5B9E;&#x8D28;&#x4E0A;&#x8FD8;&#x662F;&#x5904;&#x4E8E;&#x884C;&#x653F;&#x5784;&#x65AD;&#x7684;&#x5904;&#x5883;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x4E2D;&#x56FD;&#x79FB;&#x52A8;&#x3001;<strong>&#x4E2D;&#x56FD;&#x7535;&#x4FE1;&#x53CA;&#x4E2D;&#x56FD;&#x8054;&#x901A;&#x7B49;&#x4E09;&#x5927;&#x8FD0;&#x8425;&#x5546;&#x7684;&#x9AD8;&#x7BA1;&#x662F;&#x7ECF;&#x5E38;&#x4E92;&#x76F8;&#x8C03;&#x4EFB;&#x7684;&#x3002;</strong>&#x6BD4;&#x5982;2004&#x5E74;&#xFF0C;&#x4E2D;&#x56FD;&#x79FB;&#x52A8;&#x526F;&#x603B;&#x7ECF;&#x7406;&#x738B;&#x6653;&#x521D;&#x8C03;&#x5F80;&#x4E2D;&#x56FD;&#x7535;&#x4FE1;&#x63A5;&#x4EFB;&#x603B;&#x7ECF;&#x7406;&#xFF1B;&#x4E2D;&#x56FD;&#x8054;&#x901A;&#x8463;&#x4E8B;&#x957F;&#x738B;&#x5EFA;&#x5B99;&#x8C03;&#x5F80;&#x4E2D;&#x56FD;&#x79FB;&#x52A8;&#x63A5;&#x4EFB;&#x603B;&#x7ECF;&#x7406;&#xFF1B;&#x4E2D;&#x56FD;&#x7535;&#x4FE1;&#x526F;&#x603B;&#x7ECF;&#x7406;&#x5E38;&#x5C0F;&#x5175;&#x5230;&#x4E2D;&#x56FD;&#x8054;&#x901A;&#x63A5;&#x4EFB;&#x8463;&#x4E8B;&#x957F;&#xFF1B;&#x4E2D;&#x56FD;&#x7F51;&#x901A;&#x526F;&#x603B;&#x7ECF;&#x7406;&#x51B7;&#x8363;&#x6CC9;&#x8C03;&#x4EFB;&#x4E2D;&#x56FD;&#x7535;&#x4FE1;&#x526F;&#x603B;&#x7ECF;&#x7406;&#xFF0C;&#x63A5;&#x66FF;&#x65E9;&#x524D;&#x5E38;&#x5C0F;&#x5175;&#x7684;&#x804C;&#x4F4D;&#x3002;&#x8FD1;&#x65E5;&#xFF0C;&#x8FD8;&#x6709;&#x4E2D;&#x56FD;&#x8054;&#x901A;&#x8463;&#x4E8B;&#x957F;&#x5E38;&#x5C0F;&#x5175;&#x5C06;&#x91CD;&#x56DE;&#x4E2D;&#x56FD;&#x7535;&#x4FE1;&#x4EFB;&#x8463;&#x4E8B;&#x957F;&#x7684;&#x4F20;&#x95FB;&#x3002;&#x5728;&#x56FD;&#x6709;&#x901A;&#x4FE1;&#x8FD0;&#x8425;&#x5546;&#x7684;&#x9AD8;&#x7BA1;&#x4EEC;&#x4E92;&#x76F8;&#x8C03;&#x4EFB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9AD8;&#x7BA1;&#x4EEC;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x52A8;&#x529B;&#x6253;&#x7834;&#x5BE1;&#x5934;&#x5784;&#x65AD;&#x7684;&#x73B0;&#x72B6;&#x3002;&#x7F8E;&#x56FD;&#x4E54;&#x6CBB;&#x4E9A;&#x7406;&#x5DE5;&#x5927;&#x5B66;&#x7684;Dan Breznitz&#x6559;&#x6388;&#xFF0C;&#x5728;&#x6700;&#x8FD1;&#x51FA;&#x7248;&#x7684;&#x300A;Run of the Red Q ueen&#x300B;&#x4E00;&#x4E66;&#x4E0A;&#xFF0C;&#x4E5F;&#x8BBA;&#x8BC1;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF1A;&#x9AD8;&#x7BA1;&#x4EEC;&#x5728;&#x5C06;&#x6765;&#x53EF;&#x80FD;&#x4F1A;&#x8C03;&#x4EFB;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x96BE;&#x4EE5;&#x5F62;&#x6210;&#x52A8;&#x673A;&#x6295;&#x5165;&#x5DE8;&#x8D44;&#x4F7F;&#x5F97;&#x73B0;&#x4EFB;&#x4F01;&#x4E1A;&#x62E5;&#x6709;&#x5E02;&#x573A;&#x652F;&#x914D;&#x5730;&#x4F4D;&#x3002;&#x5982;&#x679C;&#x6709;&#x5173;&#x90E8;&#x95E8;&#x6210;&#x529F;&#x5730;&#x904F;&#x5236;&#x4F01;&#x4E1A;&#x95F4;&#x6076;&#x6027;&#x7ADE;&#x4E89;&#x7684;&#x8BDD;&#xFF0C;&#x7531;&#x6B64;&#x5BFC;&#x81F4;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7ED3;&#x679C;&#x5BF9;&#x4E2D;&#x56FD;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x53D1;&#x5C55;&#x5E76;&#x4E0D;&#x592A;&#x6709;&#x5229;&#x3002;&#x7531;&#x4E8E;&#x7F3A;&#x4E4F;&#x6709;&#x6548;&#x7ADE;&#x4E89;&#xFF0C;&#x4E2D;&#x56FD;&#x7F51;&#x901F;&#x8FD8;&#x7EF4;&#x6301;&#x5728;&#x4EE4;&#x4EBA;&#x4E0D;&#x6EE1;&#x7684;&#x4F4E;&#x4F4D;&#x4E0A;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x7C97;&#x7565;&#x7B97;&#x4E00;&#x4E0B;&#x201C;&#x7F51;&#x7EDC;&#x5835;&#x8F66;&#x6210;&#x672C;&#x201D;&#x3002;&#xFF08;&#x63A8;&#x8350;&#x9605;&#x8BFB;&#xFF1A;<a href="http://network.51cto.com/art/201008/218025.htm" target="_blank" rel="external">&#x62A5;&#x544A;&#x79F0;&#x6211;&#x56FD;&#x5BBD;&#x5E26;&#x8D44;&#x8D39;&#x76F8;&#x5F53;&#x4E8E;&#x97E9;&#x56FD;124&#x500D;</a>&#xFF09;&#x622A;&#x81F3;2010&#x5E74;&#x5E95;&#xFF0C;&#x4E2D;&#x56FD;&#x7F51;&#x6C11;&#x89C4;&#x6A21;&#x8FBE;&#x5230;4.57&#x4EBF;&#xFF0C;&#x4E2D;&#x56FD;&#x7F51;&#x6C11;&#x5E73;&#x5747;&#x6BCF;&#x5468;&#x4E0A;&#x7F51;&#x65F6;&#x957F;&#x4E3A;18.3&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x65E5;&#x5E73;&#x5747;&#x4E0A;&#x7F51;&#x65F6;&#x957F;2.6&#x4E2A;&#x5C0F;&#x65F6;&#x3002;&#x5047;&#x8BBE;&#x4E2D;&#x56FD;&#x7F51;&#x901F;&#x4E0D;&#x662F;&#x73B0;&#x5728;&#x7684;100.9KB/s&#xFF0C;&#x800C;&#x662F;&#x63A5;&#x8FD1;&#x5168;&#x7403;&#x5E73;&#x5747;&#x8FDE;&#x63A5;&#x901F;&#x5EA6;230.4KB/s.&#x4FDD;&#x5B88;&#x5047;&#x8BBE;&#x6BCF;&#x4F4D;&#x7F51;&#x6C11;&#x56E0;&#x6B64;&#x6BCF;&#x5929;&#x53EF;&#x4EE5;&#x8282;&#x7701;15&#x5206;&#x949F;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x90A3;&#x8FD9;15&#x5206;&#x949F;&#x7684;&#x4EF7;&#x503C;&#x7A76;&#x7ADF;&#x662F;&#x591A;&#x5C11;&#x94B1;&#x5462;&#xFF1F;&#x4E2D;&#x56FD;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x7684;&#x6BCF;&#x5C0F;&#x65F6;&#x6700;&#x4F4E;&#x5DE5;&#x8D44;&#x90FD;&#x8D85;&#x8FC7;9&#x5143;&#x3002;&#x82E5;&#x4FDD;&#x5B88;&#x5730;&#x6309;8&#x5143;&#x8BA1;&#x7B97;&#xFF0C;&#x90A3;&#x4E48;15&#x5206;&#x949F;&#x662F;2&#x5143;&#x3002;&#x7531;&#x4E8E;&#x4E2D;&#x56FD;&#x7F51;&#x6C11;&#x6570;&#x91CF;&#x5E9E;&#x5927;&#xFF0C;4.57&#x4EBF;&#x4EBA;&#x4E58;&#x4EE5;2&#x5143;&#x4E58;&#x4EE5;365&#x5929;&#xFF0C;&#x5219;&#x4E00;&#x5E74;3336&#x4EBF;&#x5143;&#x3002;3336&#x4EBF;&#x5143;&#x662F;&#x521A;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x7684;&#x4EAC;&#x6CAA;&#x9AD8;&#x94C1;&#x603B;&#x6295;&#x8D44;&#x989D;2209&#x4EBF;&#x5143;&#x7684;1.5&#x500D;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6BCF;&#x5E74;&#x4E2D;&#x56FD;&#x201C;&#x7F51;&#x7EDC;&#x5835;&#x8F66;&#x6210;&#x672C;&#x201D;&#x76F8;&#x540C;&#x4E8E;&#x4E00;&#x4E2A;&#x534A;&#x7684;&#x4EAC;&#x6CAA;&#x9AD8;&#x94C1;&#x5EFA;&#x8BBE;&#x6210;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x53EA;&#x662F;&#x7528;&#x4FDD;&#x5B88;&#x4F30;&#x7B97;&#x5F97;&#x51FA;&#x6765;&#x7684;&#x3002;</p>
<p>&#x672C;&#x6765;&#x8F6C;&#x81EA;51cto.com</p>

      
      
        <div class="post-copyright">
<p><a href="http://www.ithome.me/archives/中国网速为何总是这么慢？/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2015年7月28日 16:07</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/archives/ubuntu下给力的python编译器/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          ubuntu下给力的python编译器
        
      </div>
    </a>
  
  
    <a href="/archives/java笔试-单例模式/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">java笔试-单例模式</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2018
            
                 Simon.Chen
            
    	</div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {
		fancybox: false,
		mathjax: false,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: true,
     CDN_PATH: '' 
	}
</script>




    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/common.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>







  </div>
</body>
</html>
