<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>对升级速度忍无可忍 谷歌或将收回安卓控制权</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" content="#00796b">
  <meta name="msapplication-TileColor" content="#4E8071"/>
  
  
  
  
  <link rel="stylesheet" href="/css/style.css" type="text/css"> 
</head>


<body>

  <div id="container" class="container">
    <div class="left-col">
    <div class="intrude-less">
  <header id="header" class="inner">
    <a href="/" class="profilepic">
      <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	</a>
	<p class="header-subtitle">分享有助于提升</p>
    <nav class="header-menu">
      <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li>
      </ul>
    </nav>
  </header>				
</div>


    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  <div class="intrude-less">
    <header id="header" class="inner">
      <a href="/" class="profilepic">
        <img src="https://avatars2.githubusercontent.com/u/1478821?v=3&amp;s=140" class="block-select js-avatar" style="width: 100%;height: 100%;opacity: 1;">
	  </a>
	  <p class="header-subtitle">分享有助于提升</p>
	  <nav class="header-menu">
	    <ul>
        <li><a href="/">主页</a></li><li><a href="/archives">所有文章</a></li><li><a href="/categories/移动开发">移动开发</a></li><li><a href="/about-me">关于我</a></li><div class="clearfix"></div>
		</ul>
	  </nav>
	</header>				
  </div>
</nav>

      <div class="body-wrap">
<article id="post-对升级速度忍无可忍-谷歌或将收回安卓控制权" class="article article-type-post" itemscope itemprop="blogPost">

   
    
    <div class="article-meta">
      
<div class="article-date">
<span class="datetime-published-tag"> 2016-02-19 </span>
</div>


    </div>
    
    
  
  <div class="article-inner block-select">
  
    
    
      <header class="article-header">
        
           
  
    <h1 class="article-title" itemprop="name">
      对升级速度忍无可忍 谷歌或将收回安卓控制权
    </h1>
  

        
      </header>
      
      <div class="article-info article-info-post">
        
	<div class="article-tag tagcloud block-select">
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/android/">android</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/生态系统/">生态系统</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/谷歌/">谷歌</a></li></ul>
	</div>


        
             <div class="clearfix"></div>
        
      </div>
      
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x65B0;&#x6D6A;&#x7F8E;&#x80A1;&#x5317;&#x4EAC;&#x65F6;&#x95F4;19&#x65E5;&#x8BAF; &#x8C37;&#x6B4C;&#x5373;&#x5C06;&#x6536;&#x56DE;&#x5B89;&#x5353;&#x5347;&#x7EA7;&#x7684;&#x4E3B;&#x5BFC;&#x6743;&#xFF0C;&#x800C;&#x8FD9;&#x5C06;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x6539;&#x53D8;&#x5B89;&#x5353;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x5F53;&#x524D;&#x7684;&#x5F00;&#x53D1;&#x548C;&#x66F4;&#x65B0;&#x6A21;&#x5F0F;&#x3002;</p>
<p>theregister&#x62A5;&#x9053;&#x79F0;&#xFF0C;Edison Investment Research&#x5206;&#x6790;&#x5E08;&#x6E29;&#x838E;(Richard Windsor)&#x8BA4;&#x4E3A;&#xFF0C;&#x8C37;&#x6B4C;&#x5DF2;&#x7ECF;&#x5BF9;&#x8FDF;&#x7F13;&#x7684;&#x5347;&#x7EA7;&#x901F;&#x5EA6;&#x5FCD;&#x65E0;&#x53EF;&#x5FCD;&#xFF0C;&#x968F;&#x65F6;&#x53EF;&#x80FD;&#x5C06;&#x56FA;&#x4EF6;&#x5347;&#x7EA7;&#x7684;&#x63A7;&#x5236;&#x6743;&#x4ECE;&#x786C;&#x4EF6;&#x73A9;&#x5BB6;&#x7684;&#x624B;&#x4E2D;&#x6536;&#x56DE;&#x3002;</p>
<p>&#x6E29;&#x838E;&#x79F0;&#xFF0C;&#x5B89;&#x5353;6.0&#xFF0C;&#x5373;&#x6240;&#x8C13;&#x68C9;&#x82B1;&#x7CD6;&#x7684;&#x5347;&#x7EA7;&#x8FDB;&#x5C55;&#x8FDF;&#x7F13;&#xFF0C;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x4E86;&#x8C37;&#x6B4C;&#x7684;&#x65B0;&#x4EA7;&#x54C1;&#x63A8;&#x51FA;&#xFF0C;&#x5982;Now on Tap&#x7B49;&#x3002;&#x4ED6;&#x76F8;&#x4FE1;&#xFF0C;&#x4E3A;&#x4E86;&#x6539;&#x5584;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x8C37;&#x6B4C;&#x5C06;&#x4F1A;&#x76F4;&#x63A5;&#x63A5;&#x624B;&#x56FA;&#x4EF6;&#x5347;&#x7EA7;&#xFF0C;&#x800C;&#x8FC7;&#x53BB;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x662F;&#x5C06;&#x8FD9;&#x4E00;&#x4EFB;&#x52A1;&#x653E;&#x624B;&#x7ED9;&#x5236;&#x9020;&#x5546;&#x548C;&#x8FD0;&#x8425;&#x5546;&#x53BB;&#x505A;&#x7684;&#x3002;</p>
<p>&#x201C;&#x8C37;&#x6B4C;&#x6700;&#x7EC8;&#x5C06;&#x4F1A;&#x5F7B;&#x5E95;&#x63A7;&#x5236;&#x5B89;&#x5353;&#xFF0C;&#x5C06;&#x6574;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6574;&#x5408;&#x5230;&#x4ED6;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5C42;Google Mobile Services(GMS)&#x3002;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#xFF0C;&#x8C37;&#x6B4C;&#x624D;&#x80FD;&#x591F;&#x7ED3;&#x675F;&#x957F;&#x671F;&#x4EE5;&#x6765;&#x6301;&#x7EED;&#x6298;&#x78E8;&#x5B89;&#x5353;&#x4EA7;&#x54C1;&#x7684;&#x5E02;&#x573A;&#x9AD8;&#x5EA6;&#x788E;&#x7247;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x76F4;&#x63A5;&#x63A7;&#x5236;&#x8F6F;&#x4EF6;&#x7684;&#x9500;&#x552E;&#x3002;&#x201D;&#x6E29;&#x838E;&#x6307;&#x51FA;&#xFF0C;&#x201C;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#xFF0C;&#x8C37;&#x6B4C;&#x7684;&#x8BBE;&#x5907;&#x6700;&#x7EC8;&#x4E5F;&#x4F1A;&#x50CF;iOS&#x6216;&#x8005;Windows 10&#x4EA7;&#x54C1;&#x90A3;&#x6837;&#xFF0C;&#x5236;&#x9020;&#x5382;&#x5546;&#x663E;&#x7136;&#x4E0D;&#x4F1A;&#x518D;&#x6709;&#x4EFB;&#x4F55;&#x6539;&#x52A8;&#x7684;&#x6743;&#x529B;&#x3002;&#x201D;<br><img src="http://n.sinaimg.cn/finance/transform/20160219/ghJv-fxpsfak1657126.jpg" alt="&#x5B89;&#x5353;&#x7CFB;&#x7EDF;&#x662F;&#x8C37;&#x6B4C;&#x4F17;&#x591A;&#x4EA7;&#x54C1;&#x4E0E;&#x670D;&#x52A1;&#x7684;&#x4E2D;&#x67A2;&#x5B89;&#x5353;&#x7CFB;&#x7EDF;&#x662F;&#x8C37;&#x6B4C;&#x4F17;&#x591A;&#x4EA7;&#x54C1;&#x4E0E;&#x670D;&#x52A1;&#x7684;&#x4E2D;&#x67A2;"></p>
<p>&#x6E29;&#x838E;&#x6307;&#x51FA;&#xFF0C;&#x6839;&#x636E;Edison&#x7684;&#x7EDF;&#x8BA1;&#xFF0C;&#x5C3D;&#x7BA1;&#x548C;&#x82F9;&#x679C;&#x7684;iOS 9&#x5347;&#x7EA7;&#x5927;&#x81F4;&#x662F;&#x540C;&#x65F6;&#x63A8;&#x51FA;&#xFF0C;&#x4F46;&#x662F;&#x68C9;&#x82B1;&#x7CD6;&#x5230;&#x73B0;&#x5728;&#x4E5F;&#x53EA;&#x767B;&#x4E0A;&#x4E86;1.2%&#x7684;&#x5B89;&#x5353;&#x8BBE;&#x5907;&#x3002;&#x53EF;&#x662F;&#xFF0C;&#x65B0;&#x7684;iOS&#x5374;&#x5DF2;&#x7ECF;&#x8986;&#x76D6;&#x4E86;87%&#x7684;&#x82F9;&#x679C;&#x4EA7;&#x54C1;&#xFF0C;&#x800C;&#x8FD9;&#x5F53;&#x7136;&#x8981;&#x5F52;&#x56E0;&#x4E8E;&#x82F9;&#x679C;&#x5BF9;&#x81EA;&#x5DF1;&#x79FB;&#x52A8;&#x4EA7;&#x54C1;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x7684;&#x7D27;&#x5BC6;&#x63A7;&#x5236;&#x3002;</p>
<p>&#x4E0D;&#x80FD;&#x8BA9;&#x5B89;&#x5353;&#x786C;&#x4EF6;&#x83B7;&#x5F97;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x8C37;&#x6B4C;&#x81EA;&#x7136;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x53D1;&#x5E03;&#x65B0;&#x7684;&#x8F6F;&#x4EF6;&#x548C;&#x670D;&#x52A1;&#x5347;&#x7EA7;&#x3002;&#x6E29;&#x838E;&#x76F8;&#x4FE1;&#xFF0C;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#xFF0C;&#x8C37;&#x6B4C;&#x5C06;&#x6700;&#x7EC8;&#x51B3;&#x5B9A;&#x81EA;&#x5DF1;&#x5168;&#x9762;&#x7BA1;&#x7406;&#x5B89;&#x5353;&#xFF0C;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x7684;&#x624B;&#x673A;&#x548C;&#x5E73;&#x677F;&#x90FD;&#x80FD;&#x591F;&#x8DDF;&#x4E0A;&#x6700;&#x65B0;&#x7684;&#x8F6F;&#x4EF6;&#x53D1;&#x5E03;&#x3002;</p>
<p>&#x201C;&#x6211;&#x4EEC;&#x4F30;&#x8BA1;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x8C37;&#x6B4C;&#x5728;&#x786C;&#x4EF6;&#x65B9;&#x9762;&#x7684;&#x8981;&#x6C42;&#x4E5F;&#x4F1A;&#x5927;&#x5927;&#x5F3A;&#x5316;&#xFF0C;&#x8FD9;&#x662F;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x4ED6;&#x4EEC;&#x7684;&#x8F6F;&#x4EF6;&#x90FD;&#x80FD;&#x591F;&#x987A;&#x7545;&#x8FD0;&#x8F6C;&#x3002;&#x201D;</p>
<p>&#x201C;&#x5C3D;&#x7BA1;&#x8FD9;&#x5BF9;&#x4E8E;&#x8C37;&#x6B4C;&#x6765;&#x8BF4;&#x80AF;&#x5B9A;&#x662F;&#x597D;&#x4E8B;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x5F3A;&#x5316;&#x516C;&#x53F8;&#x7684;&#x8425;&#x5229;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x957F;&#x671F;&#x4EE5;&#x6765;&#x4E00;&#x76F4;&#x5904;&#x5883;&#x4E0D;&#x4F73;&#x7684;&#x624B;&#x6301;&#x8BBE;&#x5907;&#x516C;&#x53F8;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x5374;&#x53EF;&#x80FD;&#x662F;&#x81F4;&#x547D;&#x4E00;&#x51FB;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x624B;&#x673A;&#x51E0;&#x4E4E;&#x5C31;&#x5DF2;&#x7ECF;&#x65E5;&#x7528;&#x54C1;&#x5316;&#x4E86;&#xFF0C;&#x53EA;&#x6709;&#x4E09;&#x661F;&#x8FD8;&#x80FD;&#x591F;&#x6301;&#x7EED;&#x4FDD;&#x6301;&#x8D85;&#x8FC7;2%&#x5230;4%&#x7684;&#x5229;&#x6DA6;&#x7387;&#x3002;&#x201D;</p>
<p>&#x8C37;&#x6B4C;&#x5DF2;&#x7ECF;&#x663E;&#x793A;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x6536;&#x7D27;&#x5B89;&#x5353;&#x7F30;&#x7EF3;&#x7684;&#x8FF9;&#x8C61;&#x3002;&#x672C;&#x6708;&#x65E9;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C55;&#x5F00;&#x4E86;&#x4E00;&#x573A;&#x9488;&#x5BF9;root&#x624B;&#x673A;&#x7684;&#x6253;&#x51FB;&#x884C;&#x52A8;&#xFF0C;&#x53D1;&#x5E03;&#x4E86;&#x53EA;&#x80FD;&#x5728;&#x672A;&#x89E3;&#x9501;&#x624B;&#x673A;&#x4E0A;&#x4F7F;&#x7528;&#x7684;Google Pay&#x3002;(&#x5B50;&#x887F;)</p>
<blockquote>
<p>&#x539F;&#x6587;&#x5730;&#x5740;: <a href="http://tech.sina.com.cn/it/2016-02-19/doc-ifxprucs6256056.shtml" target="_blank" rel="external">http://tech.sina.com.cn/it/2016-02-19/doc-ifxprucs6256056.shtml</a></p>
</blockquote>

      
      
      
        <div class="post-copyright">
<p><a href="http://www.ithome.me/archives/对升级速度忍无可忍-谷歌或将收回安卓控制权/">本文</a>为原创，转载请遵守本站的版本</p>
<p class="updated-time" >更新于: </span>2016年2月19日 16:02</p>
</div>

      
    </div>
    
  </div>
  
    
<nav id="article-nav" class="block-select">
  
    <a href="/archives/编译Android-APP-30条经验帮你提升/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          编译Android APP---30条经验帮你提升
        
      </div>
    </a>
  
  
    <a href="/archives/LinearLayout实现横向跑马灯效果/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">LinearLayout实现横向跑马灯效果</div>
      <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>


  
</article>





</div>
      <footer id="footer" class="block-select">
  <div class="outer">
    <div id="footer-info">
      <div class="footer-left">&copy; 2015-2018
        Simon.Chen
      </div>
    </div>
  </div>
</footer>

    </div>
    <script>
	var ThemeXConfig = {fancybox: false,mathjax: false,animate: false,isHome: false,isPost: true,isArchive: false,isTag: false,isCategory: false,open_in_new: true, CDN_PATH: '' }
</script>


    <script src="/js/jquery-1.9.1.min.js"></script>
    <script src="/js/base.js"></script>
    <script src="/js/jquery.lazyload.min.js"></script>





  </div>
</body>
</html>
